[
  {
    "name": "Alex",
    "id": "1-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has a history of substance abuse and has been through rehab to overcome it. He has had issues with his family, particularly with his mother, where he has felt rejected and emotionally neglected. He has struggled with obesity since childhood, which has affected his self-esteem and body image. He also has a history of being victimized and bullied due to his weight.",
    "helpless_belief": [
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [],
    "intermediate_belief": "Helpless: I'm just not very good at handling stress and I have poor self-control, which is why I need to not put myself in stressful situations. \n Unlovable: If I show my true self, people will reject me the way my mother rejected me.",
    "intermediate_belief_depression": "Helpless: There's nothing I can do to change my situation. I cannot control myself. \nUnlovable: I don't deserve to be happy, so why even try to stay clean?",
    "coping_strategies": "The patient has adopted avoidance as a coping strategy by distancing himself from his family to reduce exposure to negativity and conflict. He has started scheduling pleasant activities and planning his day ahead of time in order to maintain a sense of control over his emotions and circumstances.",
    "situation": "Alex's cousin invited him to attend his upcoming wedding.",
    "auto_thought": "It will be stressful and negative; people will ask me questions I cannot answer or don't want to answer; my mum would be ashamed of me and critical of me as always; They don't want me there anyway, nobody likes me in this family.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Ignored the invitation and did not respond to the RSVP request. Ignored phone calls from family.",
    "cognitive_distortion": "Fortune Telling, Mind Reading, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept and Identify the Thoughts: We will start by discussing the invitation to your cousin's wedding and the negative thoughts that arise. We'll identify the cognitive distortions, particularly Fortune Telling and Mind Reading, in your belief that the event will be stressful and that family members will judge you. 2. Gather Evidence: I will guide you in exploring the evidence for and against your thoughts. We'll ask questions like: 'What past experiences support the idea that family members will react negatively?' and 'What evidence suggests that they might be supportive or understanding?' 3. Challenge the Thoughts: We will critically evaluate the thoughts you have about being rejected or judged. For instance, I will ask, 'How do you know they would be ashamed of you?' or 'Have there been times when they showed support?' 4. Reframe the Thoughts: Based on the evidence gathered, we will work to reframe your initial thoughts. Instead of thinking 'They don’t want me there anyway,' we might reframe it to 'I’ve received invitations before, and my family has shown they care about me.' 5. Explore Feelings: We will discuss how you feel when you think these negative thoughts compared to when you consider the alternative perspective. This will help you understand the emotional reasoning behind your beliefs. 6. Develop a Plan: We will create a step-by-step plan for how to approach the wedding. This might include preparing responses to potential questions, setting boundaries with family members, or even planning to attend for a short time. 7. Practice and Link to Behavior: Your task will be to apply this questioning technique in daily situations where you feel anxious about interactions with others. This will help build your confidence in challenging negative assumptions and improve your emotional resilience.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I really want to talk about my family, but I just feel so overwhelmed and sad thinking about it. Maybe it’s better if I just don’t say anything.",
    "resistance_rationale": "The client's history of emotional neglect and feelings of being unlovable contribute to his tendency to withdraw in sessions. His automatic thoughts reflect a fear of negativity and rejection, leading to disengagement when discussing painful topics. This aligns with the Intermediate level of resistance, as he shows a mix of reluctance and the desire to engage."
  },
  {
    "name": "Blaise",
    "id": "2-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "Patient has been experiencing frustration, anxiety, and anger related to familial relationships. This is significantly influenced by a conversation regarding his wedding list with his parents, leading to insights about his feelings and actions similar to his father's pattern of seeking approval and unconditional love from family members who do not provide it.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am trapped."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "Patient holds the belief that one must continuously seek familial approval and support to feel safe and valued. Patient also believes that investing in unhealthy familial relationships is necessary despite ongoing distress and frustration.",
    "intermediate_belief_depression": "During periods of low mood, the patient likely adopts more polarized views on family loyalty and support, feeling an increased sense of obligation to pursue approval, which exacerbates feelings of helplessness and rejection.",
    "coping_strategies": "Patient tends to engage in conversations with family members about emotional support and seeks to change family dynamics, though this is often met with resistance.",
    "situation": "Talk with parents about wedding list and encounter some disagreements on inviting certain family members.",
    "auto_thought": "If I do not make compromise to them, they will be angry. If they are angry they will abandon me.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Pretend to be happy with parents' suggestions. Go along with parents wishes. Decreased sleep. Worry and perseveration.",
    "cognitive_distortion": "Fortune Telling, Mind Reading, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: We'll start by discussing your worries about your parents' reactions regarding the wedding list and how these worries may be leading you to predict negative outcomes without evidence. 2. Identify Specific Thoughts: I will ask you to express your thoughts about the potential consequences of not compromising with your parents. 3. Gather Evidence: We will explore the validity of these thoughts by asking questions such as: 'What evidence do you have that they will be angry?' and 'Have there been times when you expressed your own opinions and it turned out better than you expected?' 4. Challenge the Predictions: We will examine alternative outcomes that could occur if you assert your preferences. I will guide you to consider how your parents might react positively or neutrally instead of always assuming the worst. 5. Develop a Balanced Perspective: After gathering evidence and alternative scenarios, we will work on reframing your initial thoughts. For example, instead of thinking, 'If I don't compromise, they will abandon me,' we might reframe it to, 'It's possible they will initially be upset, but it doesn't mean they will abandon me.' 6. Practice Assertiveness: We will discuss ways to communicate your feelings and preferences assertively to your parents, practicing phrases you can use that express your needs while still being respectful of their viewpoints. 7. Monitor Progress: I will encourage you to keep a journal of your interactions with your parents, noting your feelings and any changes in their behavior. This will help us assess the effectiveness of your new approach in future sessions.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I feel like you just don't understand my family dynamics or how hard this is for me. It's like you have a textbook solution for something that feels so personal.",
    "resistance_rationale": "The client has expressed feelings of frustration and helplessness regarding family relationships and their need for approval. This may lead them to criticize the therapist’s approach as being disconnected from their lived experiences, especially when discussing sensitive topics like family dynamics."
  },
  {
    "name": "Blaise",
    "id": "2-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "Patient has been experiencing frustration, anxiety, and anger related to familial relationships. This is significantly influenced by a conversation regarding his wedding list with his parents, leading to insights about his feelings and actions similar to his father's pattern of seeking approval and unconditional love from family members who do not provide it.",
    "helpless_belief": [
      "I am needy.",
      "I am trapped."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "Patient holds the belief that one must continuously seek familial approval and support to feel safe and valued. Patient also believes that investing in unhealthy familial relationships is necessary despite ongoing distress and frustration.",
    "intermediate_belief_depression": "During periods of low mood, the patient likely adopts more polarized views on family loyalty and support, feeling an increased sense of obligation to pursue approval, which exacerbates feelings of helplessness and rejection.",
    "coping_strategies": "Patient tends to engage in conversations with family members about emotional support and seeks to change family dynamics, though this is often met with resistance.",
    "situation": "Observing father's relentless pursuit of approval from his sister",
    "auto_thought": "Why can't I stop seeking approval in situations that I recognize as unhealthy? Am I a sick person just like my father?",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Patterns of revisiting stressful relationships and workplace, seeking safety within family circle. Reassurance seeking.",
    "cognitive_distortion": "Overgeneralizing, Emotional Reasoning, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Technique: Begin the session by explaining the concept of Evidence-Based Questioning. Discuss how often our thoughts can feel true but may not be based on actual evidence.\n2. Identify the Negative Thought: Work with the client to articulate the specific negative thought they have, such as 'Am I a sick person just like my father?' and explore the emotions associated with it.\n3. Gather Evidence: Encourage the client to think critically about this thought by asking questions like: 'What evidence do you have that supports this thought?' and 'What evidence contradicts this thought?' \n4. Challenge the Thought: Guide the client to evaluate the validity of their thought. Ask, 'Is it really true that seeking approval makes you just like your father? Are there other ways to view your actions?' \n5. Reframe the Thought: After examining the evidence, help the client develop a more balanced perspective. For instance, they might conclude: 'I seek approval, but it doesn’t define my worth or make me sick. It’s a natural human desire to want connection and acceptance.' \n6. Connect to Feelings: Discuss how this reframed thought might change the client's feelings and behaviors. Explore how they can respond differently in situations where they feel the urge to seek approval. \n7. Homework Assignment: Assign the client to practice Evidence-Based Questioning in their daily life, especially in situations that elicit feelings of anxiety or frustration regarding familial approval. Encourage them to keep a journal of their thoughts and the evidence they find for and against those thoughts.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ambivalent",
    "resistance_internal_monologue": "I know I should be focusing on my feelings about my family, but I can’t help but think about how I always end up in the same arguments with them.",
    "resistance_rationale": "The client demonstrates ambivalence about addressing familial issues, often deflecting from the core topics of discussion. This indicates a level of resistance that is not overtly confrontational but still significant, reflecting a struggle to engage fully with the therapeutic process while feeling torn between wanting to change and the comfort of familiar patterns."
  },
  {
    "name": "Caleb",
    "id": "3-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient is a PhD candidate doing scientific research, with references to a study involving sequencing and a 'bright and shiny stone scientist' named Kelly. The patient appears to struggle with finishing projects, feeling as if the last bit of work is as significant as the entire project. The patient also mentions working on a project with a senior scientist who has struggled to gain recognition in his career.",
    "helpless_belief": [
      "I am incompetent.",
      "I am a failure, loser.",
      "I am defective."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "If I don't complete my work perfectly or find something significant, I am not successful or competent. ",
    "intermediate_belief_depression": "When I'm struggling with my work or feeling disconnected, it's because I'm not capable or deserving of success. Others are more successful because they have qualities I lack.",
    "coping_strategies": "The patient engages in activities like painting and meditating, which may serve as a healthy outlet for stress. They also seem to avoid intense work hours and choose to work when they feel like it, which could be an attempt to manage work-related stress. However, there is also evidence of ruminating about work and self, which can be an unhealthy coping mechanism.",
    "situation": "Comparing oneself to colleagues who work longer hours and publish more papers.",
    "auto_thought": "I'm not working hard enough, I'm not as good as they are.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Ruminates about perceived failures and inadequacies. Procrastinates (creates unhelpful cycle).",
    "cognitive_distortion": "Comparing and Despairing, All-or-Nothing Thinking",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning Technique\n1. Introduce the Concept: We'll start by discussing the impact of comparing yourself to colleagues and how this has been affecting your self-esteem and motivation. I will introduce the Evidence-Based Questioning technique to challenge these negative assumptions and beliefs.\n2. Identify the Automatic Thought: We will pinpoint the automatic thought: 'I'm not working hard enough, I'm not as good as they are.'\n3. Gather Evidence: I will guide you to list evidence that supports and contradicts this thought. Questions will include: 'What specific achievements do you have that show your hard work?' and 'Have there been times when you succeeded despite these comparisons?'\n4. Challenge the Comparisons: Next, we will explore the validity of comparing yourself to others. I will ask: 'What do you know about their circumstances? Are they truly better or is it an unfair comparison?'\n5. Reassess Your Beliefs: After gathering evidence, I will help you reassess your beliefs about your work ethic and capabilities. We'll consider questions like: 'What would you say to a friend who felt this way?' and 'How would you rate your success on a scale from 1 to 10, based on your own achievements?'\n6. Develop a Balanced Perspective: We will work together to create a balanced statement that acknowledges your hard work and achievements without undermining yourself through comparison. For example: 'While others may publish more, my contributions are valuable and I am progressing in my own right.'\n7. Set Actionable Goals: Finally, we will set small, actionable goals to focus on your personal progress and reduce the tendency to compare. This could include setting specific times for work and reflecting on what you’ve accomplished each week. \n8. Practice Regularly: Encourage you to practice this questioning technique whenever you notice negative comparisons, reinforcing the idea that your value is not solely based on comparisons with others.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Pessimistic",
    "resistance_internal_monologue": "I know I should be focusing on my work, but it feels impossible to measure up. Maybe I should just talk about how I feel instead.",
    "resistance_rationale": "The client struggles with feelings of inadequacy and often ruminates on perceived failures, leading to a tendency to sidetrack discussions in therapy. This sidetracking reflects their ambivalence towards addressing their core issues directly, as they may feel overwhelmed and pessimistic about their ability to succeed."
  },
  {
    "name": "Jessa",
    "id": "4-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "Jessa has recently undergone shoulder surgery and is recovering from very painful processes. She is also dealing with additional pain, numbness, and tingling due to a herniated disc in her cervical spine. Jessa has a history of physical therapy due to an inability to walk and back issues. She has experienced being very ill in the past, which led to a significant period of being unable to walk and feeling down. After recovering, she started a new relationship, but her physical symptoms resurfaced.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am a victim.",
      "I am trapped.",
      "I am defective."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "Jessa tends to listen and believe people she perceives as smart or those who speak with conviction, treating their words as if they are always accurate or true. She also holds beliefs that she must find solutions and answers immediately, and becomes frustrated when things are not resolved quickly. ",
    "intermediate_belief_depression": "During depressive episodes, Jessa believes that she will never be the same again and that her situation is permanent. ",
    "coping_strategies": "She also seeks external validation and guidance from friends and professionals. When overwhelmed, she can fall into a state of hysteria, but she is learning to use humor and perspective-taking to calm herself down. ",
    "situation": "Receiving an MRI report showing a herniated disc.",
    "auto_thought": "I'm too young to have a herniated disc. My life just never got easier. I'll probably suffer from all these issues forever.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Phoned therapist in a state of hysteria.",
    "cognitive_distortion": "Catastrophizing, Fortune Telling, Helpless Belief",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing\n1. Introduction: Begin by acknowledging Jessa's fears regarding her MRI report and how it has led to feelings of hysteria. Explain the concept of catastrophizing and how it can distort her perception of reality. \n2. Identify Catastrophic Thoughts: Together, we'll identify the specific catastrophic thoughts she has about her condition (e.g., 'I'll probably suffer from all these issues forever'). \n3. Challenge the Thoughts: Ask Jessa to consider the evidence for and against these catastrophic thoughts. What is the likelihood that her fears will come true? What have doctors said about her condition? \n4. Explore Alternatives: Help her brainstorm alternative outcomes that are less extreme and more likely (e.g., 'I can manage this with treatment and support'). \n5. Assess Coping Strategies: Discuss the coping strategies she has used in the past and explore how they can be helpful now. Encourage the use of humor and perspective-taking as tools to manage her anxiety. \n6. Create a Plan: Develop a step-by-step plan for how she will address her herniated disc in a proactive manner (e.g., seeking physical therapy, following up with her doctor). \n7. Practice Mindfulness: Introduce mindfulness techniques to help her stay grounded in the present instead of worrying about the future. \n8. Homework: Assign Jessa to write down her thoughts when she feels overwhelmed and to practice reframing them using the new perspectives discussed in the session.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Interrupting",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I just don't see how this is helping. Can't we talk about something more relevant to what I'm dealing with right now?",
    "resistance_rationale": "Jessa's frustration with the slow pace of treatment and her immediate need for solutions reflects her tendency to interrupt discussions when she feels overwhelmed. Her beliefs about helplessness and the permanence of her situation contribute to her mixed engagement; she desires help but struggles with feeling understood and validated in her current context."
  },
  {
    "name": "Chris",
    "id": "5-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has a history of working overseas and creating a website related to that work. He express a pattern of getting excited about new ideas but then becoming conflicted, losing confidence, and abandoning projects when encountering challenges. Additionally, the patient is dealing with issues related to his father, including writing a 'living letter' as part of his process of learning to forgive him.",
    "helpless_belief": [],
    "unlovable_belief": [
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "If I don't succeed in my projects or if people don't acknowledge my work, then it means I am not valued or desired. I need to be constantly validated by others to feel worthwhile.",
    "intermediate_belief_depression": "When I face challenges or feel stuck, it means I am failing and this confirms that I am undesirable or not good enough. Others' approval is the only measure of my success and worth.",
    "coping_strategies": "The patient uses fantasy as a coping mechanism to escape feelings of worthlessness and to seek a sense of acceptance and value. They also use social media for validation and rely on external feedback to feel appreciated. (all avoidance based strategies)",
    "situation": "Reflecting on past successes and current challenges.",
    "auto_thought": "I've succeeded before without knowing the outcome, so I should keep going. But what if I fail again?",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Becomes preoccupied with potential failure, may retreat into fantasy or avoid taking action.",
    "cognitive_distortion": "Overgeneralizing, Labeling, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin by discussing the client's feelings of worthlessness and the thought 'What if I fail again?' We will identify how this leads to overgeneralizing and labeling themselves based on past experiences. 2. Gather Evidence: Ask the client to reflect on past successes and identify specific instances where they succeeded despite uncertainty. Prompt them to recall details of those successes. 3. Challenge the Negative Thought: Use evidence-based questioning to challenge the belief that they are worthless if they fail. Questions may include: 'What evidence do you have that one failure defines your worth?' and 'How do you feel about your past successes?' 4. Explore Alternative Perspectives: Encourage the client to consider how others view their past successes and what they might say to a friend in a similar situation. 5. Create a Balanced Thought: Help the client formulate a more balanced thought, such as 'I have succeeded in the past, and even if I face challenges, it does not define my worth.' 6. Reinforce Positive Beliefs: Work on strategies to reinforce the new belief, such as gratitude lists or affirmations related to their abilities and past successes. 7. Homework Assignment: Ask the client to note any instances where they catch themselves overgeneralizing or labeling, and practice reframing those thoughts using the new balanced perspective established in the session.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I just don’t know if I can handle talking about my failures right now. Maybe it’s better to just keep things to myself.",
    "resistance_rationale": "The client’s history of retreating into fantasy and avoiding challenges indicates a tendency towards emotional withdrawal when confronted with difficult topics. His beliefs about needing validation and feeling worthless also contribute to hesitance in engaging with therapy, reflecting ambivalence about addressing his issues directly."
  },
  {
    "name": "Daisy",
    "id": "6-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient is a 28-year-old student who has been trying to assert independence and self-sufficiency, particularly in financial matters, after returning from Egypt. The patient has previously relied on parents for support but is now attempting to take on more adult responsibilities such as paying bills, managing finances, and dealing with health insurance on her own for the first time. The patient's brother is still financially dependent on their parents, which the patient is consciously trying to avoid for herself.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am needy.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I must do everything independently to prove that I am a capable adult and to avoid being a burden or like my brother.",
    "intermediate_belief_depression": "I have failed at independence and self-sufficiency, and I need to ask for help which makes me feel incompetent.",
    "coping_strategies": "The patient attempts to handle situations independently without relying on others, particularly parents. When faced with anxiety or uncertainty, the patient may act hastily or seek immediate resolution rather than waiting. The patient also aims to budget and handle finances alone, which is a form of asserting control and self-reliance.",
    "situation": "Contemplating asking parents for financial help.",
    "auto_thought": "I shouldn't need my parents' help at this age. I'm supposed to be independent.",
    "emotion": [
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Refusing parents' offers for help and trying to find affordable therapy options.",
    "cognitive_distortion": "Should Statements, Emotional Reasoning, Comparing and Despairing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session Focus: We'll begin by discussing your feelings around asking your parents for financial help and the beliefs that are causing you distress. Specifically, we will explore the notion that you 'should' be independent and how this impacts your emotions and decisions. 2. Identify Core Beliefs: I will ask you to articulate what independence means to you and what thoughts arise when considering asking for help. We will identify the 'should' statements that are perpetuating your feelings of shame and inadequacy. 3. Gather Evidence: Using evidence-based questioning, we will challenge the belief that needing help equates to failure. I will prompt you with questions such as: - 'What evidence do you have that asking for help makes you incompetent?' - 'Can you think of instances where asking for help has been beneficial for yourself or others?' 4. Examine Alternative Perspectives: Together, we will explore different scenarios where asking for help is not only acceptable but also a sign of strength and maturity. We will discuss how other successful adults navigate their need for support. 5. Reassess Your Thoughts: I will guide you to reassess your auto-thought of 'I shouldn't need my parents' help at this age' by weighing the evidence we gathered. We will create a list of pros and cons regarding reaching out for help. 6. Develop a New Narrative: Based on the evidence and alternative perspectives, we will create a new narrative that frames asking for help as a responsible and adult action rather than a failure. For example, 'Reaching out for support from my parents is a way to manage my responsibilities effectively.' 7. Action Plan: To conclude, we will discuss practical steps to take when you feel overwhelmed, including potential conversation starters for approaching your parents. I will encourage you to set a small goal of discussing your situation with them, reinforcing that asking for help is part of being an adult.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ashamed",
    "resistance_internal_monologue": "I really want to ask for help, but it feels so embarrassing to admit that I can't do everything on my own.",
    "resistance_rationale": "The client's history indicates a strong desire for independence and a belief that asking for help equates to incompetence. This internal conflict leads to emotional withdrawal in therapy, highlighting her struggle with shame about needing support while wanting to prove her capability."
  },
  {
    "name": "Bryce",
    "id": "7-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has a history of working long hours, similar to past experiences while touring, indicating a history of demanding work environments. The patient has also been dealing with unresolved issues with his father, including past abuse and a recent exchange of letters addressing this painful history. The patient's father's response to the letter appears to have been a significant event for the patient, potentially contributing to his current mental state.",
    "helpless_belief": [],
    "unlovable_belief": [],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "The patient seems to hold the belief that work and productivity are essential to his self-worth and that idle time or personal development is wasted time. He also appears to believe that completing tasks and being acknowledged for his work is important for his value and self-esteem.",
    "intermediate_belief_depression": "During periods of depression, the patient may believe that he is not making progress in life and that his efforts are meaningless. This could lead to a lack of motivation to engage in activities and to complete tasks, further reinforcing feelings of inadequacy and worthless.",
    "coping_strategies": "The patient uses work as a coping strategy to feel productive and to reduce idle time, which he associates with negative feelings. He also use avoidance strategies when he perceives himself not productive and worthless, such as scrolling on social media. ",
    "situation": "Contemplating the value and completion of his personal projects, such as building a website.",
    "auto_thought": "What's the point? No one will know it's me, and I'm not getting paid or acknowledged. I shouldn't do things for my own enjoyment.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "disappointed"
    ],
    "behavior": "Procrastinates on personal projects and engages in unfulfilling activities like social media scrolling.",
    "cognitive_distortion": "Disqualifying the Positive",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: We will start by discussing your contemplation of personal projects and the feelings of worthlessness that arise. I'll explain the concept of disqualifying the positive and how it relates to your thoughts about productivity and self-worth. 2. Identify Specific Thoughts: I will ask you to share specific thoughts you have when considering your personal projects and the reasons for your procrastination. We'll explore your auto thought: 'What's the point? No one will know it's me, and I'm not getting paid or acknowledged.' 3. Gather Evidence: Together, we will list evidence for and against this thought. For example, what are some positive outcomes you have experienced from engaging in personal projects, even if they weren't acknowledged? 4. Challenge the Thought: I will guide you through a series of questions to critically evaluate the validity of your belief that your efforts are meaningless. Questions may include: 'Have you ever enjoyed the process of creating something for yourself?' and 'What do you think you would gain from completing a project, even if no one else sees it?' 5. Reframe the Thought: Based on our discussion, we will work to create a more balanced thought. For instance, instead of 'I shouldn't do things for my own enjoyment,' we might reframe it to 'Engaging in personal projects can bring me joy and fulfillment, regardless of external acknowledgment.' 6. Practice and Integration: I will encourage you to experiment by setting small, manageable goals for your personal projects. After completing them, we will reflect on the feelings and thoughts that arise. This practice will help reinforce the value of personal fulfillment and challenge the belief that productivity is the only measure of worth. 7. Conclude with Reflection: We will end the session by reflecting on what you've learned and how you can apply this perspective moving forward, emphasizing that self-worth can come from intrinsic satisfaction rather than external validation.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Pessimistic",
    "resistance_internal_monologue": "I get that I should be working on these projects, but honestly, what’s the point? No one will notice or care.",
    "resistance_rationale": "The client displays ambivalence about engaging in personal projects, indicating an internal struggle with feelings of worthlessness and a belief that personal development is a waste of time. This leads to sidetracking behaviors during therapy as he avoids fully addressing his feelings and the value of his efforts."
  },
  {
    "name": "Ramona",
    "id": "8-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has experienced a traumatic incident involving a sexual assault by her partner, Ivan. This has led to a complex dynamic in their relationship, where trust and intimacy are significant issues. The patient has been working through these issues and has seen some improvement in the relationship dynamics, as Ivan has been making efforts to be more considerate and reestablish trust.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am a victim."
    ],
    "unlovable_belief": [
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If I'm not in control, something bad will happen. I must be vigilant at all times to prevent being hurt again. People close to me may hurt me if I let my guard down. ",
    "intermediate_belief_depression": "My efforts to rebuild trust may be futile. I might never be able to feel safe or loved again. I am at risk of being hurt even when things seem to be improving.",
    "coping_strategies": "The patient uses vigilance and control as a coping strategy to ensure her safety and prevent further harm. ",
    "situation": "Recognizing improvements in Ivan's behavior, but feeling scared by the physical intimacy that is returning to the relationship.",
    "auto_thought": "Even though things are improving, I'm scared to be vulnerable again. ",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Engaging in physical intimacy with caution and the need for control. Freezes. Unable to initiate intimacy.",
    "cognitive_distortion": "Fortune Telling, Emotional Reasoning, Catastrophizing",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing\n1. Introduce the Concept and Identify the Target: We will begin by discussing your feelings of fear and anxiety surrounding the return of physical intimacy in your relationship with Ivan. We'll identify the catastrophic thinking patterns that lead you to predict negative outcomes, such as being hurt again.\n2. Explore Specific Fears: I will ask you to articulate your specific fears regarding intimacy. What do you believe will happen if you allow yourself to be vulnerable? We'll write these fears down to examine them closely.\n3. Challenge Catastrophic Thoughts: Together, we will evaluate the validity of these fears. I will guide you through questions like: \"What evidence do you have that supports these predictions? Have there been positive changes in Ivan's behavior?\" This will help in identifying any exaggerations in your thinking.\n4. Examine Likelihood and Consequences: We will discuss the likelihood of your feared outcomes occurring. What is the probability that something bad will happen compared to it not happening? We will also explore what you could do if those feared outcomes did occur, to ensure you feel more prepared and empowered.\n5. Create a Balanced Perspective: Based on our discussion, we will work together to formulate a more balanced thought about intimacy. For example, instead of thinking \"If I let my guard down, I will be hurt again,\" we might reframe it to \"While there is a risk in being vulnerable, I have the ability to communicate my needs and boundaries with Ivan.\"\n6. Develop Coping Strategies: We will identify coping strategies to help you manage anxiety when it arises. This may include grounding techniques, mindfulness, or communicating openly with Ivan about your feelings and boundaries.\n7. Practice and Reinforcement: As a concluding exercise, I will encourage you to practice reframing your thoughts in real-life situations where you feel anxious about intimacy. We will discuss how to apply this technique in future interactions with Ivan, reinforcing the belief that it's okay to take small steps towards vulnerability while maintaining your safety.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Interrupting",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Anxious",
    "resistance_internal_monologue": "I want to talk about how I feel, but I can't help but think that if I share too much, it will just make things worse.",
    "resistance_rationale": "The client's history of trauma has led to a heightened sense of vigilance and anxiety about vulnerability, which manifests as interruption in sessions. They are engaged yet conflicted, wanting to express their fears but simultaneously holding back due to their past experiences and beliefs about safety in relationships."
  },
  {
    "name": "Fiona",
    "id": "9-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "ingratiating"
    ],
    "history": "The patient has a long-standing relationship with a friend named Jersey, who has undergone multiple surgeries due to her disabilities, including a below-the-knee amputation and knee replacement. The patient has been a supportive figure during Jersey's medical procedures and recovery but currently feels overwhelmed with her own life stresses. The patient also experiences conflict with her roommate, Ashby, regarding household issues.",
    "helpless_belief": [],
    "unlovable_belief": [
      "I am undesirable, unwanted.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If I ask for what I want, I'm unlikely to get it and it's probably going to be all ruined anyway. I should always try to help others and prioritize others' needs over myself.",
    "intermediate_belief_depression": "My efforts to help others are not enough. Nobody likes me no matter how much I help them.",
    "coping_strategies": "The patient copes by trying to provide practical support as much as she can, like cooking meals for friends in need, and by attempting to manage situations, like resolving cable service issues.",
    "situation": "Ashby always doesn't clean the trash after her cooking, which makes the kitchen very dirty. Trying to communicate with Ashby regarding this issue but she just keeps neglecting. ",
    "auto_thought": "Why is she keeping neglecting my needs? I have always been helping her as much as I can!",
    "emotion": [
      "angry, mad, irritated, annoyed"
    ],
    "behavior": "Engages in minor arguments, but finally made compromise to her roommate.",
    "cognitive_distortion": "Should Statements, Personalizing, Overgeneralizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduction and Identify the Situation: We'll start by discussing the ongoing issue with Ashby and how it makes you feel. We'll explore your thoughts around her behavior and your feelings of irritation. 2. Clarify Automatic Thoughts: I will ask you to express your automatic thoughts, particularly focusing on the thought: 'Why is she keeping neglecting my needs?' 3. Explore the Beliefs: We'll delve into the beliefs underlying this thought, including your feelings of unlovability and the belief that your efforts are insufficient. I will encourage you to reflect on why you feel this way and how it relates to your past experiences. 4. Introduce Evidence-Based Questioning: I will guide you through questioning the validity of your thoughts by considering evidence for and against them. For example, we will assess: - 'What evidence do you have that Ashby doesn't appreciate your help?' - 'Have there been moments where she has shown gratitude or acknowledgment?' - 'Is it realistic to expect someone to always meet your needs?' 5. Challenge the Should Statements: We will focus on reframing the 'should' statements in your thoughts. For instance, instead of thinking 'I should always help others,' we can explore the idea of balance and self-care. 6. Develop New Perspectives: Together, we will work on developing more balanced thoughts that reflect a more realistic view of your relationship with Ashby and your own needs. You might begin to think, 'While I enjoy helping others, it’s also okay to express my needs.' 7. Practice and Application: For homework, I will ask you to keep a thought diary where you note down instances when you feel your needs are neglected. Use evidence-based questioning to challenge those thoughts and practice reframing them. This will help you build awareness and gradually shift your perspective in real-life interactions.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I just don't know if I can really talk about my needs right now. It feels like it won't make a difference anyway.",
    "resistance_rationale": "The client's history of feeling overwhelmed with life stresses and her belief that her needs are often neglected suggest a tendency to withdraw during sessions. This withdrawal is mixed with ambivalence about expressing her needs, reflecting her internal conflict and the difficulty she faces in addressing her own emotions while prioritizing others."
  },
  {
    "name": "Fiona",
    "id": "9-3",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "ingratiating"
    ],
    "history": "The patient has a long-standing relationship with a friend named Jersey, who has undergone multiple surgeries due to her disabilities, including a below-the-knee amputation and knee replacement. The patient has been a supportive figure during Jersey's medical procedures and recovery but currently feels overwhelmed with her own life stresses. The patient also experiences conflict with her roommate, Ashby, regarding household issues.",
    "helpless_belief": [],
    "unlovable_belief": [
      "I am undesirable, unwanted.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [
      "I am immoral."
    ],
    "intermediate_belief": "I should always try to help others and prioritize others' needs over myself.",
    "intermediate_belief_depression": "My efforts to help others are not enough, and I cannot manage my own life effectively when my friends are in trouble.",
    "coping_strategies": "The patient copes by trying to provide practical support as much as she can, like cooking meals for friends in need, and by attempting to manage situations, like resolving cable service issues.",
    "situation": "Jersey called and we had a chat. She asked about my recent situations and reasons of absence.",
    "auto_thought": "I was stressed with my own issues and was not able to help her. She must be hurt and disappointed with me.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "guilty"
    ],
    "behavior": "Becomes tense and irritable, shows signs of avoidance, and struggles to sleep.",
    "cognitive_distortion": "Should Statements, Emotional Reasoning, Overgeneralizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning Technique\n1. Introduce the Concept: Begin the session by explaining the concept of Evidence-Based Questioning and how it can help challenge the negative thoughts related to feeling inadequate in supporting Jersey. Emphasize the importance of examining the validity of these thoughts.\n2. Identify Automatic Thoughts: Ask the client to share their automatic thoughts about not being able to help Jersey and the feelings of guilt and disappointment that arise from it. Write these thoughts down for reference.\n3. Gather Evidence: Guide the client to examine the evidence for and against their beliefs. For example, ask questions like: 'What evidence do you have that Jersey feels disappointed in you?' or 'What have you done in the past that demonstrates your support?' Encourage the client to recall specific instances where they have been helpful or supportive.\n4. Challenge the Thoughts: Help the client to see if there are alternative explanations or perspectives. Questions to consider include: 'Could Jersey understand that you are also facing challenges?' or 'Is it realistic to think you can always prioritize others' needs over your own?' \n5. Reassess the Beliefs: After gathering evidence, ask the client how they feel about their initial thoughts. Have them rate the intensity of their feelings of guilt on a scale from 1 to 10 before and after the questioning process to observe any changes.\n6. Reframe the Thoughts: Collaborate with the client to reframe their initial thoughts into more balanced and compassionate statements, such as: 'I have limits and it's okay to prioritize my well-being while still being supportive in ways that I can manage.' \n7. Create an Action Plan: Discuss practical steps the client can take to balance helping Jersey while also addressing their own needs. Encourage them to set boundaries and communicate openly with Jersey about their capacity to help. End the session by establishing a follow-up plan to revisit these thoughts and strategies in future sessions.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I want to be helpful, but I just feel so overwhelmed and don't know how to talk about it.",
    "resistance_rationale": "The client has a pattern of emotional withdrawal when faced with overwhelming feelings of guilt and sadness regarding their own issues and the needs of others. They exhibit signs of tension and irritability, indicating a struggle to engage fully in therapy while feeling burdened by their responsibilities and emotions."
  },
  {
    "name": "Grace",
    "id": "10-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has recently gone through a divorce and is dealing with the associated challenges such as financial struggles, adjusting to single life, and co-parenting. The patient has also experienced a breakdown of several friendships due to the divorce and has a complicated relationship with her parents, which adds to the stress.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am incompetent.",
      "I am helpless.",
      "I am defective."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I must be independent and self-reliant to handle challenges. I must make everything in control. ",
    "intermediate_belief_depression": "There are so many uncertanties in the future. I cannot handle them at all. I cannot stay independent and live on my own. I already lack the ability to stay independent after these many years' marrige. ",
    "coping_strategies": "The patient uses social support by spending time with friends and seeking comfort in those relationships. The patient also attempts strategies like keeping busy and avoidance. ",
    "situation": "Dealing with financial struggles and uncertainty after the divorce.",
    "auto_thought": "I don't know how I'm going to afford everything. I'm at the brink of not being able to pay for things.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Considers giving up her dog to save money, feels overwhelmed by financial paperwork and discussions. Ruminates and worries rather than effective problem solving.",
    "cognitive_distortion": "Catastrophizing, All-or-Nothing Thinking, Helplessness",
    "cbt_technique": "Reality Testing",
    "counseling_plan": "Reality Testing Technique\n1. Introduce Reality Testing: We will begin by discussing your feelings of overwhelming uncertainty and the belief that you cannot handle your financial situation. I will explain the concept of reality testing as a way to challenge these intense fears and explore the actual evidence surrounding your situation.\n2. Identify the Catastrophic Thoughts: Together, we will list your most distressing thoughts related to your financial struggles, such as 'I can't afford everything' and 'I am powerless.' We will clarify what these thoughts imply about your current situation and future.\n3. Gather Evidence: I will guide you to examine the evidence for and against these catastrophic beliefs. We will look at your current financial situation, any resources you may have (like social support), and your past experiences where you successfully managed challenges. Questions to consider will include: 'What have you managed to pay for so far?' and 'How have you coped with difficult situations in the past?'\n4. Challenge the Catastrophic Thinking: After gathering evidence, we will assess the validity of your initial thoughts. I will encourage you to reflect on questions such as: 'Is it true that there are no options available to you?' and 'What would you tell a friend in your situation who feels helpless?'\n5. Create a Balanced Thought: Based on the examination of evidence, we will work on reframing your thoughts. Instead of thinking 'I cannot handle this,' we can rephrase it to something more balanced, such as 'I am facing challenges, but I have handled difficulties before and have support.'\n6. Develop Action Steps: Together, we will create a list of concrete actions you can take to address your financial concerns, such as budgeting or seeking financial advice. This will help you feel more empowered and less overwhelmed.\n7. Homework Assignment: To reinforce this new perspective, I will ask you to keep a thought diary over the next week, noting any instances when you notice yourself slipping back into catastrophic thinking. We will review this in the next session to continue the process of reality testing and reframing.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Pessimistic",
    "resistance_internal_monologue": "I guess I could work on my finances, but honestly, I feel like I’m just going to end up in the same place. Maybe I should just talk about these other things instead.",
    "resistance_rationale": "The client's recent experiences of uncertainty and helplessness after the divorce contribute to a tendency to deflect from addressing pressing issues like financial struggles. Their coping strategies involve avoidance, which aligns with the sidetracking behavior as they might prefer discussing less anxiety-provoking topics."
  },
  {
    "name": "Ian",
    "id": "11-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history of feeling isolated and has been dealing with chronic depression since late adolescence. They have experienced frustration with friends and had a recent breakup that preceded a relapse into a depressive episode. The client has a history of taking SSRI and has recently been adjusting their medication regimen to deal with the relapse, which has been a source of additional stress.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am trapped."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If I can't manage my own feelings or make others understand me, then I'm failing. I should be able to handle my mental health better.",
    "intermediate_belief_depression": "When I'm depressed, nothing I do seems to make a difference. It feels like I'll never get better no matter what medication or strategies I try.",
    "coping_strategies": "Attempts to connect with friends for support, but this sometimes leads to further frustration when the interactions don't go as hoped. ",
    "situation": "Trying to have a supportive conversation with a friend (Jamie) about mental health struggles.",
    "auto_thought": "She doesn't understand me and is treating me like a patient rather than a friend. She doesn't actually like me - she just doesn't want to show that. Nobody likes me.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "disappointed"
    ],
    "behavior": "Ends the conversation prematurely and feels dissatisfied with the interaction. Withdraws from further social interactions.",
    "cognitive_distortion": "Mind Reading, Emotional Reasoning, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept: We will start by discussing your recent conversation with Jamie and your feelings of being misunderstood. I'll explain the concept of Mind Reading and how it can lead to negative assumptions about others' perceptions of you.\n2. Identify Automatic Thoughts: Together, we will explore your automatic thoughts during the conversation, particularly the belief that Jamie doesn't like you or understand you. We'll write these thoughts down to make them tangible.\n3. Challenge the Thoughts: I will guide you through a series of evidence-based questions to challenge these thoughts. For instance, I'll ask:\n   - 'What evidence do you have that Jamie doesn't understand you or like you?'\n   - 'Have there been times when Jamie has shown support or understanding in the past?'\n   - 'Is it possible that your feelings of loneliness are influencing your perception of the situation?'\n4. Evaluate Emotional Reasoning: We'll discuss how your emotions (sadness, disappointment) might be influencing your interpretation of Jamie's actions. I'll help you differentiate between feelings and facts.\n5. Gather Alternative Evidence: We will work together to list any examples of positive interactions you've had with Jamie and other friends. This will help counter the negative narrative you've been experiencing.\n6. Reframe the Thought: Based on the evidence we've gathered, we will create a more balanced thought. For example, you might reframe it to: 'Jamie cares about me, and while she may not always know how to support me, that doesn't mean she doesn't like me.'\n7. Practice Application: I will encourage you to practice this questioning technique in future interactions. Your homework will be to notice when you begin to assume others’ thoughts about you and apply the questions we discussed to challenge those assumptions.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I feel like the therapist doesn’t really get me—she’s treating me like a client instead of a person who’s struggling.",
    "resistance_rationale": "The client has a history of feeling misunderstood and isolated, which contributes to their frustration with therapy. Their automatic thoughts reflect a sense of being treated as a patient rather than an individual, leading to criticism of the therapist's approach as they grapple with feelings of inadequacy and helplessness."
  },
  {
    "name": "Jay",
    "id": "12-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "Jay is a PhD student in a science field. Outside of work, Jay is deeply involved in music, having led a college band and now participates in a jazz group. He was recently offered a leadership position in the jazz group, but he declined because he was worried about not being able to manage the increased responsibility in addition to his mental health struggles and PhD work. The patient is struggling with his scientific work environment, feeling disconnected from his colleagues due to differing values and work habits. There seems to be a past experience of feeling connected and appreciated, which is now missing in his current environment.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "If I am not able to excel in everything I do, then I am failing. I need to be recognized and appreciated by others to feel successful.",
    "intermediate_belief_depression": "When I'm not engaged in music or my work in a meaningful way, or when I'm not recognized for my efforts, I feel useless and like a failure. I believe my contributions are not valuable.",
    "coping_strategies": "Engaging in music and performance. The patient also seems to show avoidance of certain responsibilities and opportunities that may lead to additional stress.",
    "situation": "Being offered a leadership position in jazz group, although he wanted it, but felt unsure about being able to manage the responsibilities on top of everything. He finally turned down the opportunity.",
    "auto_thought": "I just cannot make it. I cannot make any advancement in music. I'm not even brave enough to take the challenge. I am a shameful failure. I would be too stressed and unable to manage.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "disappointed",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Keep ruminating about the event.",
    "cognitive_distortion": "All-or-Nothing Thinking, Overgeneralizing, Should Statements",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "1. Introduce the Concept: We will start by discussing your feelings around the leadership opportunity in the jazz group and the thoughts that led you to decline it. I will explain the concept of Decatastrophizing, emphasizing how it can help challenge the intense fear of failure. 2. Identify Catastrophic Thoughts: I'll ask you to share the specific thoughts you had when considering the leadership role, focusing on statements like 'I cannot make any advancement' and 'I would be too stressed.' 3. Challenge the Thoughts: Together, we will examine these thoughts for evidence. I will guide you to question their validity and consider alternative outcomes. For example, 'What would happen if you took the role and it didn’t go perfectly? Would you really be a failure?' 4. Explore Past Successes: We'll look at past experiences where you faced challenges successfully, helping you to gather evidence that counters the catastrophic thinking. 5. Generate Realistic Outcomes: I will help you brainstorm realistic scenarios about what taking the role could look like, including both positive and manageable negative outcomes. 6. Create a Balanced Thought: Based on this exploration, we will formulate a new, balanced thought, such as 'I have taken on challenges before, and while it may be stressful, I can manage it and still have support.' 7. Practice: As a follow-up exercise, you'll practice reframing any future catastrophic thoughts using the Decatastrophizing technique in daily situations.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ashamed",
    "resistance_internal_monologue": "I feel like I should be able to handle this, but I just can't seem to get it together. Maybe I'm just not cut out for this.",
    "resistance_rationale": "Jay's history of feeling disconnected and his belief that he must excel to be valued contribute to his withdrawal during sessions. His feelings of inadequacy and shame regarding his inability to take on leadership roles reflect a mixed resistance, where he wishes to engage but feels overwhelmed by his perceived failures."
  },
  {
    "name": "Yvette",
    "id": "13-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "ingratiating"
    ],
    "history": "The patient has a significant life event of her aunt passing away without the patient fulfilling her aunt's last request. The patient was also not able to be with her aunt when she passed, which causes her persistent guilt. The patient was very close to her aunt, seeing her as the mother she wished she had, and her death has left a lasting impact. The patient also has a pattern of taking care of others at her own expense, and struggles with recognizing her own needs and allowing herself to experience fun and enjoyment.",
    "helpless_belief": [],
    "unlovable_belief": [],
    "worthless_belief": [
      "I am worthless, waste.",
      "I am immoral.",
      "I am bad - dangerous, toxic, evil."
    ],
    "intermediate_belief": "I am responsible for others and must fulfill others' expectations to validate my purpose in life. If I'm not meeting the needs of others, I'm a worthless person. ",
    "intermediate_belief_depression": "I'm not meeting others' expectations. When I feel overwhelmed by my responsibilities, I'm a bad person and always hurting others like what I did to my aunt. It's shameful to think of prioritizing my own needs over others.",
    "coping_strategies": "The patient uses avoidance in confronting her grief and engages in overcommitment to helping others to compliment her inner grief and distress.",
    "situation": "Thinking about experiences with her aunt and not meeting her aunt's last request.",
    "auto_thought": "I didn't do what she wanted me to do, I failed her, and this can never be made up with. I am a bad person.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "ashamed, embarrassed, humiliated",
      "guilty"
    ],
    "behavior": "Keep ruminating about the past between her and her aunt.",
    "cognitive_distortion": "Should Statements, Emotional Reasoning, Overgeneralizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session: Begin by acknowledging the patient's feelings of guilt and sadness regarding her aunt's passing and unmet expectations. Explain how these feelings may stem from cognitive distortions. 2. Identify Specific Thoughts: Ask the patient to articulate her specific thoughts about failing her aunt and being a bad person. Write these down to visualize the negative beliefs. 3. Challenge the Thoughts: Introduce Evidence-Based Questioning by asking the patient to provide evidence for her beliefs. Questions may include: - 'What evidence do you have that you are a bad person?' - 'Have you ever done anything kind or helpful for others?' - 'What would you say to a friend who feels guilty about not meeting someone's expectations?' 4. Gather Counter-Evidence: Encourage her to think about times she was helpful, supportive, or kind. Write these down to counterbalance her negative thoughts. 5. Reframe the Beliefs: Based on the evidence gathered, help the patient reframe her thoughts. For example, shift the thought from 'I am a bad person' to 'I am a person who made a mistake but also has many positive qualities.' 6. Develop a Self-Compassion Statement: Work with the patient to create a compassionate statement she can remind herself of when she feels guilt or shame. 7. Plan for Future Situations: Discuss how she can apply this technique when similar thoughts arise. Role-play scenarios where she feels overwhelmed or guilty to practice the questioning technique. 8. Homework Assignment: Ask the patient to keep a journal for the week to track any negative thoughts and the evidence she finds against them. This will reinforce her ability to challenge these distortions independently.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I feel like I can't even talk about my aunt without feeling ashamed and guilty. What if I just can't get over this?",
    "resistance_rationale": "The client's significant guilt over her aunt's passing and her tendency to prioritize others' needs indicate a pattern of emotional withdrawal when confronted with her own feelings. This withdrawal aligns with her intermediate resistance level, as it reflects her internal struggle and ambivalence towards addressing her grief and self-care."
  },
  {
    "name": "Linda",
    "id": "14-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded"
    ],
    "history": "The client has had significant life events that have impacted her current state, including losing her retirement funds on some poor financial decisions, which has led to financial concerns and the need to continue working potentially until an old age, find a new job that pays more, and/or find other ways to make money. Additionally, there are underlying tensions and unresolved feelings related to their family, particularly her mother and father, because now she is relying on them more for financial help.",
    "helpless_belief": [
      "I am helpless.",
      "I am incompetent.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I need to rely on family and friends to support my life. I am not able to handle anything out of my expectation by myself. My family and friends are supposed to always support me.",
    "intermediate_belief_depression": "I just cannot support myself. I am a failure and cannot even be independent. My future is hopeless. I cannot be trusted to take care of myself.",
    "coping_strategies": "Questioning the self; becoming easily defensive when feeling challenged or criticised for taking care of self; Show avoidance of making decisions or taking challenges in life, which in fact further increases anxious feelings.",
    "situation": "Talking with parents about future plans and discussing the options of changing jobs.",
    "auto_thought": "I'm not capable of a better job, and I don't want to work that hard. Why won't my family help me more?",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Feel pressured by family, lashing out and shouting at them to be more supportive.",
    "cognitive_distortion": "Catastrophizing, Mind Reading, Should Statements",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduction: We will start by discussing your feelings of pressure during conversations with your parents about future plans and the associated thoughts that arise, particularly focusing on the catastrophic thinking about your job prospects and feelings of helplessness.\n2. Identify Catastrophic Thoughts: I will help you articulate the specific catastrophic thoughts you have, such as believing you are incapable of improving your job situation or that your family should always offer support. We'll explore how these thoughts may be impacting your emotions and behaviors.\n3. Assess the Realism: We will analyze these thoughts together, asking questions like: \"What evidence do you have that supports or contradicts these beliefs?\" and \"What is the worst that could realistically happen if you do not get the support you expect from your family?\" This will help you to see the exaggerated nature of these thoughts.\n4. Explore Alternatives: We will brainstorm alternative scenarios that are less extreme but still plausible. For instance, consider what it would mean if you did not find a better job immediately, or if your family did not provide the support you wish for.\n5. Reality Check: We will work to identify past experiences where outcomes were less severe than anticipated or where you overcame challenges. This will help create a more balanced perspective on your current situation.\n6. Reframe Thoughts: Together, we will create more balanced thoughts to replace the catastrophic ones, such as: \"I am capable of finding a better job, and while it may take time, I can take steps to improve my situation.\" This reframing will aim to reduce feelings of helplessness and increase your self-efficacy.\n7. Practice: As homework, you will identify moments in the coming week when you notice catastrophic thinking. You will practice applying the decatastrophizing technique to these thoughts, using the strategies we discussed to challenge and reframe them.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Interrupting",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Anxious",
    "resistance_internal_monologue": "I just can't keep up with all this talk about my future. Can we please focus on something else?",
    "resistance_rationale": "The client displays anxiety and a tendency to avoid deeper discussions about her future, often interrupting when the topic becomes uncomfortable. This suggests an intermediate level of resistance, where there is a mix of desire to engage and a clear sense of discomfort with specific discussions, particularly those related to her perceived failures and reliance on family."
  },
  {
    "name": "Karen",
    "id": "15-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has a history of feeling underappreciated and unsupported in the workplace. She experiences challenges in her role, faces difficulties in getting her ideas and suggestions accepted, and struggles with coping in an environment that seems to dismiss her expertise and personal needs.",
    "helpless_belief": [
      "I am helpless.",
      "I am incompetent.",
      "I am trapped."
    ],
    "unlovable_belief": [],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "I must be valued and acknowledged from my colleagues to demonstrate my worth, if not, then I'm a worthless person. I must get support from my workplace, otherwise I'm trapped and helpless.",
    "intermediate_belief_depression": "My efforts are futile; my work is never good enough and will be criticized; Nobody acknowledges my value, I'm a worthless person.",
    "coping_strategies": "Avoidance of further commitment and effort towards mentorship goals, procrastination, wish to seek validation or acknowledgment for holding back on extreme action.",
    "situation": "A discussion was happening in the workplace about culture and atmosphere. Karen wanted to join, but her mentor had asked her to meet with a client at the same time, clashing with the discussion.",
    "auto_thought": "It doesn't matter if I go or not anyway because my thoughts aren't even that important.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "disappointed"
    ],
    "behavior": "Obliges with the client meeting, but disengages by going home early and not finishing her work for the day.",
    "cognitive_distortion": "Disqualifying the Positive, Labeling, Catastrophizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Technique: We will begin the session by explaining the concept of Evidence-Based Questioning and how it can help challenge the negative beliefs you have about your worth and contributions at work. \n2. Identify the Negative Thought: We will focus on your automatic thought of 'It doesn't matter if I go or not anyway because my thoughts aren't even that important.' \n3. Gather Evidence: I will guide you to explore evidence that supports and contradicts this thought. Questions may include: 'Have there been times when your contributions were acknowledged? Can you recall moments when your ideas positively impacted a project or team?'\n4. Evaluate the Evidence: We will analyze the evidence together, weighing both supportive and contradictory points to understand the full picture of your contributions and worth. \n5. Challenge the Labels: We will discuss the label of 'worthless' and explore what this label truly means. I will ask you to consider the implications of labeling yourself in this way and how it affects your feelings and behaviors. \n6. Reframe the Thought: Based on the evidence gathered, we will work to create a more balanced and compassionate thought, such as 'My thoughts and contributions do matter, and while not everyone may recognize them, this does not define my worth.' \n7. Plan for Future Situations: We will develop strategies to help you remember your value in future situations, possibly by keeping a list of positive feedback or successful moments to refer back to when self-doubt arises.",
    "resistance_type": "Direct",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I feel like I'm wasting my time here. It seems like you just don't get what I'm going through.",
    "resistance_rationale": "The client's history of feeling underappreciated at work and her belief that her thoughts are not valued suggests a tendency to express frustration towards the therapist when feeling misunderstood. This aligns with her intermediate resistance level, as she shows both motivation to engage in therapy and a clear tendency to criticize when feeling invalidated."
  },
  {
    "name": "Mason",
    "id": "16-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has spent eleven months in Europe working on a project, which included creating a website and conducting interviews. This period appears important to the client and he's eager to show something for his efforts. The client has suffered from procrastination and anxiety in the past. He has managed to build structure into his life by implementing various strategies learned from a course and using reminders.",
    "helpless_belief": [
      "I am incompetent.",
      "I am out of control.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I must always have something to show for my choices, actions and efforts, otherwise I'm a failure. I must always make the right choice. If I make the wrong choice, or stay idle, then I'm failing.",
    "intermediate_belief_depression": "Having options is paralyzing due to the pressure to make the perfect choice. I cannot make the right choice, I'm a failure.",
    "coping_strategies": "The client uses avoidance or procrastination when overwhelmed by decision making.",
    "situation": "Client think about their life choices and direction, dealing with ambiguity and too many options.",
    "auto_thought": "I can't make the wrong decision. I might fail or choose incorrectly, which could have serious implications for my life.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Client becomes paralyzed by options and fears making decisions, may engage in rumination.",
    "cognitive_distortion": "Catastrophizing, Should Statements",
    "cbt_technique": "Decatastropizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept: We will start by discussing your feelings of being overwhelmed by choices and the fear of making wrong decisions. I will explain the concept of catastrophizing—how your thoughts are leading you to imagine the worst possible outcomes. \n2. Identify Specific Catastrophic Thoughts: Together, we will identify specific thoughts related to your fears about decision-making, such as 'If I make the wrong choice, my life will be ruined.' \n3. Challenge the Catastrophic Thoughts: I will guide you through questioning these thoughts by asking: 'What evidence do you have that making a wrong choice will have such severe consequences? Have you ever made a choice that didn’t lead to a disaster?' \n4. Explore Alternative Outcomes: We will brainstorm alternative outcomes for your decisions, including positive or neutral results. This will help illustrate that even the worst-case scenario may not be as catastrophic as it seems. \n5. Assess the Likelihood: I will ask you to consider the actual likelihood of the worst-case scenario happening. We will weigh the probabilities and discuss how often your fears have materialized in the past. \n6. Reframe the Thought: Based on our discussion, we will work together to create a more balanced thought to replace the catastrophic thinking. For example, instead of 'I might fail or choose incorrectly,' we could reframe it to 'I can make informed decisions and learn from any mistakes I make.' \n7. Develop an Action Plan: Finally, we will create a step-by-step action plan for decision-making that includes setting smaller, manageable goals and timelines to reduce the pressure of needing to make 'the perfect choice.' This will help you to take action rather than remain paralyzed by fear.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ambivalent",
    "resistance_internal_monologue": "I know I should make decisions, but maybe I should focus on other things first. What if I just avoided this for now?",
    "resistance_rationale": "The client's history of avoidance and procrastination, along with their current feelings of being overwhelmed by choices, indicate a tendency to sidetrack discussions rather than confront their decision-making fears directly. Their ambivalence suggests they may want to engage but find it difficult to focus on the core issues due to anxiety about making the wrong choice."
  },
  {
    "name": "Sarah",
    "id": "17-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "guarded",
      "ingratiating"
    ],
    "history": "Sarah is in a significant relationship with her partner, Amelia, who has a rigorous schedule due to her clinical-based program, which keeps her busy and away from home for extended hours. Sarah often feels isolated during the week. Even though Sarah is incredibly busy, she feels like she has 'housewife' duties and takes care of all household tasks. Although she resents it, she has not brought it up to her partner. She has a history of attachment issues, starting from her childhood, where separation from her parents caused her distress. These issues have continued into adulthood, where she has struggled with separation anxiety and strong attachments to people in various contexts, such as summer camp, study abroad programs, and volunteer positions.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am needy."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I need to be constantly engaged with people, otherwise I will be abandoned. I need to keep myself valuable to others and support others. I cannot live alone.",
    "intermediate_belief_depression": "People just don't care to stay in touch with me no matter how I try. Nobody loves me. I'm just a weak and needy person that cannot be independent.",
    "coping_strategies": "The client engages in various activities to cope with her feelings of loneliness and anxiety, such as running, cleaning, cooking, and sometimes picking Amelia up to spend more time with her. She experiences temporary relief from anxiety when in contact with Amelia. She keeps trying to stay connected with friends, but if they do not respond to her actively she will be more depressed and anxious.",
    "situation": "Not hearing from her partner Amelia throughout the day.",
    "auto_thought": "Something bad might have happened to her; she doesn't care to stay in touch with me; She doesn't love me.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy",
      "disappointed"
    ],
    "behavior": "Feeling unsettled, not at ease, unable to relax until she hears from Amelia. Texts Amelia, acts needy and clingy.",
    "cognitive_distortion": "Fortune Telling, Mind Reading, Catastrophizing",
    "cbt_technique": "Decatastropizing",
    "counseling_plan": "1. Introduce the Concept and Identify the Target: Begin by discussing the client's feelings of anxiety and fear when not hearing from Amelia. Identify the cognitive distortions present in her thoughts, particularly the tendency to predict negative outcomes and assume what Amelia is thinking. 2. Explore Specific Fears: Ask the client to articulate her specific fears regarding not hearing from Amelia. What does she think has happened? Encourage her to write down these fears to make them concrete. 3. Challenge Catastrophic Thoughts: Guide the client to question the validity of her fears. Ask her: 'What evidence do you have that something bad has happened to Amelia?' and 'Is there a pattern in the past where your fears turned out to be true?' 4. Generate Alternative Outcomes: Encourage the client to think of alternative, more realistic scenarios. What are some neutral or positive explanations for why Amelia hasn't contacted her? 5. Reality Testing: Discuss with the client about times when her fears did not come true. Help her recall instances where she worried excessively but everything turned out fine. 6. Reframe the Thought: Work with the client to create a balanced statement that acknowledges her feelings without jumping to conclusions, such as: 'I feel anxious when I don't hear from Amelia, but it doesn't mean she doesn't care. She might be busy and will reach out when she can.' 7. Develop Coping Strategies: Finally, help the client develop strategies to cope with her anxiety while waiting for communication from Amelia. This could include engaging in activities she enjoys or practicing mindfulness techniques to manage her anxiety.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I feel like you don’t really understand how hard it is to manage all of this by myself.",
    "resistance_rationale": "Sarah's feelings of frustration and her history of attachment issues suggest she may struggle to feel understood and supported in therapy. Her tendency to feel isolated and her belief that others do not care may lead her to criticize the therapist's approach when she feels her needs are not being adequately addressed."
  },
  {
    "name": "Noah",
    "id": "18-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a past of academic challenges and underachievement despite noted intelligence. There was a negative college experience at Grinnell, which the client found to be isolated and disconnected from society, leading to dropping out and bitterness toward education. The client has not completed college, having about two years' worth of credits left. The client has a history of having high expectations set by the mother, and there seems to be a perceived failure to meet these. After some financial troubles, the client felt pressure from the mother to return home, further complicating the dynamic.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "I must meet my parents' expectations, otherwise I'm a failure. I must work hard and stay productive to avoid failure. ",
    "intermediate_belief_depression": "I'm not competent for anything. I keep failing to meet expectations of myself and others. I'm a worthless person.",
    "coping_strategies": "The client attempts to cope with feelings of inadequacy and fear of failure by controlling situations, making plans and being selective of the projects he undertakes. However, if they don't work well it will trigger stronger feeling of failure. There are traces of isolation, like secluding oneself to work, and probably procrastination as coping mechanisms.",
    "situation": "Experienced an unproductive week due to mistakes in planning. Comparing to client's sister's achievements and her ability to plan and organize time.",
    "auto_thought": "I'm a pathetic person. I'm never good at planning or organizing my time. I'm going to fail again, no wonder my parents are disappointed about me.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Acknowledges the week was unproductive, ultimately feeling like a failure.",
    "cognitive_distortion": "Comparing and Despairing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: We will begin by discussing your feelings about the unproductive week and how comparing yourself to your sister has led to feelings of worthlessness. I will introduce the Evidence-Based Questioning technique as a way to challenge these negative comparisons. 2. Identify the Comparison: We will clarify the specific aspects of your sister's achievements that you are comparing to yourself. 3. Gather Evidence: I will ask you to share specific examples of both your successes and your sister's achievements. We will create a list that highlights your strengths and accomplishments. 4. Challenge the Comparison: I will guide you to question the validity of your comparison. I will ask: 'What factors contribute to her success that may not apply to you?' and 'What unique strengths do you possess that she may not?' 5. Reflect on the Evidence: Together, we will review the evidence gathered, emphasizing your achievements and qualities. This will help you see that comparing yourself to others can be misleading and unfair. 6. Reframe Negative Thoughts: We will work together to create a balanced statement that reflects your worth and abilities, such as: 'I have my own unique strengths and accomplishments, and it's okay to have different timelines and paths.' 7. Practice Self-Compassion: I will encourage you to practice self-compassion by acknowledging your feelings without judgment and recognizing that everyone has their own journey. We will explore ways to reinforce this self-compassion in daily life.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ashamed",
    "resistance_internal_monologue": "I want to talk about how I feel, but I just can't seem to find the words. What if I disappoint them again?",
    "resistance_rationale": "The client's history of feeling inadequate and their belief of being a failure contribute to their tendency to withdraw in therapy. Their automatic thoughts and emotions of shame and loneliness indicate a struggle to engage openly, even when they want to, reflecting a mixed resistance where they still express a desire for help but feel stuck."
  },
  {
    "name": "Noah",
    "id": "18-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a past of academic challenges and underachievement despite noted intelligence. There was a negative college experience at Grinnell, which the client found to be isolated and disconnected from society, leading to dropping out and bitterness toward education. The client has not completed college, having about two years' worth of credits left. The client has a history of having high expectations set by the mother, and there seems to be a perceived failure to meet these. After some financial troubles, the client felt pressure from the mother to return home, further complicating the dynamic.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "I must meet my parents' expectations, otherwise I'm a failure. I must meet my academic and career goals and my own expectations to demonstrate my worth.",
    "intermediate_belief_depression": "I'm not competent for anything. I keep failing to meet expectations of myself and others. I'm a worthless person.",
    "coping_strategies": "The client shows avoidance of certain responsibilities or actions that might trigger feelings of failure, such as looking for a job opportunity. There are traces of isolation, like secluding oneself to work, and probably procrastination as coping mechanisms.",
    "situation": "Seeking help from parents due to financial troubles, and mentioned the college dropout experience during the talk.",
    "auto_thought": "I cannot finish college due to my incompetency, and need to rely on parents for a living. I'm so pathetic and a failure. ",
    "emotion": [
      "sad, down, lonely, unhappy",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Keep ruminating about the past and inactive for future plans.",
    "cognitive_distortion": "Should Statements, Overgeneralizing, Labeling",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: We will start by discussing your feelings of inadequacy related to your college experience and current financial situation. I will explain how 'Should Statements' and 'Overgeneralizing' contribute to negative self-perceptions, leading to feelings of worthlessness. 2. Identify Specific Thoughts: Let's examine your automatic thought: 'I cannot finish college due to my incompetency, and need to rely on parents for a living. I'm so pathetic and a failure.' 3. Gather Evidence: I will ask you to reflect on your past successes and capabilities. Questions will include: - 'What evidence contradicts the belief that you are incompetent?' - 'Have there been times in your life where you succeeded despite challenges?' 4. Challenge the Beliefs: We will systematically address the beliefs by asking: - 'What would you say to a friend who expressed these thoughts?' - 'If you were to rate the validity of your belief on a scale of 1 to 10, where would it fall?' 5. Reassess the Automatic Thought: After gathering evidence and challenging it, we will look at your initial thought again. Has your perception changed? How can we modify this thought to be more balanced? 6. Develop a More Balanced Thought: Together, we will create a new statement that reflects a more realistic view of your abilities and situation, such as, 'I have faced challenges in college, but I also have strengths and experiences that prove my capability to succeed.' 7. Homework Assignment: I will encourage you to keep a daily journal where you note instances of 'Should Statements' or negative beliefs and challenge them with evidence. This will help reinforce the new balanced perspective and reduce feelings of worthlessness.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I want to talk about my feelings, but I just feel so disconnected and exhausted right now.",
    "resistance_rationale": "The client exhibits patterns of avoidance and disengagement, particularly in the context of discussing their academic failures and feelings of worthlessness. Their history of isolation and the emotional burden of unmet expectations contribute to their tendency to withdraw in sessions, indicating intermediate resistance as they show some motivation to engage but struggle with feelings of sadness and helplessness."
  },
  {
    "name": "Patrick",
    "id": "20-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has experienced issues with micromanagement at work in both their current and previous job positions. They have a history of feeling blamed and experiencing situations where they have little to no control and being criticized for it, contributing to a sense of helplessness and potentially lowering self-efficacy in their professional life.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am trapped."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I must be acknowledged and treated fairly by colleagues which demonstrate I'm competent for my work, if not, then I'm not competent. I must try every effort to take responsibility for everything, to meet the expectations of my colleagues.",
    "intermediate_belief_depression": "My colleagues just keep criticizing me. Maybe those mistakes are really my responsibility, I'm just not competent for this work. Or they just use me as a scapegoat because I'm weak and powerless and don't know how to fight back. I'm trapped and hopeless.",
    "coping_strategies": "The client points out mistakes in management to alleviate blame, takes initiative to manage a heavy workload effectively, employs self-distraction, and engages in social activities and role plays to cope with stress and the feeling of being overwhelmed. However, the client also tends to work too hard, to overload himself, with the hope of meeting others' expectations, while having a lot of self criticism.",
    "situation": "Being blamed for spreadsheet errors at work that are not the client's fault.",
    "auto_thought": "There is too much pressure on me to fix something I didn't cause. I'm a weak and powerless person and don't know how to deal with scapegoating, so they keep bullying me.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "angry, mad, irritated, annoyed"
    ],
    "behavior": "Trying to explain the situation to their boss, feeling frustrated and discouraged at work.",
    "cognitive_distortion": "Personalizing, Blaming, Catastrophizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session: We will start by discussing the recent incident at work where you felt blamed for errors that were not your responsibility. I will explain how this situation has led to negative thoughts about your competence and self-worth. 2. Identify Automatic Thoughts: I will help you articulate the specific thoughts you have about being weak and powerless in response to the scapegoating. 3. Challenge the Thoughts: Using Evidence-Based Questioning, we will delve into these automatic thoughts by asking questions such as: - What evidence do you have that you are incompetent or weak? - How much of the blame can be realistically assigned to you? - Have there been times when you received positive feedback from your colleagues? 4. Gather Counter-Evidence: Together, we will compile a list of your accomplishments and strengths, as well as instances where you handled similar situations effectively. 5. Reassess the Thoughts: We will evaluate the initial feelings of hopelessness and blame in light of the evidence gathered. I will guide you to reframe your thoughts to focus on your strengths and the external factors contributing to the situation. 6. Create New Beliefs: We will work on developing new, more balanced beliefs about yourself and your work, such as: 'I am capable and have handled challenges before, and this situation does not define my worth.' 7. Practice and Homework: As a way to reinforce this new perspective, I will assign you the task of keeping a journal for the week, noting any instances where you feel blamed or criticized, and applying the questioning technique we practiced to challenge those thoughts. This will help solidify your skills in reframing negative thoughts.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I feel like you don’t understand the pressure I’m under. It’s easy for you to suggest things when you’re not the one being blamed.",
    "resistance_rationale": "The client's history of feeling blamed and powerless contributes to their frustration and criticism of the therapy process. They exhibit mixed resistance, showing both a desire to engage and a tendency to push back against perceived misunderstandings, indicating an intermediate level of resistance."
  },
  {
    "name": "Patrick",
    "id": "20-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has experienced issues with micromanagement at work in both their current and previous job positions. They have a history of feeling blamed and experiencing situations where they have little to no control and being criticized for it, contributing to a sense of helplessness and potentially lowering self-efficacy in their professional life.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am trapped."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I must be acknowledged and treated fairly by colleagues which demonstrate I'm competent for my work, if not, then I'm not competent. I must try every effort to take responsibility for everything, to meet the expectations of my colleagues.",
    "intermediate_belief_depression": "My colleagues just keep criticizing me. Maybe those mistakes are really my responsibility, I'm just not competent for this work. I'm trapped and hopeless.",
    "coping_strategies": "The client points out mistakes in management to alleviate blame, takes initiative to manage a heavy workload effectively, employs self-distraction, and engages in social activities and role plays to cope with stress and the feeling of being overwhelmed. However, the client also tends to work too hard, to overload himself, with the hope of meeting others' expectations, while having a lot of self criticism.",
    "situation": "Encountering micromanagement at work.",
    "auto_thought": "My efforts are never enough. I'm never meeting their expectations. I'm just not competent for this job. ",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Ruminating about past experiences of micromanagement, blaming themself, and considering quitting the job.",
    "cognitive_distortion": "Overgeneralizing, All-or-Nothing Thinking, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session: We will begin by discussing the recent experience of micromanagement at work and how it has led to negative thoughts about your competence. 2. Identify Automatic Thoughts: We'll explore your automatic thought 'My efforts are never enough' and identify how this reflects overgeneralizing and all-or-nothing thinking. 3. Gather Evidence: I will guide you to list evidence supporting and contradicting this thought by asking questions like, 'What specific feedback have you received from your colleagues or supervisors?' and 'Can you recall instances where you met or exceeded expectations?' 4. Challenge Negative Beliefs: We will examine the validity of your beliefs about your competence and explore if you might be exaggerating the negative feedback you perceive. 5. Reframe the Thought: Based on the evidence gathered, we will work together to create a more balanced thought, such as 'I have received constructive criticism, but there are also areas where I perform well.' 6. Practice Cognitive Restructuring: I will encourage you to practice this reframing outside of sessions whenever you notice those negative thoughts arising. 7. Set Goals for the Week: Finally, we will set specific, achievable goals for you to implement at work, such as seeking feedback on your performance and discussing your feelings with a trusted colleague.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Interrupting",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Anxious",
    "resistance_internal_monologue": "I know I need to talk about my feelings at work, but I just can't help bringing up all the mistakes my manager makes, like I’m still trying to defend myself.",
    "resistance_rationale": "The client exhibits a pattern of anxiety and defensiveness related to feelings of incompetence stemming from micromanagement at work. Their tendency to interrupt reflects an attempt to regain control over the conversation, diverting from their feelings of helplessness. This aligns with their intermediate resistance level, as they show both engagement and a clear struggle with expressing their underlying fears."
  },
  {
    "name": "Wendy",
    "id": "22-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has been dealing with complex interpersonal relations, particularly with a significant other named Ivan and his family. A series of betrayals and trust issues have recently emerged from Ivan, and his family seems to avoid taking intervention in these matters. The patient has been actively involved with the family but feels anger and betrayal due to their recent actions and avoidance.",
    "helpless_belief": [
      "I am helpless.",
      "I am a victim.",
      "I am trapped."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "My partner should never betray or deceive me. If it happened, the harm will never be remedied.",
    "intermediate_belief_depression": "Betrayal and deceit will happen at any time, even people who say love me will lie and hurt me eventually. There's no trust left between Ivan and I. There's no solution to everything and I'm helpless and trapped",
    "coping_strategies": "Wendy copes with by being on high alert of any suspicious behaviors or red flags from Ivan; and has resorted to checking his phone and tracking his location. Wendy also goes to therapy and seems willing to engage in change.",
    "situation": "Finding out Ivan booked a trip without telling her, triggering memories of past betrayals.",
    "auto_thought": "He is hiding things again, I cannot trust him, this is just like the past betrayals. This will happen over and over again.",
    "emotion": [
      "angry, mad, irritated, annoyed",
      "disappointed",
      "hurt",
      "suspicious"
    ],
    "behavior": "Confronts Ivan leading to a fight, scrutinizes his explanations, and remains vigilant.",
    "cognitive_distortion": "Fortune Telling, Catastrophizing, Mind Reading",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing\n1. Introduce the Concept and Identify the Target: We'll start by discussing the recent incident with Ivan and how it's triggering feelings of distrust and anger. I'll explain the concept of decatastrophizing and how it can help challenge the extreme predictions about the future and your relationship with Ivan.\n2. Identify Catastrophic Thoughts: Together, we will identify the specific catastrophic thoughts you have about the situation, such as 'He is hiding things again,' and 'This will happen over and over again.' We'll list them out to visualize the negative predictions.\n3. Examine the Evidence: Next, we'll evaluate the evidence for and against these catastrophic thoughts. I will guide you with questions like: 'What makes you think he is hiding something?' and 'What has Ivan said or done that could suggest otherwise?' This will help to ground the discussion in reality.\n4. Challenge the Predictions: I will encourage you to consider alternative outcomes. For example, we can explore: 'What is the best-case scenario?' and 'What would you tell a friend in your situation?' This will help shift focus from fear-based thinking to more balanced perspectives.\n5. Reframe the Thoughts: Based on the evidence and alternative outcomes we've discussed, we will work together to reframe the catastrophic thoughts into more realistic, balanced statements. For instance, transforming 'I cannot trust him' into 'I have reasons to be cautious, but I can communicate and clarify my feelings.'\n6. Develop a Plan for Action: We will create a plan for how you can approach Ivan in a way that fosters trust and open communication rather than confrontation. This may involve expressing your feelings without accusations and asking for transparency in a supportive manner.\n7. Practice and Link to Behavior: Finally, we will discuss strategies to practice this reframing and decatastrophizing in real-life situations, especially when feelings of anger and suspicion arise. You will be encouraged to apply these techniques and share your experiences in our next session.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I don't see how talking about my feelings is going to change what Ivan did. It feels pointless to go over this again.",
    "resistance_rationale": "The client has expressed feelings of anger and betrayal towards Ivan and his family, which may lead to a skepticism about the effectiveness of therapy. They hold beliefs that betrayals are inevitable, and this contributes to their frustration with therapeutic approaches that don't address their deep-seated feelings of helplessness and suspicion."
  },
  {
    "name": "Ashley",
    "id": "23-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has experienced ongoing interactions with her mother that are stressful and controlling, leading to feelings of passivity and helplessness. The reported family dynamic, particularly the communication style and delayed sharing of significant events, adds to this stress. Also, the patient's emotional responses and behavior during her parents' visit suggest a history of such dynamics affecting them over time.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "My feelings and needs are secondary or less valid than others', I must manage situations to avoid conflict or to maintain peace with my parents. It is safer not to express myself and my emotions, otherwise I will be abandoned. I don't have the power and strength to stand up for myself.",
    "intermediate_belief_depression": "My feelings and needs are never seen or supported by my parents. I'm powerless and weak when confronting my parents. it is inevitable that interacting with my family will leave me feeling miserable and invalidated. But if I just keep detached and numb, my emotions will be too overwhelming once they burst out. I'm gradually losing control of myself and can't control my emotions. I don't know what to do and trapped.",
    "coping_strategies": "The patient uses avoidance (declining invitations from friends, not wanting to talk to parents about their actual feelings) and emotional numbing (feeling 'out of it' and 'zoning out') as ways to cope with the stress and unhappiness related to family interactions. They also seem to employ distraction and passive acceptance of the situation.",
    "situation": "Having a conflicting discussion with mother over weekend plans and financial assistance.",
    "auto_thought": "My mother will always control the situation, I can't assert myself without risking conflict. I cannot win the conflict.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "angry, mad, irritated, annoyed",
      "hurt"
    ],
    "behavior": "Accepts mother's decisions, begrudgingly allows her to pay for purchases and feels conflicted about it. Suppress emotions and numb herself.",
    "cognitive_distortion": "Mind Reading, Catastrophizing, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: We will start by discussing your recent conflict with your mother regarding weekend plans and financial assistance, focusing on the negative thoughts you have about your ability to assert yourself. 2. Identify Negative Thoughts: We will identify specific automatic thoughts such as 'My mother will always control the situation' and 'I cannot win the conflict.' 3. Challenge the Thoughts: Using Evidence-Based Questioning, I will ask you to provide evidence for and against these thoughts, such as 'What proof do you have that your mother will always control the situation?' and 'Have there been times when you successfully asserted yourself?' 4. Explore Alternatives: We will discuss alternative perspectives and potential outcomes that do not involve conflict or loss of control. 5. Reframe Thoughts: Based on the evidence gathered, we will work together to create more balanced and realistic statements, such as 'I can express my feelings without losing control' or 'There are ways to navigate this situation that do not involve conflict.' 6. Practice Assertiveness: We will role-play scenarios to practice assertiveness in communicating your needs and feelings to your mother. 7. Reflect and Link to Behavior: At the end of the session, we will reflect on how these new perspectives can empower you to engage more positively with your family and reduce the feelings of helplessness.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ambivalent",
    "resistance_internal_monologue": "I guess I could talk about my feelings, but honestly, I just want to avoid the whole conflict with my mom. Maybe we could just discuss something else instead?",
    "resistance_rationale": "The client exhibits ambivalence towards discussing her feelings and needs due to a history of feeling invalidated by her parents. This leads to avoidance in therapy, as she may sidetrack conversations to steer clear of uncomfortable topics. Her coping strategies, such as emotional numbing and distraction, support this resistance pattern."
  },
  {
    "name": "Ashley",
    "id": "23-3",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has experienced ongoing interactions with her mother that are stressful and controlling, leading to feelings of passivity and helplessness. The reported family dynamic, particularly the communication style and delayed sharing of significant events, adds to this stress. Also, the patient's emotional responses and behavior during her parents' visit suggest a history of such dynamics affecting them over time.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "My feelings and needs are secondary or less valid than others', I must manage situations to avoid conflict or to maintain peace with my parents. It is safer not to express myself and my emotions, otherwise I will be abandoned. I don't have the power and strength to stand up for myself.",
    "intermediate_belief_depression": "My feelings and needs are never seen or supported by my parents. I'm powerless and weak when confronting my parents. it is inevitable that interacting with my family will leave me feeling miserable and invalidated. But if I just keep detached and numb, my emotions will be too overwhelming once they burst out. I'm gradually losing control of myself and can't control my emotions. I don't know what to do and trapped.",
    "coping_strategies": "The patient uses avoidance (declining invitations from friends, not wanting to talk to parents about their actual feelings) and emotional numbing (feeling 'out of it' and 'zoning out') as ways to cope with the stress and unhappiness related to family interactions. They also seem to employ distraction and passive acceptance of the situation.",
    "situation": "Encountering disagreements with parents at dinner and getting suppressed by mother again.",
    "auto_thought": "I'm the only one reacting emotionally; my emotions are not valid here. I'm losing control of myself and everything will be over!",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Tries to suppress emotional reactions and feels detached, cries alone later instead of discussing feelings with parents.",
    "cognitive_distortion": "Emotional Reasoning, Catastrophizing, Should Statements",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "1. Introduce the Concept and Identify the Target: We will begin by exploring the recent disagreement with your parents and your intense emotional reactions. I will help you identify how you're interpreting these feelings as evidence of losing control and being invalidated. We'll introduce Decatastrophizing to challenge the belief that your emotions are overwhelming and catastrophic.\n2. Clarify the Catastrophic Thought: I will ask you to articulate the worst-case scenario you fear from expressing your emotions to your parents. This helps us pinpoint the underlying catastrophic beliefs.\n3. Examine the Evidence: Next, we will evaluate the evidence for and against this catastrophic thought. I will prompt you with questions like: \"What has happened in the past when you expressed your emotions? How have your parents reacted?\" This will help identify patterns and possible outcomes that may not be as dire as you believe.\n4. Generate Alternative Outcomes: We will brainstorm alternative, more balanced outcomes that could arise from expressing your feelings. This may include scenarios where your feelings are acknowledged or respected.\n5. Reassess the Emotional Reaction: After discussing alternative outcomes, we will revisit your emotional response to the original situation. I will guide you to reassess your feelings in light of the new perspective we’ve developed. \n6. Develop Coping Strategies: We will work on practical coping strategies for when you feel overwhelmed. This may include grounding techniques or pre-prepared phrases to express your feelings to your parents in a calm manner.\n7. Practice Reframing: I will encourage you to practice reframing your thoughts in everyday situations. For instance, rather than thinking \"I will lose control if I express my feelings,\" we can shift to \"I can express my feelings in a way that is safe and manageable.\" This skill will help you feel more empowered in future interactions.\n8. Link to Behavior: Finally, we will establish a plan for how to approach future family interactions, including setting boundaries and expressing your feelings, to reinforce the skills learned during our session.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I don’t even know why I keep coming here. Talking about my feelings just makes me feel more lost and confused.",
    "resistance_rationale": "The client's history of feeling powerless and detached in family interactions, combined with her coping strategies of avoidance and emotional numbing, suggests a tendency to withdraw during therapy. This reflects ambivalence toward engaging with her emotions and the therapy process, resulting in intermediate resistance as she grapples with her feelings of being trapped and overwhelmed."
  },
  {
    "name": "Evan",
    "id": "24-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded"
    ],
    "history": "The patient has a history of experiencing feelings of inadequacy, performance pressure, and social disappointment. He recalls past instances where he tried to put on a performance to meet others' expectations and hide his vulnerability. He recently encountered an incident that caused one of his businesses to fail, which resulted in financial difficulty.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [
      "I am undesirable, unwanted.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I must meet others' expectations. Expressing weaknesses or asking for help is frowned upon and not beneficial. I need to have a facade of control or a performance to be accepted or to interact socially. Discussing problems is pointless and signs of weakness must be hidden, otherwise nobody likes me and I will be abandoned.",
    "intermediate_belief_depression": "If I'm failing to meet expectations, or showing my vulnerability and weakeness, people will know I'm just a weak person and a failure. I will eventually be unwanted and abandoned.",
    "coping_strategies": "The patient uses avoidance (e.g., not attending gatherings), suppression of emotions, and intellectualization as coping methods. He also engages in counterproductive self-talk, pseudo-performances in social interactions, and rationalization to avoid showing vulnerability. He also uses grandiosity and masculinity to cover up his insecurities.",
    "situation": "Being invited to visit his sister but currently being financially unstable.",
    "auto_thought": "I can't afford it, and it would be admitting weakness to tell the truth. Going would show support but it's just too stressful for me. I can't let them know I don't have enough money.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Declines sister's invitation and lies to her about the reason, ruminates on financial instability. Lies about purchasing a designer watch to family, to cover up his financial issues.",
    "cognitive_distortion": "Should Statements, Emotional Reasoning, All-or-Nothing Thinking",
    "cbt_technique": "Decatastropizing",
    "counseling_plan": "1. Introduce the Concept: Begin by discussing the recent situation involving the invitation from his sister and the feelings of financial instability. Explain the concept of Decatastrophizing and how it can help him evaluate the worst-case scenario he envisions. 2. Identify the Catastrophic Thought: Ask him to articulate the worst possible outcome of attending his sister's invitation and what it means for his financial situation and self-worth. 3. Reality Check: Discuss the likelihood of that worst-case scenario actually occurring. What evidence supports or contradicts this fear? 4. Prepare for the Worst: Help him create a plan for how he would cope if that worst-case scenario did happen. What resources or support could he utilize? 5. Reframe the Situation: Encourage him to consider more balanced thoughts about attending the gathering and the potential positives of connecting with family, regardless of his financial situation. 6. Practice Self-Compassion: Facilitate a discussion on self-compassion and how being honest about his financial struggles does not define his worth or value to his family. 7. Action Plan: Conclude by discussing practical steps he can take, such as communicating honestly with his sister about his situation, that align with the more balanced perspective developed during the session.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I want to talk about my feelings, but what if they just see me as weak? It feels pointless.",
    "resistance_rationale": "The client has a history of social disappointment and feelings of inadequacy, leading to avoidance of expressing vulnerability. His automatic thoughts suggest a fear of being perceived as weak, which contributes to emotional withdrawal during therapy sessions. This pattern aligns with the intermediate level of resistance, where he is ambivalent about engaging but still shows some willingness to participate."
  },
  {
    "name": "Evan",
    "id": "24-3",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded"
    ],
    "history": "The patient has a history of experiencing feelings of inadequacy, performance pressure, and social disappointment. He recalls past instances where he tried to put on a performance to meet others' expectations and hide his vulnerability. He recently encountered an incident that caused one of his businesses to fail, which resulted in financial difficulty.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [
      "I am undesirable, unwanted.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I must meet others' expectations. Expressing weaknesses or asking for help is frowned upon and not beneficial. I need to have a facade of control or a performance to be accepted or to interact socially. Discussing problems is pointless and signs of weakness must be hidden, otherwise nobody likes me and I will be abandoned.",
    "intermediate_belief_depression": "If I'm failing to meet expectations, or showing my vulnerability and weakeness, people will know I'm just a weak person and a failure. I will eventually be unwanted and abandoned.",
    "coping_strategies": "The patient uses avoidance (e.g., not attending gatherings), suppression of emotions, and intellectualization as coping methods. He also engages in counterproductive self-talk, pseudo-performances in social interactions, and rationalization to avoid showing vulnerability. He also uses grandiosity and masculinity to cover up his insecurities.",
    "situation": "Cried about the recent failure of a business and the financial difficulty resulted, considering talking to family members for support.",
    "auto_thought": "I just failed the expectations of everybody. I shouldn't show vulnerability to anyone.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Crying and keep ruminating. Avoid calls or interactions from family members.",
    "cognitive_distortion": "All-or-Nothing Thinking, Overgeneralizing, Should Statements",
    "cbt_technique": "Continuum Technique",
    "counseling_plan": "Continuum Technique\n1. Introduce the Concept and Identify the Target: Discuss the recent business failure and the strong negative conclusions drawn about self, identifying the All-or-Nothing thinking.\n2. Establish the Continuum: Draw a horizontal line labeled 0% (not a failure) to 100% (total failure).\n3. Define the Extreme Anchors: Describe what 100% total failure and 0% perfection would look like.\n4. Conduct the Initial Rating: Place an initial rating on the continuum based on emotional state.\n5. Examine the Evidence and Re-Rate: List contradicting evidence and re-evaluate the rating.\n6. Reframe the Thought: Create a new, compassionate summary statement based on the new rating.\n7. Practice and Link to Behavior: Encourage using the 0-100 scale in future situations to challenge extreme thoughts.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ambivalent",
    "resistance_internal_monologue": "I know I should be talking about my feelings, but honestly, I just feel like discussing my business failure is pointless because it won't change anything.",
    "resistance_rationale": "The client's history of avoiding vulnerability and expressing emotions, combined with their belief that discussing problems is futile, suggests a tendency to sidetrack away from core issues. Their ambivalence indicates a mix of motivation to engage, but also a desire to avoid painful topics, leading to a sidetracking resistance pattern."
  },
  {
    "name": "Olivia",
    "id": "26-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history of uncertainty and anxiety about her work, a recent marriage filled with complexities and abuse - her husband Ivan had physically assaulted her and they are now separated. However, she is open to working on the relationship and is currently in couple's therapy with Ivan, who is also keen to change.",
    "helpless_belief": [
      "I am helpless.",
      "I am out of control.",
      "I am powerless, weak, vulnerable.",
      "I am trapped."
    ],
    "unlovable_belief": [
      "I am unlovable."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I need to wait for an explanation to feel closure. I need to fully understand others' behaviors to get things in control. I need a lot of patience to cope with the responsibilities and situations I am facing. \n[during depression]\n My partner's behaviors are confusing, and it's difficult to reconcile his actions with how I want to perceive him. My loyalty and commitment are making it difficult to act in my own best interest.",
    "intermediate_belief_depression": "",
    "coping_strategies": "Using work as a means of distraction from anxiety and personal issues. Suppressing her emotions and not dwelling on feelings. Engaging in couple's therapy and individual therapy for support.",
    "situation": "Hearing clinical terms (delusional, pseudo-psychotic) about Ivan's behavior.",
    "auto_thought": "These clinical descriptions are very serious and scary. Am I unsafe? Can Ivan control his behavior?",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Feels unsettled, seeks reassurance and clarity in therapy. Distances herself from friends and family who tell her she should leave Ivan.",
    "cognitive_distortion": "Catastrophizing, Mind Reading, Emotional Reasoning",
    "cbt_technique": "Decatastropizing",
    "counseling_plan": "1. Introduce the Concept: We will begin by discussing the recent experience of hearing clinical terms about Ivan's behavior and the intense emotions this has triggered. I'll explain the concept of catastrophizing and how it relates to your fears about safety and control. 2. Identify Catastrophic Thoughts: Together, we will identify the specific thoughts you have regarding Ivan's behavior that lead to feelings of anxiety and fear, such as 'These descriptions mean I am unsafe.' 3. Challenge the Catastrophic Thoughts: We'll work on questioning the validity of these thoughts by discussing evidence for and against them. For example, we can explore what specific behaviors or patterns demonstrate Ivan's control or lack thereof. 4. Explore Alternatives: I will guide you in generating alternative, more balanced thoughts about the situation. This might include recognizing that while Ivan's behavior is concerning, it does not automatically mean you are in immediate danger. 5. Create a Safety Plan: To help alleviate your fears, we will develop a safety plan outlining steps you can take if you ever feel unsafe or need support, which can empower you and reduce feelings of helplessness. 6. Practice Mindfulness: We will incorporate mindfulness techniques to help you stay grounded and reduce anxiety when faced with overwhelming thoughts. This can involve breathing exercises or grounding techniques that help you focus on the present moment rather than future uncertainties. 7. Reinforcement: We will conclude by discussing how you can apply this decatastrophizing technique in future situations where you feel overwhelmed. The goal is to help you recognize when you are catastrophizing and to practice reframing those thoughts into more balanced perspectives.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Anxious",
    "resistance_internal_monologue": "I feel overwhelmed and just want to understand everything better before we dive deeper into this.",
    "resistance_rationale": "The client's history of anxiety and uncertainty, particularly regarding her relationship and the distressing terminology used, suggests a tendency to withdraw when faced with difficult emotions. Her coping strategies indicate a preference for distraction and reassurance, reflecting a mixed motivation to engage while simultaneously feeling overwhelmed."
  },
  {
    "name": "Mia",
    "id": "27-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client is undergoing a divorce and experiencing financial difficulties. She used to be with her ex-partner since the age of 19 and has never felt lonely until now because she had always been with someone. The couple has a young son, Brady, for whom they are still settling child support issues. The client has faced recent changes, such as solo travelling with her son for the first time and visiting her family without her partner. She also feels a sense of shame or guilt related to her friends disconnecting from her after the separation.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am powerless, weak, vulnerable."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I should be able to provide for myself and my son without needing help. But in fact I need to rely on others to support myself and my kid. People are supposed to help me. \n[during depression]\n I cannot support myself by my own. I'm not independent. Nobody would help me.",
    "intermediate_belief_depression": "",
    "coping_strategies": "Communicating and seeking support with family and friends; seeking legal advice to resolve financial disputes with her ex-partner; The client sometimes engages in avoidance of negative feelings by distracting herself with routine or scheduled activities.",
    "situation": "Receiving an email from ex-partner refusing to agree on child support and other financial assistance.",
    "auto_thought": "He is unwilling to help me financially; I'm going to run out of money; My life will be over.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy",
      "disappointed"
    ],
    "behavior": "Expressing frustration, feeling overwhelmed, seeking support from family members. Pushes herself to try harder to be independent.",
    "cognitive_distortion": "Should Statements, Catastrophizing, Fortune Telling",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "1. Introduce the Decatastrophizing Technique: Begin the session by discussing the recent email from her ex-partner and the intense feelings it has triggered. Explain the concept of decatastrophizing and how it can help her challenge catastrophic thoughts and fears. 2. Identify Catastrophic Thoughts: Ask her to articulate the worst-case scenario she envisions (e.g., running out of money, life being over). Write these thoughts down. 3. Reality Check: For each catastrophic thought, guide her in evaluating the likelihood of these scenarios actually happening. Use questions like: 'What evidence do you have that supports this thought?', 'What evidence do you have that contradicts it?' 4. Explore Alternatives: Encourage her to consider more balanced outcomes. What are some realistic possibilities if things do not go as poorly as she fears? 5. Develop a Coping Plan: Work together to create a step-by-step plan of action for addressing her financial concerns and the child support issue. This can include seeking legal assistance, budgeting, or reaching out for community resources. 6. Practice Reframing: Help her reframe her initial catastrophic thoughts into more realistic and manageable statements. For example, instead of 'I'm going to run out of money; my life will be over,' she could say, 'I'm facing a challenge, but I have support and options to address this situation.' 7. Homework Assignment: Encourage her to practice identifying and reframing any catastrophic thoughts that arise over the week and to track her emotions and responses to these thoughts in a journal.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I know I should be trying to be more independent, but I just feel so lost and overwhelmed right now.",
    "resistance_rationale": "The client is experiencing significant emotional turmoil related to her divorce and financial struggles, leading her to withdraw and disengage during sessions. Despite wanting to engage in therapy, her feelings of sadness and helplessness about her situation create ambivalence and resistance to fully participating in the therapeutic process."
  },
  {
    "name": "Mia",
    "id": "27-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client is undergoing a divorce and experiencing financial difficulties. She used to be with her ex-partner since the age of 19 and has never felt lonely until now because she had always been with someone. The couple has a young son, Brady, for whom they are still settling child support issues. The client has faced recent changes, such as solo travelling with her son for the first time and visiting her family without her partner. She also feels a sense of shame or guilt related to her friends disconnecting from her after the separation.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I need constant stimulation from others to feel okay. It's important to show others that I am doing well despite the situation, otherwise I will be abandoned. \n[during depression]\n When I don't have social interactions, it leads to a feeling of loneliness and sadness. I can't handle being alone. People know my issues and they will abandon me.",
    "intermediate_belief_depression": "",
    "coping_strategies": "The client demonstrates several coping strategies, such as avoiding thinking of the divorce and use distractions; seeking social interactions to mitigate feelings of loneliness and sadness; mantaining a good image in front of friends; visiting her home town for a change of environment and support; She also plans to engage in hobbies, such as dance classes to fill her time and make new friends. ",
    "situation": "Being at a birthday party where some guests mentioned her divorce while chatting.",
    "auto_thought": "Everyone is judging me; I am exposed; they know I've been experiencing a hard time.",
    "emotion": [
      "ashamed, embarrassed, humiliated",
      "hurt"
    ],
    "behavior": "Feeling uncomfortable, trying to engage positively with others, maintaining appearances. Ruminates on it after the event. Pushes herself harder to maintain an image of competence and independence.",
    "cognitive_distortion": "Mind Reading, Catastrophizing, Labeling",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin the session by discussing the recent birthday party situation and the feelings of being judged that arose from it. Explain how mind reading and catastrophizing can distort perception and amplify feelings of shame and embarrassment.\n2. Identify Automatic Thoughts: Ask the client to articulate the specific thoughts that emerged during the event, particularly focusing on the thought 'Everyone is judging me; I am exposed.'\n3. Challenge the Thought: Use evidence-based questioning to explore the validity of these thoughts. Ask questions like: 'What evidence do you have that everyone was judging you?', 'Have you ever judged someone for their personal struggles?', and 'Can you think of a time when you felt judged but later realized it wasn’t true?'\n4. Explore Alternative Explanations: Encourage the client to consider alternative perspectives. Prompt with questions such as: 'What if others were not thinking about you at all? What would that mean for how you feel about the situation?'\n5. Gather Evidence: Create a list of evidence against the automatic thoughts. This may include positive feedback received from friends, supportive interactions, or any moments of connection experienced during the party.\n6. Reframe the Thought: Work with the client to develop a new, balanced thought that reflects a more realistic view of the situation. For example, 'I am navigating a difficult time, but that doesn’t define how others feel about me.'\n7. Link to Behavior: Discuss how this reframing can help reduce the urge to maintain a façade of competence. Encourage the client to practice this reframing technique in future social situations and reflect on the outcomes. Set a goal to engage more authentically, allowing for vulnerability in conversations with trusted friends.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I feel so overwhelmed by everything. Maybe I should just keep quiet; it’s easier than trying to explain how I really feel.",
    "resistance_rationale": "The client's history of feeling helpless and her strong beliefs about needing constant stimulation indicate a tendency to withdraw emotionally when faced with discomfort. Her coping strategies suggest an avoidance of deeper feelings, making in-session withdrawal the most fitting resistance subtype. The intermediate level reflects her ambivalence towards engaging fully in therapy despite feeling overwhelmed."
  },
  {
    "name": "Wyatt",
    "id": "29-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has had a profound relationship with their workplace, a research lab, where they've developed a sense of identity and belonging through their interactions and achievements. They mentioned a significant event with emotional heft regarding the departure of a close colleague, affecting their sense of stability. The lab serves as a counterpoint to their home life, where they've not felt the same level of comfort or predictability.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am out of control."
    ],
    "unlovable_belief": [],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "The client believes that they must constantly be productive and engaged to feel valued. They view the workplace as a setting where they can exert some measure of control and maintain emotional stability, unlike at home where they experience anxiety and uncertainty. \n[during depression]\n During moments of feeling overwhelmed and potentially depressed, the client holds an intermediate belief that they have lost control and that swift action is necessary to regain composure and avoid failure.",
    "intermediate_belief_depression": "",
    "coping_strategies": "The client attempts to cope through maintaining a busy schedule. They also have an inclination towards social interaction and structure, such as attending a holiday party and the lab, which serve as places of comfort and familiarity.",
    "situation": "Anticipating a big talk in January and is preparing for a lab meeting which involves several challenging tasks including troubleshooting equipment and learning programming.",
    "auto_thought": "I must be fully prepared and control the preparation process; if things do not go perfectly, it would reflect poorly on me and my abilities.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Takes on more tasks at work and schedules a lab meeting to expedite preparation and receive feedback. Stay at the lab at night and not go home.",
    "cognitive_distortion": "Should Statements, Catastrophizing, Emotional Reasoning",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept: We'll start by discussing your feelings of anxiety and pressure regarding the upcoming lab meeting and the belief that you must be fully prepared. I will introduce the Decatastrophizing technique to help you address the intense fears of failure that may not be grounded in reality.\n2. Identify Catastrophic Thoughts: Together, we'll identify the specific catastrophic thoughts you have about the meeting (e.g., 'If things don't go perfectly, it reflects poorly on me.').\n3. Challenge the Catastrophic Thoughts: We'll examine the evidence for and against these thoughts, asking questions like: 'What evidence do you have that one imperfect moment would define your abilities?' and 'Have you experienced challenges before, and how did they affect your overall competence?'\n4. Explore Realistic Outcomes: I will encourage you to think about alternative outcomes that are less extreme than the worst-case scenario. We'll discuss what it would mean if things did not go perfectly and how that would impact your overall worth or capabilities.\n5. Develop a Balanced Perspective: We will work together to shift from a catastrophic view to a more balanced one, creating a new thought statement that acknowledges the possibility of imperfection without equating it to failure. For example, 'I can prepare as best as I can, and even if things don’t go perfectly, it doesn’t define my worth or abilities.'\n6. Practice and Implementation: To help solidify this new perspective, I will assign you practice tasks where you consciously challenge any catastrophic thoughts that arise in daily life leading up to the meeting, using the questions and thought reframing techniques we've discussed. This will reinforce your ability to manage anxiety and maintain a realistic outlook.\n7. Reflection: At the end of the session, we will reflect on what you’ve learned through this process and how it can help you approach the lab meeting with more confidence and less fear of failure.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Interrupting",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Anxious",
    "resistance_internal_monologue": "I keep trying to express my concerns, but it feels like I'm not being heard. I just want to make sure I’m ready for everything.",
    "resistance_rationale": "The client exhibits anxiety and a strong need for control, which may lead to interrupting the flow of therapy as they attempt to ensure their concerns are addressed. Their history of feeling overwhelmed and the pressure to be productive contribute to this behavior, as they might feel they have to assert their needs immediately to regain a sense of stability."
  },
  {
    "name": "Wyatt",
    "id": "29-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has had a profound relationship with their workplace, a research lab, where they've developed a sense of identity and belonging through their interactions and achievements. They mentioned a significant event with emotional heft regarding the departure of a close colleague, affecting their sense of stability. The lab serves as a counterpoint to their home life, where they've not felt the same level of comfort or predictability.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am undesirable, unwanted.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "They view the workplace as a setting where they can exert some measure of control and maintain emotional stability, unlike at home where they experience anxiety and uncertainty. \n[during depression]\n The workplace is not stable and falling apart. There will be nowhere to keep myself valuable and belonged.",
    "intermediate_belief_depression": "",
    "coping_strategies": "The client attempts to cope through maintaining a busy schedule. They also have an inclination towards social interaction and structure, such as attending a holiday party and the lab, which serve as places of comfort and familiarity.",
    "situation": "Faced with the departure of a close colleague and feeling the emotional impact of this change.",
    "auto_thought": "The departure of my colleague will leave a void in my work life. Things will eventually fall apart. There's no place in the world that can hold me forever.",
    "emotion": [
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Experiences sadness and trepidation about the upcoming departure, try various ways to connect with the colleague's work.",
    "cognitive_distortion": "Catastrophizing, Fortune Telling, Mind Reading",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept and Identify the Target: We will start by discussing your feelings regarding the departure of your colleague and the thoughts you have about the impact on your work life. We'll focus on the catastrophic thinking pattern that suggests everything will fall apart and that you will be left alone.\n2. Identify the Catastrophic Thoughts: I will ask you to articulate specific thoughts that reflect your concern about the situation, such as 'Things will eventually fall apart' and 'There's no place in the world that can hold me forever.'\n3. Explore the Evidence: Together, we will evaluate the evidence for and against these catastrophic thoughts. I will prompt you with questions like: 'What evidence do you have that things will fall apart?' and 'Have there been instances in the past where changes led to positive outcomes?' \n4. Reality Check: We will discuss the likelihood of the worst-case scenario occurring. I will guide you to consider alternative outcomes and the actual possibility of coping with the changes. We will also explore your strengths and resources that can help you manage this transition.\n5. Reframe the Catastrophic Thoughts: Based on the evidence and discussions, we will work on reframing your thoughts. For example, instead of thinking 'Things will fall apart,' you might rephrase it to 'This change is difficult, but I have the skills and support to adapt and maintain my work life.'\n6. Develop an Action Plan: I will help you create a plan for how to stay connected with your work and colleagues, including reaching out for support and finding ways to maintain your sense of belonging.\n7. Practice Decatastrophizing: Your task will be to identify any moments of catastrophic thinking in your daily life and apply the decatastrophizing technique to challenge those thoughts. This practice will help reduce anxiety and enhance your ability to cope with changes more effectively.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I want to talk about how I'm feeling, but I keep getting distracted by other things that seem less important.",
    "resistance_rationale": "The client is experiencing significant emotional upheaval due to the departure of a close colleague, leading them to sidetrack discussions about their feelings. Their coping strategies include busying themselves and engaging in social interactions, which may contribute to their tendency to avoid deep emotional discussions in therapy. This pattern indicates a mix of genuine motivation to engage while also expressing resistance, fitting the Intermediate level."
  },
  {
    "name": "Issac",
    "id": "31-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has experienced the recent deaths of two family members -- an uncle, Jim, and a cousin, Sam -- which have had a significant impact on their family and wider network. They express concerns about their parents' health - their father has uncontrolled diabetes, high blood pressure, kidney problems, and cholesterol issues. The client is also resentful about their father's emotional distance, lack of transparency around health issues, and reluctance to share details about his own life or the family's history.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "My loved ones will withhold important information from me; I can't rely on others to be open and share my feelings; I'm responsible for maintaining harmony in family relationships; \n[during depression]\n I'm alone in handling my emotions; I won't be able to cope if my father's health worsens.",
    "intermediate_belief_depression": "",
    "coping_strategies": "Engaging in distractions such as watching TV and pacing around the house; using food delivery services instead of cooking to manage a loss of appetite; struggling to initiate conversations about difficult topics; standing passively after conversations feeling numb and unsure.",
    "situation": "Receiving a phone call from mother complaining about father's health issues.",
    "auto_thought": "My mom only calls me with bad news; my father conceals his issues from me; I'm too scared to talk to my parents about serious matters.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Disengages from the conversation with his mom and watches TV on the side; feeling numb and disconnected after the call.",
    "cognitive_distortion": "Mind Reading, Catastrophizing, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin the session by discussing the recent phone call with your mother and the feelings of fear and disconnection that arose. We'll identify the cognitive distortions at play, particularly Mind Reading (assuming your mother only calls with bad news) and Catastrophizing (believing you can't handle serious discussions about your father's health). 2. Identify Automatic Thoughts: Together, we will pinpoint your automatic thoughts during the call, such as 'My mom only calls me with bad news' and 'I'm too scared to talk to my parents about serious matters.' 3. Challenge Assumptions: Using Evidence-Based Questioning, we will challenge these thoughts by asking: - 'What evidence do you have that your mother only calls with bad news?' - 'Have there been times when she called to share positive news?' - 'What would happen if you initiated a serious conversation with your parents?' 4. Gather Evidence: We will create a list of evidence that contradicts your current beliefs. For instance, exploring past interactions with your parents that were supportive or positive. 5. Re-assess Feelings: After gathering evidence, we will re-assess how you feel about the possibility of discussing your father's health. Does the evidence change your perception of your ability to handle these conversations? 6. Reframe the Thoughts: Work together to reframe the automatic thoughts based on the new evidence. Instead of thinking 'I'm too scared to talk to my parents,' we might change it to 'It’s understandable to feel scared, but I can reach out and discuss important issues.' 7. Practice New Skills: As an exercise, set a small goal to initiate a light conversation with your parents about everyday topics, gradually moving towards more serious discussions. We will discuss how to prepare for these conversations and reinforce the idea that open communication can strengthen your family relationships.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I just don't feel like I can talk about this right now; it all feels too heavy and overwhelming.",
    "resistance_rationale": "The client has experienced significant loss and emotional distress, which leads to feelings of sadness and withdrawal during discussions about family health issues. Their coping strategies include disengagement and distraction, indicating a pattern of in-session withdrawal when confronted with emotionally charged topics."
  },
  {
    "name": "Issac",
    "id": "31-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has experienced the recent deaths of two family members -- an uncle, Jim, and a cousin, Sam -- which have had a significant impact on their family and wider network. They express concerns about their parents' health - their father has uncontrolled diabetes, high blood pressure, kidney problems, and cholesterol issues. The client is also resentful about their father's emotional distance, lack of transparency around health issues, and reluctance to share details about his own life or the family's history.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable."
    ],
    "unlovable_belief": [
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "My loved ones will withhold important information from me; They have serious health issues that I don't know. I am responsible for my family's well-being. \n[during depression]\n I won't be able to cope if my father's health worsens.",
    "intermediate_belief_depression": "",
    "coping_strategies": "Engaging in distractions such as watching TV and pacing around the house; using food delivery services instead of cooking to manage a loss of appetite; struggling to initiate conversations about difficult topics; standing passively after conversations feeling numb and unsure.",
    "situation": "Reflecting on the possibility of their father's passing before their mother.",
    "auto_thought": "The distant future when my father might pass away seems very close now; I don't know how to prepare for this eventuality.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Ruminating on hypothetical scenarios in the mind; trying to process the emotional impact of a parent's mortality; avoids interacting with the father.",
    "cognitive_distortion": "Catastrophizing, Fortune Telling, Mind Reading",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing\n1. Introduce the Concept and Identify the Target: Begin by discussing the client's anxieties surrounding their father's health and the potential loss. We will identify the tendency to catastrophize future events and jump to conclusions without evidence. I will introduce the Decatastrophizing technique to help them manage these overwhelming thoughts.\n2. Explore Specific Concerns: Ask the client to articulate their worst fears about their father's health and passing. This will help to pinpoint the specific catastrophic thoughts they are experiencing.\n3. Reality Check: Together, we will evaluate the likelihood of these catastrophic scenarios occurring. I will encourage the client to consider their father's current health situation and any evidence that counters their fears (e.g., current management of health issues, moments of stability).\n4. Challenge Negative Beliefs: Prompt the client to question the validity of their thoughts. For instance, I will ask, 'What evidence do you have that your father will pass away soon? What has been his health management like?' This will promote a more balanced perspective.\n5. Consider Alternatives: Encourage the client to think of alternative scenarios that are less catastrophic. We will brainstorm potential positive outcomes or neutral scenarios regarding their father's health.\n6. Develop Coping Strategies: Discuss practical steps the client can take to cope with their feelings of helplessness, such as initiating conversations with their father about health and family history, seeking support from friends or family, or exploring their feelings through journaling.\n7. Practice and Reflect: Assign the client homework to write down their catastrophic thoughts and then challenge them using evidence-based reasoning. Encourage them to practice talking to their father about health issues in a gentle, open manner. In our next session, we will review their experiences and refine coping strategies as necessary.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ambivalent",
    "resistance_internal_monologue": "I know we should talk about my father's health, but I keep thinking about other things that distract me from that reality.",
    "resistance_rationale": "The client's recent experiences with loss and their feelings of helplessness may lead them to avoid confronting difficult emotions directly. Their tendency to engage in distractions and ruminate on hypothetical scenarios suggests a pattern of sidetracking during therapy, even if they have a genuine desire to address their concerns."
  },
  {
    "name": "Leo",
    "id": "32-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history of complicated family dynamics and struggles with relationships within his family. He expresses feelings of disconnection and discomfort around his parents and feels slighted or judged by them, leading to detachment. Past issues related to his mother's illness and his parents' support of his education have generated feelings of guilt and frustration. The client also hints at possible issues with his mother's behavior towards him and possibly others (mentions of her being 'broken' and a past affair).",
    "helpless_belief": [
      "I am a failure, loser."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "I must be acknowledged and recognized by my parents to demonstrate my worth. \n[during depression]\n My parents see me as incompetent and a failure. My accomplishments can never get acknowledged by them, therefore I'm worthless and failing.",
    "intermediate_belief_depression": "",
    "coping_strategies": "The client copes by detaching from his family, cutting off relationships when feeling slighted, and trying to maintain control over his life and interactions. He also has a tendency to 'test' relationships through causing hurt, to validate his personal significance and the authenticity of the connection.",
    "situation": "Visiting his parents for a Father's Day family gathering over lunch.",
    "auto_thought": "Family interactions will inevitably lead to judgment; any engagement with family members will be uncomfortable; they will belittle me.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "disappointed"
    ],
    "behavior": "Tries to think of excuses to not show up; purposefully ignores texts from family about the gathering.",
    "cognitive_distortion": "Mind Reading, Fortune Telling, Disqualifying the Positive",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept and Identify the Target: We will begin by discussing your upcoming Father's Day family gathering and the thoughts and feelings that are arising for you. I'll help you articulate your concerns about judgment and discomfort in family interactions, focusing on the cognitive distortions at play. 2. Identify Automatic Thoughts: Together, we will identify the specific automatic thoughts you have about the family gathering, particularly those related to mind reading (e.g., 'They will belittle me.') and fortune telling (e.g., 'Any engagement will be uncomfortable.'). 3. Challenge the Thoughts: I will guide you through a series of evidence-based questions to challenge these thoughts. For example, I will ask: 'What evidence do you have that your family will judge you harshly?' and 'Have there been times when family interactions were not as uncomfortable as you predicted?' 4. Explore Counter-Evidence: We will work to uncover positive experiences from past family gatherings or interactions that contradict your current beliefs. This might include any moments of connection or support you've experienced. 5. Reframe the Thoughts: Based on our findings, we will collaboratively reframe your automatic thoughts into more balanced statements. For instance, instead of 'They will belittle me,' we might say, 'It's possible they will notice my efforts and appreciate my presence.' 6. Develop an Action Plan: To prepare for the gathering, we will create a list of coping strategies you can use to manage your anxiety. This might include breathing exercises, positive affirmations, or a plan to engage in specific conversations that have gone well in the past. 7. Practice and Accountability: As a follow-up, we will discuss how you can use these reframed thoughts and coping strategies during the gathering. You can also plan to journal your experiences afterward to reflect on how your predictions matched reality, reinforcing the practice of challenging cognitive distortions.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I just want to disappear when we talk about my family. It feels too heavy, and I doubt anything will change.",
    "resistance_rationale": "The client shows a pattern of detachment and discomfort in family interactions, which aligns with feelings of withdrawal when discussing painful topics. Their history of feeling slighted and judged by family members contributes to a tendency to emotionally disengage from discussions that provoke anxiety and fear of rejection."
  },
  {
    "name": "Logan",
    "id": "33-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded"
    ],
    "history": "The client shares a history of complicated romantic relationships. His most recent involvement is with a woman named Cleo, who is giving mixed signals towards the client. Cleo is already in a long-distance relationship, but is also seeing the client on the side. The client feels Cleo is emotionally maanipulative, but also is not willing to end thir relationship. The client has encountered similar situations before, reflecting a pattern in his relationships.",
    "helpless_belief": [
      "I am trapped."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I must support other's emotional needs to get love from them. \n[during depression]\n I'm just a tool for others' emotional convenience without getting a fair exchange. Everybody is using me as emotional crutch, and will eventually abandon me after the usage.",
    "intermediate_belief_depression": "",
    "coping_strategies": "The client expresses a tendency to control emotional exposure and not being 'drawn in' to avoid hurt. He also rationalize his supports as being generous.",
    "situation": "Saw suspicious text messages on Cleo's homescreen from another man.",
    "auto_thought": "She's just using me and will discard me like everyone else does.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "hurt"
    ],
    "behavior": "Intentionally tries to make Cleo jealous by going on dates with other women and letting Cleo know about it.",
    "cognitive_distortion": "Mind Reading, Catastrophizing, Labeling",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept: Begin by explaining the concept of 'mind reading' and how it's leading to negative assumptions about Cleo's intentions. Discuss how this thinking can lead to feelings of abandonment and loneliness.\n2. Identify the Negative Thought: Have the client articulate their auto thought: 'She's just using me and will discard me like everyone else does.' \n3. Gather Evidence: Prompt the client to consider the evidence for and against this thought. Ask: 'What specific actions has Cleo taken that make you feel this way? Can you think of any instances where she has shown care or interest in you?'\n4. Challenge the Thought: Encourage the client to reflect on the validity of their assumptions. Ask questions like: 'Is it possible that you are misinterpreting her behavior? What might be another explanation for her actions?'\n5. Reframe the Thought: Help the client create a more balanced thought. For example: 'Cleo has been inconsistent, but that doesn't necessarily mean she is using me. I need to communicate my feelings with her to understand her intentions better.' \n6. Link to Behavior: Discuss how this new perspective could influence their behavior with Cleo. Encourage the client to express their feelings directly to her instead of trying to invoke jealousy. \n7. Homework Assignment: Assign the client to journal any further instances where they notice themselves engaging in mind reading or catastrophizing, and to practice the reframing technique discussed in session.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Interrupting",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I just want to talk about how Cleo is making me feel, but I keep getting sidetracked with these exercises.",
    "resistance_rationale": "The client exhibits a pattern of feeling overwhelmed and frustrated by their relationship dynamics, leading to interruptions when discussing therapeutic homework. This reflects a mixed motivation to engage while simultaneously resisting treatment that feels irrelevant to their immediate emotional turmoil."
  },
  {
    "name": "Taylor",
    "id": "35-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client's family background seems to be a significant factor in shaping their current mental state. They described a challenging conversation with their mom about why their family didn't discuss pain or suffering. The client also recounts their father's coping mechanisms and his reluctance to engage in talk therapy despite experiencing considerable suffering, including disturbing dreams related to his brother's suicide. Additionally, the client mentioned their own struggle with feelings of separation and suffering, indicating a history of unaddressed emotional pain.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am trapped.",
      "I am defective."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [],
    "intermediate_belief": "The client seems to have intermediate beliefs surrounding communicability of emotions, particularly regarding their ability or inability to express or deal with suffering and raw feelings. They may also carry beliefs about gender-related emotional expression, as they mentioned a belief their mother holds about men not talking about their feelings. Additionally, they may have beliefs related to the visibility of emotional pain, as evidenced by their surprise at not having noticed suffering in themselves or others earlier.",
    "intermediate_belief_depression": "During periods of emotional pain or depression, the client seems to struggle with connecting to or fully experiencing their feelings. They describe using detached language when discussing painful emotions, which might indicate intermediate beliefs that serve to keep them at a distance from their suffering ('what are these experiences and how do I relate to them, and how are, and why, and like, what, why can't I be fully in them').",
    "coping_strategies": "The client reveals several coping strategies: seeking validation and understanding through conversations with their mother and Jeremy (someone close to them), using metaphorical and reflective language to articulate feelings, and reading (e.g., Carl Rogers' book) to gain insight and perspective. They also ponder the effectiveness of acceptance as a means of dealing with detachment and raw emotions.",
    "situation": "Discussing feelings of detachment with Jeremy.",
    "auto_thought": "I feel detached and unable to fully engage with my own experiences and emotions.",
    "emotion": [
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Explores the sensation of detachment and struggles with communicating the texture of that pain.",
    "cognitive_distortion": "Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: We will begin by discussing your feelings of detachment and how these emotions are influencing your self-perception and beliefs. I'll explain the concept of emotional reasoning and how it can lead to distorted thinking. 2. Identify Emotional Beliefs: We will explore the auto thought, 'I feel detached and unable to fully engage with my own experiences and emotions,' and identify specific beliefs this thought triggers, such as 'I am unlovable.' 3. Gather Evidence: I will guide you to examine the evidence supporting and contradicting your feelings. This will include reflecting on times when you have engaged fully with your emotions or connected with others. 4. Challenge Emotional Reasoning: Using evidence-based questioning, I will ask you to consider: 'What evidence do I have that contradicts the belief that I am unlovable when I feel detached?' and 'Have there been moments where I felt engaged and connected?' 5. Reassess Emotional Impact: After gathering evidence, we will reassess how this new information influences your feelings of detachment. I will ask, 'Given this evidence, how true does it feel to say I am unlovable?' 6. Develop Compassionate Self-Statements: We will work together to create new, evidence-based self-statements that reflect your worth and capability to connect with emotions, such as 'I am capable of feeling and expressing my emotions, and my feelings of detachment do not define my worth.' 7. Practice and Integration: Finally, we will discuss strategies for practicing these new beliefs in daily life and how to apply evidence-based questioning when you notice emotional reasoning affecting your self-view. This will help strengthen your ability to engage with your emotions authentically.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I want to talk about how I feel, but it's just so hard to put it into words. I feel like I'm not really here.",
    "resistance_rationale": "The client's history of emotional detachment and struggles with expressing feelings indicates a tendency toward withdrawal in therapy. Their intermediate beliefs about the communicability of emotions and the discomfort surrounding their emotional experiences suggest they may engage in withdrawal as a coping strategy, reflecting ambivalence about fully engaging in the therapeutic process."
  },
  {
    "name": "Riley",
    "id": "36-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has experienced significant stress due to financial concerns and relationship instability within their social circle. The client has felt overwhelmed by the responsibilities at work, including dealing with computer problems and handling issues in the absence of a co-worker named Chet. The client has a social network that imposes emotional demands, with friends experiencing personal crises and showing dependent behavior. Furthermore, the client's birthday is approaching, and they are contemplating asking their parents to pay their therapy bill as a birthday gift. The client exhibits some avoidance in dealing with their parents' visit and managing social interactions at an upcoming convention.",
    "helpless_belief": [
      "I am needy.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I must have a financial cushion or I am irresponsible, I should be able to manage work stress better, I have to be available for my friends' needs, I must balance everyone's expectations with my own needs",
    "intermediate_belief_depression": "When stressed and depressed, I lose track of money, and this contributes to feeling incompetent and helpless. I worry too much about others' needs and this leads to feeling overwhelmed and unable to say no.",
    "coping_strategies": "Asking friends or parents for financial support, using avoidance tactics to manage social demands, employing humor to deal with hurtful situations, seeking therapy to discuss emotional challenges.",
    "situation": "Realizing bank balance was $800 lower than expected.",
    "auto_thought": "Where did all my money go? Am I being irresponsible like my friend's husband?",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Avoids reviewing finances thoroughly; feels stressed and overwhelmed; contemplates asking friends for money.",
    "cognitive_distortion": "Overgeneralizing, Should Statements, Mind Reading",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Technique: We will start by discussing the recent situation where you realized your bank balance was lower than expected. I will explain the concept of Evidence-Based Questioning and how it can help challenge your negative thoughts and beliefs about your financial situation.\n2. Identify Negative Thoughts: Together, we will identify the specific negative thoughts that have arisen from this situation, such as 'I am irresponsible like my friend's husband' and 'I must have a financial cushion or I am irresponsible.'\n3. Gather Evidence: I will guide you to gather evidence for and against these thoughts. We will ask questions like: 'What evidence do you have that you are irresponsible?' and 'Have there been times when you managed your finances well?' This will help you to see a more balanced view of your financial behavior.\n4. Challenge Assumptions: Next, we will address the assumptions behind your thoughts. For example, we will explore what being 'irresponsible' means and whether that label truly applies to you. I will ask you to consider: 'Is it possible that everyone struggles with finances at times?' and 'What does it mean to have a financial cushion?' \n5. Reframe the Thoughts: After examining the evidence, we will work together to create alternative statements that are more balanced and realistic. For instance, instead of 'I am irresponsible,' you might say, 'I am learning to manage my finances better, and it's okay to seek help when I need it.'\n6. Develop an Action Plan: We will create a small, manageable action plan to address your finances, like setting a budget or scheduling time to review your expenses. This will empower you to take control of your financial situation and reduce feelings of helplessness.\n7. Practice and Follow-Up: Finally, I will encourage you to practice using Evidence-Based Questioning in everyday situations where you feel overwhelmed. We will plan to review your progress in our next session, discussing any challenges you faced and how you applied the technique.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ambivalent",
    "resistance_internal_monologue": "I know I should be focusing on my financial issues, but talking about my friends' problems feels easier right now.",
    "resistance_rationale": "The client exhibits ambivalence towards discussing their financial situation, often deflecting to their friends' emotional needs, indicating a tendency to avoid facing their own challenges. This behavior suggests a mixed motivation to engage in therapy, aligning with an intermediate level of resistance."
  },
  {
    "name": "Riley",
    "id": "36-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has experienced significant stress due to financial concerns and relationship instability within their social circle. The client has felt overwhelmed by the responsibilities at work, including dealing with computer problems and handling issues in the absence of a co-worker named Chet. The client has a social network that imposes emotional demands, with friends experiencing personal crises and showing dependent behavior. Furthermore, the client's birthday is approaching, and they are contemplating asking their parents to pay their therapy bill as a birthday gift. The client exhibits some avoidance in dealing with their parents' visit and managing social interactions at an upcoming convention.",
    "helpless_belief": [
      "I am needy.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I must have a financial cushion or I am irresponsible, I should be able to manage work stress better, I have to be available for my friends' needs, I must balance everyone's expectations with my own needs",
    "intermediate_belief_depression": "When stressed and depressed, I lose track of money, and this contributes to feeling incompetent and helpless. I worry too much about others' needs and this leads to feeling overwhelmed and unable to say no.",
    "coping_strategies": "Asking friends or parents for financial support, using avoidance tactics to manage social demands, employing humor to deal with hurtful situations, seeking therapy to discuss emotional challenges.",
    "situation": "Interacting with demanding friends at the convention and trying to manage their expectations alongside personal stress.",
    "auto_thought": "I can't satisfy everyone's needs and my own. I'm going to be drained and won't enjoy myself.",
    "emotion": [
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Sends preemptive email to set boundaries, experiences frustration and worry about potential clinginess and social demands.",
    "cognitive_distortion": "Should Statements, Overgeneralizing, Emotional Reasoning",
    "cbt_technique": "Pros and Cons Analysis",
    "counseling_plan": "Pros and Cons Analysis\n1. Introduce the Concept: Begin by explaining the Pros and Cons Analysis technique and how it can help clarify the client's thoughts about balancing their own needs with those of their friends.\n2. Identify the Situation: Discuss the upcoming convention and the specific thoughts around feeling overwhelmed by demands. Ask the client to articulate their automatic thoughts, particularly focusing on 'I can't satisfy everyone's needs and my own.'\n3. Create a Pros and Cons List: Together, we will create two columns on a sheet of paper—one for Pros and one for Cons. Start with the Pros of trying to meet everyone’s needs (e.g., maintaining friendships, feeling valued) and then move to the Cons (e.g., feeling drained, neglecting personal needs).\n4. Explore Emotional Impacts: Discuss how these thoughts and actions make the client feel emotionally. Ask questions like, 'What emotions come up when you think about not being able to satisfy everyone's needs?' This may help in identifying the emotional reasoning behind their thoughts.\n5. Assess Realistic Outcomes: Evaluate the likelihood of the worst-case scenarios they fear. Encourage the client to think critically about whether failing to meet everyone's needs would lead to the disastrous outcomes they imagine.\n6. Reframe the Thought: After reviewing the Pros and Cons, work together to reframe the automatic thought. For example, shift from 'I can't satisfy everyone's needs' to 'I can prioritize my needs while still being supportive to my friends.'\n7. Develop an Action Plan: Create a plan for the convention that includes setting clear boundaries and practicing saying no when necessary. Encourage the client to articulate their needs to their friends and identify specific situations where they can assert these boundaries. \n8. Homework Assignment: For the next week, ask the client to keep a journal of situations where they felt pressured to meet others' needs and how they managed those situations. This will aid in reinforcing the skills learned during the session.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I just feel so overwhelmed, and I’m not sure I can really talk about what’s going on.",
    "resistance_rationale": "The client exhibits signs of feeling overwhelmed due to financial concerns and social pressures, leading to emotional withdrawal during sessions. Their history indicates a tendency to avoid discussing difficult topics, and their internal monologue reflects a struggle to engage fully in therapy, suggesting ambivalence toward the process."
  },
  {
    "name": "Hudson",
    "id": "37-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history involving a stressful labor dispute situation at a previous workplace, which seems to have had a significant impact on their views regarding fairness, compensation, and trust in authority figures.",
    "helpless_belief": [],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "Others will not fairly compensate or recognize my effort; authority figures cannot be trusted; my feelings and reactions may not be valid.",
    "intermediate_belief_depression": "People are fundamentally selfish and exploitative; I cannot rely on others for basic fairness or understanding.",
    "coping_strategies": "Seeking validation through persuasion and argumentation; becoming angry and resistant as a way to assert control; intellectualizing emotional responses.",
    "situation": "Thinking about a case at work and the businessman's reaction to it.",
    "auto_thought": "He still stood by what he did, which is inexcusable and selfish.",
    "emotion": [
      "angry, mad, irritated, annoyed"
    ],
    "behavior": "Judges the situation harshly; may become confrontational when discussing similar ethical scenarios.",
    "cognitive_distortion": "Labeling, All-or-Nothing Thinking",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin the session by discussing the client's harsh judgment of the businessman's actions, highlighting the labeling involved. Explain how this type of thinking can affect their emotional state and relationships. 2. Identify Automatic Thoughts: Ask the client to articulate their automatic thought regarding the businessman (e.g., 'He is inexcusable and selfish') and explore the emotional response it triggers. 3. Challenge the Thought: Use evidence-based questioning to examine the thought critically. Ask questions such as: 'What evidence do you have that supports this label?' and 'Is there any evidence that contradicts it?' 4. Explore Alternative Perspectives: Encourage the client to consider the businessman's context or motivations. Questions like 'Could there be reasons for his actions that you haven't considered?' can help broaden their viewpoint. 5. Reframe the Thought: Guide the client to create a more balanced perspective. Instead of labeling the businessman, they might summarize the situation as 'He made a decision I disagree with, but it might not define his character.' 6. Discuss Implications: Talk about how holding onto harsh labels can affect their behavior and relationships. Discuss the importance of empathy and understanding in professional environments. 7. Practice the Technique: Encourage the client to practice this questioning technique whenever they catch themselves labeling others or situations. Assign a task to reflect on instances in the coming week where they can apply evidence-based questioning to their thoughts.",
    "resistance_type": "Direct",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I don't understand how you expect me to trust your guidance when it feels like you're not even considering my perspective.",
    "resistance_rationale": "The client has a history of feeling exploited and has developed a belief that authority figures cannot be trusted. Their anger and confrontational coping strategies suggest a tendency to criticize the therapist, especially when discussing topics that challenge their views on fairness and trust."
  },
  {
    "name": "Hudson",
    "id": "37-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history involving a stressful labor dispute situation at a previous workplace, which seems to have had a significant impact on their views regarding fairness, compensation, and trust in authority figures.",
    "helpless_belief": [],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "Others will not fairly compensate or recognize my effort; authority figures cannot be trusted; my feelings and reactions may not be valid.",
    "intermediate_belief_depression": "People are fundamentally selfish and exploitative; I cannot rely on others for basic fairness or understanding.",
    "coping_strategies": "Seeking validation through persuasion and argumentation; becoming angry and resistant as a way to assert control; intellectualizing emotional responses.",
    "situation": "Being asked to work extra without compensation during the labor dispute.",
    "auto_thought": "I am being taken advantage of and not receiving fair treatment.",
    "emotion": [
      "angry, mad, irritated, annoyed"
    ],
    "behavior": "Insists on compensation for the extra work; becomes confrontational with authority.",
    "cognitive_distortion": "Overgeneralizing, Mind Reading, Catastrophizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept: We will start by discussing the client's feelings of being taken advantage of and their automatic thought regarding unfair treatment. I'll explain the concept of evidence-based questioning to challenge their negative assumptions. \n2. Identify Core Beliefs: Together, we will explore the beliefs that lead to the feelings of anger and irritation when asked to work extra without compensation. We'll focus on beliefs about authority and fairness. \n3. Gather Evidence: I will guide the client to articulate specific instances where they felt taken advantage of. We will examine these situations closely and identify whether their feelings align with the reality of those experiences. \n4. Challenge Assumptions: I will ask the client to consider questions such as: 'What evidence do you have that this situation will be just like past experiences?' and 'Have there been times when authority figures acted fairly or recognized your efforts?' \n5. Reframe the Thought: After gathering evidence, we will work together to reframe the automatic thought. Instead of 'I am being taken advantage of,' we might create a more balanced thought such as, 'While I feel uneasy about this request, I can communicate my needs without assuming the worst.' \n6. Discuss Action Steps: We will brainstorm constructive ways to address the current request without confrontation, focusing on assertive communication rather than anger. \n7. Practice and Reflection: The client will be encouraged to apply evidence-based questioning in real-time situations and reflect on any changes in their emotional responses. We will plan to review their experiences in the next session.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I just don’t see how this therapy is going to help me when I can’t trust anyone to be fair.",
    "resistance_rationale": "The client has a history of feeling taken advantage of, leading to a deep-seated mistrust of authority and a belief that their feelings are not valid. Their anger and confrontational behavior suggest a clear resistance to treatment that challenges these entrenched beliefs, while still showing some motivation to engage with the therapy process."
  },
  {
    "name": "Sydney",
    "id": "39-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client indicates a history of suffering from anxiety-related stomachaches and experiencing stress-induced physical symptoms. The client also has a past of struggling with their weight, sexuality, and academic performance until a positive transformation occurred in college. Additionally, the client has experienced feelings of not being in control and engaging in patterns of behavior where they seek control in relationships.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If I am not in control, something bad will happen. I need to know the reasons for my symptoms to feel calm. My happiness is directly tied to my physical health and being in a desirable state.",
    "intermediate_belief_depression": "When feeling unwell or scared about health, the client obsesses over the causes of their symptoms and fears the worst outcomes, signaling a heightened state of worry and preoccupation with health issues.",
    "coping_strategies": "Attempting to maintain a sense of control over situations, environments, and relationships; seeking reassurance through understanding causes of physical symptoms; exercising for stress release; using social interactions to distract from anxiety.",
    "situation": "Experiencing stomach issues and concerned about the healing process.",
    "auto_thought": "My stomach problems might not heal; I might not have control over the situation; there could be something else preventing healing.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Seeking medical reassurance, ruminating on health, avoiding certain foods, trying to follow medical advice despite anxiety",
    "cognitive_distortion": "Catastrophizing, Fortune Telling, Mind Reading",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduction to Decatastrophizing: We will start by discussing your recent experiences with stomach issues and how they have led to intense worry about your health. I will explain the concept of catastrophizing and how it contributes to your anxiety.\n2. Identify Catastrophic Thoughts: Together, we will identify specific thoughts that are driving your anxiety, such as 'My stomach problems might not heal' and 'There could be something else preventing healing.'\n3. Challenge the Catastrophic Thoughts: We will evaluate the likelihood of these catastrophic outcomes occurring. I will ask questions like: 'What evidence do you have that your stomach problems won't heal? What are the chances of the worst-case scenario happening?' \n4. Create a Balanced Perspective: I will guide you in formulating a more balanced thought, focusing on the evidence that suggests healing is possible and that you have taken steps towards managing your health.\n5. Develop a Coping Plan: We will create a plan for coping with anxiety when it arises, including grounding techniques and strategies to challenge unhelpful thoughts in real-time.\n6. Practice Mindfulness: I will introduce mindfulness exercises to help you stay present and reduce ruminating thoughts about your health.\n7. Review Progress: At the end of the session, we will discuss any changes in your feelings of anxiety and how the techniques can be employed in daily situations to combat catastrophic thinking.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ambivalent",
    "resistance_internal_monologue": "I know I should be focusing on my health worries, but talking about it makes me feel overwhelmed. Maybe we could discuss something else for a bit?",
    "resistance_rationale": "The client demonstrates ambivalence towards directly confronting their health anxieties and instead resorts to sidetracking conversations, perhaps as a coping mechanism to avoid discomfort. Their history of seeking control over their circumstances while simultaneously feeling trapped indicates a mixed motivation to engage fully in therapy, reflecting intermediate resistance."
  },
  {
    "name": "Quinn",
    "id": "41-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history involving a complicated relationship with an individual named Cricket, who has exhibited questionable behavior and influenced the client's social circle. Their friends seem to have mental health challenges, and they often take on a caretaking or protective role, particularly regarding a friend named Lucy with medical issues.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [],
    "intermediate_belief": "It's important for me to be on time and productive, but I can't seem to control my procrastination or punctuality. I must not get involved in my friends' dramatic situations, but I can't help feeling protective.",
    "intermediate_belief_depression": "My environment is consistently negative, possibly affecting my mood. If I expose myself or engage with Cricket, it will have negative outcomes, and it's better to avoid confrontation.",
    "coping_strategies": "The client uses avoidance in confronting their grief and engages in overcommitment to helping others to compliment their inner grief and distress.",
    "situation": "Friends coming over for dinner and waiting outside because the client was late leaving work.",
    "auto_thought": "I'm rude for keeping people waiting, I should be better organized.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "guilty"
    ],
    "behavior": "Avoids leaving work on time and continues tweaking unnecessary things.",
    "cognitive_distortion": "Should Statements, Overgeneralizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session Focus: Begin by discussing the situation where you felt you kept your friends waiting and how that relates to your feelings of being rude. We will explore the 'should' statements you use regarding punctuality and organization. 2. Identify Automatic Thoughts: Ask you to share the specific thoughts that arise when you think about being late. For example, 'I should be better organized' or 'I'm rude for keeping people waiting.' 3. Challenge the Thoughts: Use Evidence-Based Questioning to evaluate these thoughts. We will ask questions like: - 'What evidence do you have that being a few minutes late makes you rude?' - 'Have your friends ever expressed that they feel disrespected when you are late?' - 'Is it possible that your friends understand that work can sometimes run late?' 4. Gather Counter-Evidence: Together, we will list evidence that contradicts your automatic thoughts, such as instances where your friends have been understanding or situations where being late did not result in negative consequences. 5. Reframe the Thoughts: Based on the gathered evidence, help you create more balanced thoughts. For example, instead of 'I should be better organized,' we might reframe it to 'I am doing my best to manage my time, and sometimes delays happen.' 6. Practice New Thinking: Encourage you to practice these reframed thoughts in real-life situations. Each time you feel anxious about being late, try to recall the new, balanced perspective. 7. Link to Behavioral Change: Discuss how these reframed thoughts can impact your behavior. We can set small goals for you to leave work on time, reminding yourself that it's okay to be imperfect and that your friends value your company over strict punctuality.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Anxious",
    "resistance_internal_monologue": "I want to say something, but I feel like it won’t matter anyway. What’s the point of even trying?",
    "resistance_rationale": "The client's history of avoiding confrontation and taking on a protective role suggests a tendency to withdraw during discussions, especially when feeling anxious about their social interactions. Their feelings of incompetence and helplessness contribute to a mixed motivation to engage in therapy, reflecting intermediate resistance."
  },
  {
    "name": "Morgan",
    "id": "42-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client's life history includes significant pressure during grad school, as reflected in recurring nightmares about being unprepared for a thesis defense. Furthermore, the client's experience with their father's expectations and failure to instill his religion and negative experiences as a child may have shaped some deeply held beliefs.",
    "helpless_belief": [
      "I am incompetent.",
      "I am out of control.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [],
    "intermediate_belief": "The client displays beliefs that they need to maintain control and keep up with others' expectations to avoid frustration or disappointment. They seem to believe that they must handle everything alone and cannot rely on others.",
    "intermediate_belief_depression": "During depressive episodes, the client believes that their work isn't making an impact, feeling ineffective and as if they are not meeting expectations, which exacerbates their sense of incompetence and failure.",
    "coping_strategies": "The client exhibits coping strategies such as emotionally reassuring others at work, trying to meet perceived expectations, and probably avoiding discussing their feelings directly with colleagues.",
    "situation": "Recurring nightmare of coworkers talking behind the client's back.",
    "auto_thought": "My co-workers all think horrible things about me.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "suspicious"
    ],
    "behavior": "Ruminating on the opinions of coworkers, potentially impacting their self-esteem and performance.",
    "cognitive_distortion": "Mind Reading",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept and Identify the Target: We will start by discussing your recurring nightmares and the thoughts you have about your coworkers. I will highlight the cognitive distortion of mind reading, where you assume you know what others are thinking without any concrete evidence. 2. Explore the Automatic Thought: We will examine your automatic thought, 'My coworkers all think horrible things about me,' and how it affects your emotions and behaviors. 3. Gather Evidence: I will guide you in listing specific examples of interactions with your coworkers. We will ask questions like, 'What evidence do you have that supports this belief?' and 'What evidence contradicts this thought?' 4. Challenge the Thoughts: Together, we will analyze the evidence and identify any assumptions or biases in your thinking. We will explore alternative explanations for your coworkers' behavior that are less negative and more neutral or positive. 5. Reframe the Thought: Based on our exploration, we will work on reframing your automatic thought to something more balanced, such as 'I don't know what my coworkers think, and there are many possible interpretations of their behavior.' 6. Link to Behavior: We will discuss how adopting this new perspective can impact your interactions with coworkers and encourage you to engage more openly with them. Your task will be to practice this reframed thought in real situations and observe any changes in your feelings and behaviors.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Pessimistic",
    "resistance_internal_monologue": "I know we’re supposed to talk about my feelings, but honestly, I keep thinking about how everyone at work must see me as a failure.",
    "resistance_rationale": "The client exhibits a tendency to avoid direct engagement with their feelings and instead focuses on external perceptions, reflecting their struggle with feelings of incompetence. This sidetracking behavior aligns with their ruminations about coworkers' opinions and indicates a mix of resistance and a desire to address their issues."
  },
  {
    "name": "Skyler",
    "id": "43-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has had experiences of feeling unheard and emotionally invalidated since a young age, such as the recollection of being chastised for crying as a child. They have struggled with depression. Their interactions with Edson and others may have reactivated these historical feelings of invalidation.",
    "helpless_belief": [],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted.",
      "I am bound to be rejected.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "People will not find me worth their time. If someone does not reach out to me, it means they do not value me. If I am not explicitly included, I am unwanted. My worth is contingent on others' acceptance.",
    "intermediate_belief_depression": "When I am depressed, no one will want to be around me. If I'm not perfect, people will reject me. My value to friends is conditional on my ability to be socially available and upbeat.",
    "coping_strategies": "The client uses avoidance like declining invitations or rebuffing attempts to interact (such as Edson's dinner invitation) as a protective measure. They seek affirmation from others to combat feelings of rejection but also distance themselves from situations where they could potentially feel hurt.",
    "situation": "Not being invited by a friend for a dinner with other friends.",
    "auto_thought": "My friends don't want me around, I am forgotten and excluded.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "hurt"
    ],
    "behavior": "Expresses hurt feelings to friend, internalizes the situation as a rejection.",
    "cognitive_distortion": "Mind Reading, Overgeneralizing, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept: We will start the session by discussing your hurt feelings about not being invited to dinner and how this has led to assumptions about your worth and friendships. I'll explain the concept of 'Mind Reading' and 'Emotional Reasoning' to identify how these thoughts may be influencing your feelings.\n2. Identify Automatic Thoughts: I'll ask you to share the specific thoughts that came to mind when you learned about the dinner invitation. We'll write these down to clarify the beliefs that might be contributing to your emotional state.\n3. Challenge Assumptions: I'll guide you to ask yourself critical questions about these thoughts, such as:  \n- 'What evidence do I have that my friends don’t want me around?'  \n- 'Have my friends ever expressed that they value me?'  \n- 'Could there be other reasons for not being invited that have nothing to do with my worth?'  \n4. Explore Past Experiences: We'll reflect on past interactions with friends to gather evidence that contradicts the idea that you are unwanted or unlovable. I will prompt you with questions like:  \n- 'Can you recall a time when you felt included or appreciated by your friends?'  \n- 'How did those friends demonstrate their care for you?'  \n5. Reassess Feelings: After evaluating the evidence, we will discuss how these reflections change your feelings about the situation. I'll ask you to rate your feelings of worth and inclusion before and after this questioning process.\n6. Develop Alternative Thoughts: Together, we will formulate more balanced thoughts that reflect the evidence gathered. For example, shifting from 'My friends don't want me around' to 'I may not have been invited this time, but that doesn’t mean I’m unworthy or unlovable.'  \n7. Practice and Reflection: I will encourage you to practice this questioning technique in daily situations where you notice similar negative thoughts. We will conclude by discussing how to implement this strategy in future social interactions to combat feelings of rejection.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Interrupting",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Hurt",
    "resistance_internal_monologue": "I just don't think this is going to help me. Can we talk about something else?",
    "resistance_rationale": "The client has a history of feeling unheard and invalidated, which contributes to their reluctance to engage fully in therapy. Their beliefs about being unwanted and their tendency to use avoidance as a coping strategy suggest that they may interrupt to divert discussions away from uncomfortable feelings or topics. Their emotional state reflects hurt, indicating sensitivity to perceived rejection or invalidation."
  },
  {
    "name": "Elena",
    "id": "44-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a complex family dynamic with recurrent conflicts and relational strains. The client has presented issues with trust and boundaries among family members and associates, some of whom struggle with alcoholism, a relative who she feels has taken advantage of her generosity, and shows a general frustration with the people surrounding her. The client discusses past episodes of significant aggressive behavior and indicates a history of violence.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "People always take advantage of me, I need to be assertive to not be a victim, I must protect myself from being hurt by others, I can't rely on anyone.",
    "intermediate_belief_depression": "When I'm depressed, I believe that I will always be alone because nobody cares, I'm unlovable, and it's useless to try because people will disappoint me.",
    "coping_strategies": "Avoidance of social interactions to prevent feeling overwhelmed by rage, the client stays at home and isolates in the bedroom.",
    "situation": "Reflecting on the prospect of spending time alone during holidays.",
    "auto_thought": "I am always the one giving and never receiving. People only remember me when they need something.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "hurt"
    ],
    "behavior": "Expresses resentment and continues to ruminate on past unreciprocated generosity, reinforcing isolation.",
    "cognitive_distortion": "Overgeneralizing, Labeling, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: We will begin the session by exploring your feelings about spending time alone during the holidays and the negative thoughts that arise, particularly your belief that you are always the one giving and never receiving. I will explain the concept of overgeneralizing and how it impacts your perception of relationships. 2. Identify Specific Instances: Together, we will differentiate between your feelings and the evidence supporting your belief. I will ask you to identify specific instances where you felt unappreciated or taken advantage of and contrast those with times you felt valued by others. 3. Challenge the Beliefs: Using evidence-based questioning, we will explore questions such as: 'Is it true that you always give and never receive?' and 'Can you recall specific times when someone showed appreciation for you?' 4. Gather Evidence: We will compile a list of positive experiences and relationships that contradict your belief. I will prompt you with questions like: 'What do your friends or family say about your contributions?' and 'What positive feedback have you received in the past?' 5. Re-evaluate the Thoughts: With our gathered evidence, I will guide you to re-evaluate your automatic thought and assess its validity. We will work on generating a more balanced thought that reflects both your generosity and the appreciation you have received. 6. Create a New Narrative: Together, we will develop a new, compassionate narrative that acknowledges your feelings while also recognizing the reciprocal nature of relationships. For example, a revised thought might be: 'I often give to others, but I have also received love and support in return.' 7. Link to Behavior: Finally, we will discuss practical steps to reduce isolation, such as reaching out to friends or family during the holidays, while reminding you to keep our new perspective in mind. This will help reinforce the idea that not every interaction is one-sided and encourage you to engage with others.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I want to connect with others, but what’s the point? They never really care about me.",
    "resistance_rationale": "The client's history of feeling unlovable and their current pattern of avoidance and isolation suggest a tendency to withdraw emotionally during therapy. Their intermediate belief about needing to protect themselves indicates a conflict between the desire to engage and a fear of disappointment, leading to mixed motivations in the therapeutic setting."
  },
  {
    "name": "Jordan",
    "id": "45-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history of developing friendships that potentially evolve into romantic relationships. They have gone through experiences where expressing their opinions, especially when angry, has led to social discord and the potential loss of friendships, which they find deeply unsettling. Additionally, the client has a complex relationship with their parents, marked by negative feelings, love, and obligation.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "The client holds beliefs that they must restrain their own opinions and expressions of anger to preserve relationships, fearing that if they express discontent or negative emotions, it may lead to social isolation or being disliked by others.",
    "intermediate_belief_depression": "During periods of distress, the client believes that expressing their opinions will alienate them, and they also worry that by not expressing themselves, they will become uninteresting to others, which could lead to the deterioration of their social relationships.",
    "coping_strategies": "The client utilizes avoidance and suppression of their thoughts and feelings as a coping mechanism to prevent conflict or rejection. They have also demonstrated a pattern of seeking comfort and reassurance from their partner after experiencing distress.",
    "situation": "Difficulty with organizing and processing work results due to the fear of making mistakes.",
    "auto_thought": "I am afraid that I am forgetting or overlooking something important in my work.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Procrastination and avoidance of task completion, leading to emotional distress and reduced productivity.",
    "cognitive_distortion": "Fortune Telling, Mind Reading, Catastrophizing",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "1. Introduce the Concept and Identify the Target: Begin the session by discussing the client's fear of making mistakes at work and the anxiety associated with their automatic thought of forgetting something important. Introduce the Decatastrophizing technique as a way to challenge the worst-case scenarios they envision. 2. Explore the Catastrophic Thoughts: Ask the client to share their specific fears about forgetting or overlooking something at work. Write these fears down to visualize them. 3. Assess the Likelihood: Discuss the actual likelihood of these fears coming true. Encourage the client to consider past experiences where they feared similar outcomes. 4. Examine the Evidence: Together, evaluate the evidence supporting their fears. Ask questions like: 'What has happened in the past when you felt this way?' and 'Have there been times when things turned out better than you expected?' 5. Generate Coping Strategies: Help the client brainstorm potential strategies to manage their fears. For example, they could create checklists or set reminders to help them feel more organized and secure. 6. Create a Balanced Perspective: Guide the client to reframe their thoughts. Instead of thinking, 'I will forget something important,' help them rephrase it to, 'I might forget something, but I can prepare to help minimize that risk.' 7. Practice and Link to Behavior: Encourage the client to practice using the Decatastrophizing technique in future situations where they feel overwhelmed by fear. They can journal their thoughts and responses to reinforce this new mindset.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Anxious",
    "resistance_internal_monologue": "I want to express how I feel, but what if it pushes people away? Maybe it's better to just keep quiet.",
    "resistance_rationale": "The client's history of avoiding conflict and suppressing emotions to maintain relationships indicates a tendency to withdraw during sessions, especially when discussing difficult topics. Their anxiety about expressing opinions aligns with an intermediate level of resistance, as they may feel conflicted about engaging fully in therapy while fearing potential negative outcomes."
  },
  {
    "name": "Violet",
    "id": "46-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history of being involved with friends who are experiencing significant stressors, such as a friend Yvonne dealing with tenure and an autistic child. The client has an emotional involvement with these individuals and seems to feel a sense of responsibility towards them.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am a victim.",
      "I am needy."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If I don't support my friends, no one will; I must always be available to help others, even at my own expense.",
    "intermediate_belief_depression": "My friends' happiness and stability rest upon my shoulders; I have to absorb their negative feelings to help them.",
    "coping_strategies": "The client uses emotional support from friends as a coping strategy but finds it draining because these friends are also dealing with their own depressive states and crises. The client feels guilty for wanting to set boundaries and limit time spent with these friends.",
    "situation": "Thinking about visiting Yvonne and dealing with her living situation and child.",
    "auto_thought": "I am dreading this; it's going to be draining and there's nothing I can do to fix it.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy",
      "guilty"
    ],
    "behavior": "Continues to visit Yvonne, feels drained and unhappy, potentially enabling Yvonne's lack of taking action.",
    "cognitive_distortion": "Emotional Reasoning, Should Statements, Personalizing",
    "cbt_technique": "Decatastropizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept and Identify the Target: We will start by discussing your feelings about visiting Yvonne and the concerns that arise. We'll identify how you feel that your presence is crucial for your friends' well-being, leading to emotional distress and guilt. I will introduce the Decatastrophizing technique to challenge these overwhelming feelings and thoughts.\n2. Identify Catastrophic Thoughts: Together, we will list the worst-case scenarios you envision when you think about visiting Yvonne. For example, 'If I don't go, Yvonne will struggle even more, and I will be a bad friend.'\n3. Evaluate Likelihood and Evidence: We will examine these catastrophic thoughts by assessing the likelihood of these outcomes happening. I will ask questions such as: 'What evidence do you have that Yvonne cannot manage her situation without your help?' and 'Have there been times when you were not available, but things worked out for her?' \n4. Challenge the Catastrophic Thoughts: I will help you to challenge the validity of these thoughts by discussing the potential positive outcomes, such as Yvonne finding her own solutions or you setting healthy boundaries.\n5. Create a Balanced Perspective: We will work together to create a more balanced thought, such as: 'While I want to support Yvonne, it's also important for me to take care of my own emotional health. I can help her without sacrificing my well-being.'\n6. Develop an Action Plan: We will create a plan for your visit that includes setting boundaries for how long you will stay or how much emotional energy you can invest, allowing you to support Yvonne while also protecting your own mental health.\n7. Practice and Reflect: To reinforce this technique, we will discuss how you can apply the Decatastrophizing method in future situations. Your goal will be to recognize when you're succumbing to catastrophic thinking patterns and to actively challenge those thoughts, allowing for a healthier emotional balance.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Sad",
    "resistance_internal_monologue": "I feel like I should be more engaged, but just thinking about visiting Yvonne drains me, and I don't know how to express that.",
    "resistance_rationale": "The client feels a strong sense of obligation to support friends at their own expense, leading to feelings of sadness and withdrawal when discussing these situations. Their coping strategies involve emotional support from others, resulting in guilt and emotional fatigue, which manifests as in-session withdrawal."
  },
  {
    "name": "Charlie",
    "id": "47-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client is educated with a master's degree in engineering and is considering a career change. They have experience in robotics from their junior year of college. They also mentioned being in a situation where they felt ashamed and embarrassed about not dedicating enough time to a project, which impacted the project's success.",
    "helpless_belief": [
      "I am incompetent.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [],
    "intermediate_belief": "Success is defined by professional achievements and the approval of others. Self-worth is tied to productivity and creative output.",
    "intermediate_belief_depression": "When depressed, the client seems to believe that making mistakes or not accomplishing tasks indicates a lack of competence and control.",
    "coping_strategies": "The client deals with stress by withdrawing and going to bed, engaging in creative projects like printing and bookbinding, and planning future activities like workshops. They also engage in social activities, such as supporting friends and participating in online discussions.",
    "situation": "Received no response to an email from a person they're interested in dating.",
    "auto_thought": "He hasn't replied because he's not interested in me; maybe it's all over between us.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "disappointed"
    ],
    "behavior": "Ruminating on the lack of response and assuming a negative outcome.",
    "cognitive_distortion": "Mind Reading, Catastrophizing, Overgeneralizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept and Identify the Thoughts: We will start by discussing your feelings about the recent lack of response from the person you are interested in. I will help you identify the automatic thoughts you're experiencing, particularly the assumption that their silence means they are not interested, which reflects a form of mind reading and overgeneralizing. 2. Explore the Evidence: We will engage in evidence-based questioning to assess the validity of your thoughts. I will ask questions such as, 'What evidence do you have that they are not interested?' and 'Could there be other reasons for their lack of response that do not relate to you personally?' 3. Challenge the Assumptions: We will work together to challenge the negative assumptions by listing any potential alternative explanations for their behavior, such as being busy or having technical issues. I will encourage you to reflect on instances where similar situations did not lead to negative outcomes. 4. Examine Past Experiences: We will also consider your past experiences and successes in relationships. I will prompt you to think about times when you assumed the worst but found out the reality was different. 5. Reassess the Thoughts: After gathering evidence, we will reassess the initial automatic thought about their lack of interest and see if it holds true or if there are more balanced perspectives to consider. 6. Create a Balanced Thought: Together, we will formulate a more balanced thought that reflects the new evidence we’ve gathered, such as: 'Just because I haven't received a response doesn't mean they are not interested; there could be many reasons for their silence.' 7. Link to Behavior: Finally, I will encourage you to practice this questioning technique whenever you find yourself making assumptions about what others think or feel, especially when faced with uncertainty. By doing this, we can help reduce your feelings of sadness and disappointment and foster a more resilient perspective.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Interrupting",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Ambivalent",
    "resistance_internal_monologue": "I really want to talk about what I’m feeling, but I’m just not sure if it’s worth bringing up.",
    "resistance_rationale": "The client exhibits signs of ambivalence about discussing their feelings, often interrupting the flow of conversation to redirect focus away from painful topics. This reflects a mix of resistance and a desire to engage in therapy, indicating an intermediate level of resistance."
  },
  {
    "name": "Hannah",
    "id": "48-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has been married to Ivan for three years and they have been together for about seven years. Past events of extreme stress have occurred during finals week in her academic life, and she has experienced difficulties with Ivan around their wedding preparations due to his lack of participation and support. She has recently been dealing with intense financial pressures, which are exacerbated by Ivan's part-time work status and the added costs of their individual and couples therapy sessions, as well as her dental treatments.",
    "helpless_belief": [
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I am responsible for solving others' problems, I must be in control to ensure stability, My needs should come second to others' needs.",
    "intermediate_belief_depression": "If I criticize Ivan, I'm attacking him and shutting him down, If I don't confront issues, Ivan will continue avoiding responsibility, If I turn my negativity inwards, I maintain control and responsibility.",
    "coping_strategies": "Journaling to process feelings and document patterns, Attempting to manage the household and Ivan's issues independently, Seeking therapy to understand and manage her own thoughts and feelings.",
    "situation": "During the instances where Ivan neglects his responsibilities, such as not contributing to household expenses or procrastinating on important tasks like his insurance reimbursement.",
    "auto_thought": "Ivan doesn't care enough to contribute or he doesn't want to take care of our needs.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "angry, mad, irritated, annoyed",
      "hurt"
    ],
    "behavior": "Takes on responsibility for Ivan's tasks, feels overwhelming pressure to manage the household on her own.",
    "cognitive_distortion": "Personalizing, Blaming, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce Evidence-Based Questioning: Begin the session by discussing the client's feelings of frustration and sadness regarding Ivan's lack of responsibility. Explain how Evidence-Based Questioning can help her challenge the automatic thoughts she has about Ivan's behavior and her own role in the situation.\n2. Identify Automatic Thoughts: Ask the client to articulate her automatic thoughts, especially the belief that 'Ivan doesn't care enough to contribute.' Collect specific examples of situations where she felt this way.\n3. Gather Evidence: Encourage the client to consider the evidence for and against her automatic thought. Pose questions such as: 'What do you know about Ivan's feelings towards household responsibilities?' and 'Are there times when he has shown care or support?'\n4. Challenge the Thoughts: Help the client examine the quality of the evidence. Ask her to consider alternative explanations for Ivan's behavior, such as stress or personal challenges he might be facing that she may not be aware of.\n5. Reframe Negative Thoughts: Work collaboratively to develop a more balanced thought. For example, instead of thinking 'Ivan doesn't care,' she might reframe it to 'Ivan may be struggling with his own issues that affect his ability to contribute.'\n6. Practice Mindfulness: Introduce mindfulness techniques to help the client manage her emotions when she feels overwhelmed. This can include deep breathing or grounding exercises when she notices her thoughts turning negative.\n7. Set Goals: Conclude the session by helping the client set specific, achievable goals for addressing responsibilities with Ivan, such as discussing her feelings openly with him or setting up a budget plan together. Encourage her to express her needs clearly without blaming.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Hurt",
    "resistance_internal_monologue": "I feel so overwhelmed and alone. I don’t think sharing this will help. What’s the point?",
    "resistance_rationale": "The client exhibits signs of emotional withdrawal when discussing sensitive topics related to her responsibilities and feelings of being unsupported. Her history of feeling unlovable and her beliefs about needing to keep control likely contribute to this withdrawal, leading to ambivalence about engaging in therapy fully."
  },
  {
    "name": "Owen",
    "id": "49-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history that involves complex and strained family relationships. The client's father is described as making everyone around him miserable and has always been unhappy with his life. The client's grandmother (mother's mother) also had a similarly negative impact on the family, particularly on the client's mother, which has influenced the client's perception of familial relationships.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I must always be prepared for the worst-case scenario; I am responsible for fulfilling others' expectations and wishes even if it's difficult.",
    "intermediate_belief_depression": "My worries are overwhelming and I am unable to find solutions; my thoughts are uncontrollable and lean towards the morbid.",
    "coping_strategies": "The client engages in anticipatory planning for worst-case scenarios, exhibiting anxiety about future events that may or may not happen. Though possibly initially intended to be productive, this strategy seems to result in increased anxiety and guilt. The client also exhibits avoidance by delaying to look for consulates or make travel plans, despite acknowledging these tasks as necessary.",
    "situation": "Reflecting on feelings about the eventual passing of the client's father and grandmother.",
    "auto_thought": "It will be a relief when he finally does die; similar feelings of relief when grandmother passed away.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "guilty"
    ],
    "behavior": "Feeling guilty about having thoughts of relief concerning close family members' deaths and avoiding discussing these thoughts freely due to fear of judgment.",
    "cognitive_distortion": "Emotional Reasoning, Catastrophizing, Should Statements",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept and Identify the Target: Begin by discussing the client's feelings about the eventual passing of their father and grandmother. We'll identify the emotional reasoning at play, particularly the belief that relief in their passing means something negative about the client.\n2. Identify Catastrophic Thoughts: We'll list the specific catastrophic thoughts that arise when contemplating these deaths, such as fears of guilt and judgment from others.\n3. Challenge Catastrophic Thoughts: Discuss the validity of these thoughts. Ask questions like: \"What evidence do you have that feeling relief is wrong?\" and \"How can you hold both relief and sadness at the same time?\"\n4. Reality Testing: Explore scenarios around the passing of both family members. Discuss the outcomes that might occur and the likelihood of each happening. This will help the client see that not all thoughts lead to dire consequences.\n5. Reframe the Thoughts: Work with the client to create a more balanced perspective on their feelings. For example, instead of thinking, \"I shouldn't feel relief,\" reframe it to, \"It's natural to have mixed emotions about death. Feeling relief doesn't mean I don't care.\"\n6. Develop Coping Strategies: Equip the client with tools to handle guilt and anxiety when these feelings arise, such as journaling about their thoughts or speaking to a trusted friend.\n7. Practice and Link to Behavior: Encourage the client to practice reframing these thoughts in real-time and to discuss their feelings more openly with supportive family members. Set a goal for them to share these thoughts in a safe environment to reduce feelings of isolation.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Sidetracking",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Pessimistic",
    "resistance_internal_monologue": "I get that we need to talk about feelings, but can we just focus on something else? It's hard to deal with this right now.",
    "resistance_rationale": "The client exhibits a tendency to avoid discussing challenging emotions surrounding family relationships and their feelings about impending loss. Their coping strategy of anticipatory planning suggests a desire to sidestep uncomfortable topics, indicating ambivalence towards engaging directly with their emotions. This resistance is strong enough to disrupt the flow of therapy, but the client still shows some willingness to engage, reflected in the intermediate level."
  },
  {
    "name": "Lily",
    "id": "50-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client describes a significant history with an individual named Ethan, with whom they have had a friendship spanning 14 years, since high school. This relationship includes periods where they supported each other through personal crises, such as the client's experience with an abusive ex-boyfriend, and professional collaborations at startups. The client learned through friends that Ethan has been involved in a serious situation, including abusive behavior towards his girlfriend, which has greatly distressed the client.",
    "helpless_belief": [
      "I am helpless.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If I can't help someone, it means I've failed them. People who I get close to will end up hurting me or others.",
    "intermediate_belief_depression": "When I'm unable to help a friend or resolve a situation, it's because I'm inadequate. If someone I'm close to does something terrible, it reflects my poor judgment in people.",
    "coping_strategies": "Seeking support from friends, organizing group meetings for intervention, compiling spreadsheets of information and resources, excessive drinking, engaging in casual sex, and making effort to find Ethan a spot in rehab.",
    "situation": "Ethan's increasingly erratic behavior and drug use at a party they both attended.",
    "auto_thought": "Ethan is completely out of control. I feel responsible and need to find a way to fix this.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Feeling overwhelmed and engaging in self-blaming thinking, reacting with excessive drinking and impulsive decisions.",
    "cognitive_distortion": "Personalizing, Should Statements, Overgeneralizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session Focus: We'll start by discussing your feelings about Ethan's behavior at the party and how it has impacted you. I'll explain the purpose of using Evidence-Based Questioning to help you challenge your self-blame and thoughts of inadequacy.\n2. Identify Automatic Thoughts: I'll ask you to articulate specific thoughts you had during and after the incident, such as 'I feel responsible and need to find a way to fix this.' We'll write these down for clarity.\n3. Challenge the Thoughts: Using Evidence-Based Questioning, we will examine the validity of these thoughts. I'll guide you with questions like: 'What evidence do you have that you are responsible for Ethan's actions?' and 'Have there been times when you've helped others without it being solely your responsibility?' \n4. Explore Alternative Explanations: We'll discuss alternative interpretations of the situation. For example, 'Could it be possible that Ethan's choices are his own and not a reflection of your worth or judgment?'\n5. Reframe the Thoughts: Based on our discussion, we will work together to reframe your thoughts. Instead of 'I need to fix this,' we might say 'I can support Ethan, but I am not responsible for his choices.' \n6. Practice Self-Compassion: I'll introduce self-compassion exercises, encouraging you to acknowledge your feelings without judgment and recognize that it's okay not to have control over others' actions. \n7. Develop a Support Plan: Finally, we will create a plan for how you can take care of yourself while supporting Ethan, including setting boundaries and seeking help for yourself if needed. We'll wrap up by discussing strategies to implement these insights moving forward.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Intermediate",
    "resistance_emotion": "Anxious",
    "resistance_internal_monologue": "I want to talk about Ethan and how I feel, but I just don't know where to start or if I should even bring it up.",
    "resistance_rationale": "The client exhibits significant anxiety related to their sense of helplessness and feelings of inadequacy in relation to Ethan's situation. Their coping strategies include excessive drinking and impulsive decisions, suggesting they may withdraw emotionally in therapy to avoid confronting these distressing feelings. The intermediate level of resistance reflects their ambivalence; they desire help but struggle to engage fully due to their overwhelming emotions."
  }
]