[
  {
    "name": "Alex",
    "id": "1-3",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has a history of substance abuse and has been through rehab to overcome it. He has had issues with his family, particularly with his mother, where he has felt rejected and emotionally neglected. He has struggled with obesity since childhood, which has affected his self-esteem and body image. He also has a history of being victimized and bullied due to his weight.",
    "helpless_belief": [
      "I am a victim.",
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "Helpless: I'm just not very good at handling stress and I have poor self-control, which is why I need to not put myself in stressful situations. ",
    "intermediate_belief_depression": "Helpless: There's nothing I can do to change my situation, bad things just happen to me. ",
    "coping_strategies": "The patient turns to substances as a coping strategy to escape his feelings. The patient has adopted avoidance as a coping strategy by distancing himself from his family to reduce exposure to negativity and conflict. He also uses yelling and stepping away from situations to manage his low self esteem. ",
    "situation": "Was going to pick up girlfriend after work but it started raining just as he was about to walk out.",
    "auto_thought": "Why does this always happen to me? I'm a victim of bad luck.",
    "emotion": [
      "angry, mad, irritated, annoyed",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Curses at the rain. Gave an excuse to girlfriend for not picking her up. Went back inside and had a beer. Calmed down and felt remorseful.",
    "cognitive_distortion": "Fortune Telling, Catastrophizing",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept: We'll start by discussing the recent incident with the rain and how it led to feelings of anger and helplessness. I will explain the decatastrophizing technique, emphasizing how we can challenge the automatic thought of 'Why does this always happen to me?' and the belief that bad luck is a constant in your life.\n2. Identify Catastrophic Thoughts: Together, we will pinpoint specific catastrophic thoughts related to this situation and your general outlook on life. I'll ask you to articulate what you believe will happen as a result of these events and to explore the worst-case scenarios that come to mind.\n3. Reality Check: After identifying these thoughts, I will prompt you to evaluate their likelihood. We'll discuss how frequently these events actually occur and whether they are truly indicative of a pattern in your life. Questions might include: 'Have you had other experiences where things turned out better than expected?' or 'What evidence do you have that these events define your overall luck or life?'\n4. Generate Alternative Outcomes: I will encourage you to think of more balanced and realistic outcomes instead of extreme scenarios. We'll brainstorm alternative interpretations of the situation that allow for the possibility of positive outcomes or at least neutral events. For example, 'It was an inconvenience, but I can reschedule to see my girlfriend later.'\n5. Reframe the Thought: Based on our discussion, we will work on reframing your initial thought. Instead of 'I'm a victim of bad luck,' we might rephrase it to 'Sometimes things don't go as planned, but I can adapt and find solutions.'\n6. Develop Coping Strategies: We will explore healthier coping strategies to manage stress when unexpected events occur. This can include practicing mindfulness, engaging in physical activity, or reaching out to friends for support rather than turning to substances.\n7. Practice and Follow-Up: I'll encourage you to practice identifying and challenging catastrophic thoughts in daily situations. We will discuss your experiences in our next session to reinforce this skill and address any ongoing challenges.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I don’t see how this is going to help me. It feels like nothing ever changes, and I’m just wasting my time here.",
    "resistance_rationale": "The client has expressed a strong belief in their helplessness and victimization, leading to anger and frustration with the therapeutic process. Their history of feeling rejected and their substance use as a coping mechanism suggest a deep-seated skepticism toward treatment efficacy, indicating a confrontational stance against the therapy model."
  },
  {
    "name": "Caleb",
    "id": "3-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient is a PhD candidate doing scientific research, with references to a study involving sequencing and a 'bright and shiny stone scientist' named Kelly. The patient appears to struggle with finishing projects, feeling as if the last bit of work is as significant as the entire project. The patient also mentions working on a project with a senior scientist who has struggled to gain recognition in his career.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am trapped.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "If I don't complete my work perfectly or find something significant, I am not successful or competent. ",
    "intermediate_belief_depression": "When I'm struggling with my work or feeling disconnected, it's because I'm not capable or deserving of success. ",
    "coping_strategies": "The patient engages in activities like painting and meditating, which may serve as a healthy outlet for stress. They also seem to avoid intense work hours and choose to work when they feel like it, which could be an attempt to manage work-related stress. ",
    "situation": "Working on a PhD project and feeling like it's not progressing as it should.",
    "auto_thought": "I should have finished by now. The last bit of work feels overwhelming and impossible to complete.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Avoids working consistent hours, gets distracted by other activities like painting.",
    "cognitive_distortion": "Should Statements, Catastrophizing, All-or-Nothing Thinking",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept and Identify the Target: We will begin by discussing your feelings of overwhelm regarding your PhD project and the 'should' statements that are contributing to your anxiety. We'll identify how these thoughts lead to catastrophic conclusions about your abilities and worth as a candidate.\n2. Explore the Catastrophic Thoughts: I will ask you to describe the worst-case scenarios you envision if you do not meet your self-imposed deadlines or if your project does not progress as you expect. We will write these down to make them more tangible.\n3. Evaluate the Likelihood: Together, we will assess the reality of these catastrophic outcomes. I will guide you through questions like: 'What evidence do you have that these outcomes will actually happen?' and 'Have you faced difficulties before? What happened then?'.\n4. Challenge the Thoughts: We will work to challenge the validity of these catastrophic thoughts by looking for more balanced, realistic perspectives. I'll prompt you with questions such as 'What would you tell a friend in your situation?' and 'What are some potential outcomes that are less extreme than your worst-case scenario?'.\n5. Create a More Balanced Perspective: Once we have explored these thoughts, I will help you formulate a new, more balanced statement to replace the catastrophic thoughts. For example, instead of thinking 'I should have finished by now; I'm a failure,' we can reframe it as 'I'm working hard on a complex project, and it's normal for it to take time.'\n6. Take Action Steps: We will discuss manageable steps you can take to move forward with your project. This might include setting smaller, achievable goals or scheduling regular work sessions to establish a routine without overwhelming yourself.\n7. Practice and Reinforcement: Finally, I will encourage you to practice recognizing and challenging any 'should' statements or catastrophic thoughts as they arise. We can also set a plan for you to check in on your progress and feelings during our next session, reinforcing the skills you've learned.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Advanced",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I really should be making progress, but I just feel like I can't do it. What's the point of even trying to explain how overwhelmed I feel?",
    "resistance_rationale": "The client's history of feeling overwhelmed by their work and their beliefs about incompetence and failure indicate a strong sense of withdrawal during therapy. They may shut down emotionally when discussing their struggles, reflecting an entrenched pattern of disengagement that aligns with advanced resistance."
  },
  {
    "name": "Chris",
    "id": "5-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has a history of working overseas and creating a website related to that work. He express a pattern of getting excited about new ideas but then becoming conflicted, losing confidence, and abandoning projects when encountering challenges. Additionally, the patient is dealing with issues related to his father, including writing a 'living letter' as part of his process of learning to forgive him.",
    "helpless_belief": [],
    "unlovable_belief": [
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "If I don't succeed in my projects or if people don't acknowledge my work, then it means I am not valued or desired. I need to be constantly validated by others to feel worthwhile.",
    "intermediate_belief_depression": "When I face challenges or feel stuck, it means I am failing and this confirms that I am undesirable or not good enough. Others' approval is the only measure of my success and worth.",
    "coping_strategies": "The patient uses fantasy as a coping mechanism to escape feelings of worthlessness and to seek a sense of acceptance and value. They also use social media for validation and rely on external feedback to feel appreciated. (all avoidance based strategies)",
    "situation": "Working on personal project of building a website.",
    "auto_thought": "I'm stuck with this project, maybe it's not worth continuing. I always get excited but then lose confidence.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Avoids continuing the project, engages in fantasy or seeks validation through social media.",
    "cognitive_distortion": "Overgeneralizing, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session: We will start by discussing your feelings about the personal project of building a website and what specific thoughts arise when you feel stuck. 2. Identify Automatic Thoughts: Together, we will identify the automatic thought of 'I'm stuck with this project, maybe it's not worth continuing' and how it relates to your beliefs about worthiness and validation. 3. Challenge the Thought: I will guide you through Evidence-Based Questioning by asking you to provide evidence that supports and contradicts this thought. Questions may include: 'What evidence do you have that this project is worthless?' and 'What past successes can you recall that contradict this thought?' 4. Explore Alternatives: We will brainstorm alternative explanations for your feelings of being stuck and your worth. For example, 'Could this feeling of being stuck be temporary or related to external factors?' 5. Reframe the Thought: Based on the evidence gathered, we will create a more balanced thought, such as 'I am facing challenges, but that does not define my worth or the value of my project.' 6. Develop Action Steps: To counter avoidance, we will outline small, manageable steps to continue the project, focusing on progress rather than perfection. 7. Conclude with Reflection: Finally, we will reflect on how challenging these thoughts felt during the session and discuss strategies to continue practicing evidence-based questioning outside of our meetings.",
    "resistance_type": "Direct",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I feel like you just don’t understand how hard it is for me to keep going with this project. Why can’t you see that your approach isn’t helping?",
    "resistance_rationale": "The client's history of losing confidence and abandoning projects, coupled with a strong reliance on external validation, suggests they may feel misunderstood and frustrated with the therapist's approach. Their entrenched beliefs about worthlessness and the need for approval could manifest as criticism towards the therapist when they perceive a lack of understanding or support."
  },
  {
    "name": "Bryce",
    "id": "7-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has a history of working long hours, similar to past experiences while touring, indicating a history of demanding work environments. The patient has also been dealing with unresolved issues with his father, including past abuse and a recent exchange of letters addressing this painful history. The patient's father's response to the letter appears to have been a significant event for the patient, potentially contributing to his current mental state.",
    "helpless_belief": [],
    "unlovable_belief": [],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "The patient seems to hold the belief that work and productivity are essential to his self-worth and that idle time or personal development is wasted time. He also appears to believe that completing tasks and being acknowledged for his work is important for his value and self-esteem.",
    "intermediate_belief_depression": "During periods of depression, the patient may believe that he is not making progress in life and that his efforts are meaningless. This could lead to a lack of motivation to engage in activities and to complete tasks, further reinforcing feelings of inadequacy and worthless.",
    "coping_strategies": "The patient uses work as a coping strategy to feel productive and to reduce idle time, which he associates with negative feelings. He also use avoidance strategies when he perceives himself not productive and worthless, such as scrolling on social media. ",
    "situation": "Reflecting on the use of idle time and personal development.",
    "auto_thought": "I should be more productive with my time. I'm not sure if I'm making the best use of it. If I don't use my time wisely I am a waste.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Struggles with choosing activities and often defaults to less fulfilling ones, leading to feelings of time wasted.",
    "cognitive_distortion": "Should Statements, Overgeneralizing, Disqualifying the Positive",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept and Identify the Target: We will begin by discussing your feelings about using your time effectively and the judgments you have made about your productivity. We'll identify the 'should' statements that contribute to feelings of worthlessness and how they overgeneralize your self-worth based on productivity. 2. Gather Evidence: I will guide you to list instances where you have used your time effectively, regardless of the activity's nature. This will help challenge the belief that you are worthless if not productive. 3. Question the Evidence: I will ask you to consider questions like: 'What evidence do you have that not being productive makes you worthless?' and 'Are there times you have felt fulfilled without being productive in a traditional sense?' 4. Explore Alternatives: Together, we will explore alternative perspectives on time and worth. We will discuss how personal development and relaxation can also be valuable and fulfilling activities. 5. Create a Balanced Thought: Based on the evidence gathered, we will work together to create a balanced thought to replace the 'should' statement. This could be something like: 'Taking time for myself is valuable, and I am not defined solely by my productivity.' 6. Practice and Implement: Your task for the week will be to notice when you use 'should' statements and to practice reframing them using the balanced thought we developed. We will discuss your experiences in our next session and adjust our approach as needed.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I just don't see how sitting around talking about my feelings is going to change anything. It feels pointless.",
    "resistance_rationale": "The client's belief that productivity is essential to self-worth leads to frustration with therapeutic approaches that emphasize reflection rather than action. This is compounded by a history of unresolved issues with his father, which may contribute to his resistance to introspective methods that he views as unproductive."
  },
  {
    "name": "Fiona",
    "id": "9-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "ingratiating"
    ],
    "history": "The patient has a long-standing relationship with a friend named Jersey, who has undergone multiple surgeries due to her disabilities, including a below-the-knee amputation and knee replacement. The patient has been a supportive figure during Jersey's medical procedures and recovery but currently feels overwhelmed with her own life stresses. The patient also experiences conflict with her roommate, Ashby, regarding household issues.",
    "helpless_belief": [
      "I am incompetent."
    ],
    "unlovable_belief": [
      "I am undesirable, unwanted.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [
      "I am immoral."
    ],
    "intermediate_belief": "I should always try to help others and prioritize others' needs over myself.",
    "intermediate_belief_depression": "My efforts to help others are not enough, and I cannot manage my own life effectively when my friends are in trouble.",
    "coping_strategies": "The patient copes by trying to provide practical support, like cooking meals for friends in need, and by attempting to manage situations, like resolving cable service issues.",
    "situation": "Thinking about Jersey's surgery and recovery, but cannot offer help due to occupation with other things.",
    "auto_thought": "I'm really worried about her and feel bad because I can't be there for her as much as I want to.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy",
      "guilty"
    ],
    "behavior": "Expresses concern, becomes tense and irritable, shows signs of avoidance, and struggles to sleep.",
    "cognitive_distortion": "Should Statements, Emotional Reasoning, Overgeneralizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin the session by discussing the client's feelings of guilt and anxiety regarding Jersey's surgery. Explain how these feelings may be influenced by the 'should statements' about helping others. 2. Identify Cognitive Distortions: Help the client recognize specific thoughts like 'I should always be there for others' and 'If I'm not helping, I'm failing.' 3. Gather Evidence: Ask the client to reflect on past situations where they couldn't help but still maintained their relationships. Questions may include: 'What evidence do you have that your friends value you even when you can't be there?' and 'Have there been times when you've prioritized your needs and still felt connected to others?' 4. Challenge the Beliefs: Encourage the client to consider alternative perspectives, such as 'Is it realistic to always prioritize others over yourself?' and 'What would you tell a friend in your situation?' 5. Reframe the Thoughts: Help the client reframe their thoughts to reflect a more balanced view. For example, change 'I should be helping more' to 'It's okay to take care of myself while supporting my friends when I can.' 6. Develop Self-Compassion: Discuss the importance of self-compassion and how it can coexist with caring for others. Encourage the client to acknowledge their own needs. 7. Plan for Action: Lastly, collaboratively create a plan for how the client can offer support to Jersey in a way that feels manageable, while also allowing time for self-care, reinforcing that it's okay to set boundaries.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Advanced",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I just feel like I can't handle all of this right now—maybe I should just keep quiet.",
    "resistance_rationale": "The client's overwhelming feelings of anxiety and sadness, especially regarding their friend Jersey, lead to a tendency to withdraw emotionally in sessions. This withdrawal reflects their entrenched feelings of helplessness and inadequacy, indicating a strong and persistent resistance to engaging fully in therapy."
  },
  {
    "name": "Grace",
    "id": "10-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has recently gone through a divorce and is dealing with the associated challenges such as financial struggles, adjusting to single life, and co-parenting. The patient has also experienced a breakdown of several friendships due to the divorce and has a complicated relationship with her parents, which adds to the stress.",
    "helpless_belief": [
      "I am helpless.",
      "I am defective."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If people know the real me or the details of my situation, they will not want to be my friend or support me. It's important to maintain a good image to be accepted.",
    "intermediate_belief_depression": "People will eventually find out the real me and the details of my situation. I will get abandoned by everybody. ",
    "coping_strategies": "The patient tries to explain things to a few friends. The patient also attempts strategies like keeping busy and avoidance.",
    "situation": "Experiencing the breakdown of friendships following the divorce.",
    "auto_thought": "These friends don't want to be around me. Everybody just thinks I'm a bad person, and maybe that's true.",
    "emotion": [
      "angry, mad, irritated, annoyed",
      "hurt"
    ],
    "behavior": "Withdraws from social gatherings, keep ruminating the divorce and the past.",
    "cognitive_distortion": "Mind Reading, Labeling, Fortune Telling",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Technique: We will begin by discussing the impact of your recent divorce and how it has affected your friendships. I will introduce the Evidence-Based Questioning technique to help challenge your negative thoughts about what others think of you.\n2. Identify Negative Thoughts: We will explore your automatic thoughts, particularly the beliefs that 'These friends don't want to be around me' and 'Everybody just thinks I'm a bad person.'\n3. Generate Questions: I will help you formulate specific questions that challenge these beliefs, such as 'What evidence do I have that my friends think I'm a bad person?' and 'Have any friends reached out to me since the divorce?'\n4. Gather Evidence: We will list down any evidence that contradicts your negative beliefs. This could include past positive interactions with friends or instances where friends have shown support.\n5. Analyze the Evidence: We will critically evaluate the evidence gathered and how it relates to your automatic thoughts. I will ask you to consider if there are alternative explanations for your friends' behavior, such as their own struggles or busy lives.\n6. Reframe the Thoughts: After analyzing the evidence, we will work together to create a more balanced thought. For example, instead of thinking 'Nobody wants to be around me,' we might revise it to 'Some friends may be struggling, and it doesn’t reflect my worth as a person.'\n7. Practice and Homework: I will encourage you to practice this questioning technique throughout the week when negative thoughts arise. Your task will be to write down a negative thought and apply Evidence-Based Questioning to it, preparing to discuss your reflections in our next session.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I just don't see how any of this is going to help me. You talk about changing my thoughts, but it feels like all I'm doing is pretending things are okay when they're not.",
    "resistance_rationale": "The client's recent experiences with divorce and the associated feelings of abandonment and worthlessness contribute to a strong resistance to treatment. They express anger and frustration towards the idea that cognitive behavioral therapy can address their deep-seated fears of being unlovable and rejected. This reflects an entrenched belief that undermines their willingness to engage with therapy methods, positioning them firmly at an advanced level of resistance."
  },
  {
    "name": "Jay",
    "id": "12-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "Jay is a PhD student in a science field. Outside of work, Jay is deeply involved in music, having led a college band and now participates in a jazz group. He was recently offered a leadership position in the jazz group, but he declined because he was worried about not being able to manage the increased responsibility in addition to his mental health struggles and PhD work. The patient is struggling with his scientific work environment, feeling disconnected from his colleagues due to differing values and work habits. There seems to be a past experience of feeling connected and appreciated, which is now missing in his current environment.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "If I am not able to excel in everything I do, then I am failing. I need to be recognized and appreciated by others to feel successful.",
    "intermediate_belief_depression": "When I'm not engaged in music or my work in a meaningful way, or when I'm not recognized for my efforts, I feel useless and like a failure. I believe my contributions are not valuable.",
    "coping_strategies": "Engaging in music and performance. The patient also seems to show avoidance of certain responsibilities and opportunities that may lead to additional stress.",
    "situation": "Getting stuck during jazz rehearsals with other performers and need to repeat many times.",
    "auto_thought": "I don't belong in a jazz improvisation context, my skills are not good enough, I'm still stuck here after many times' tries I'm just not good at this. I'm holding the group back.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "disappointed",
      "jealous, envious"
    ],
    "behavior": "Avoids practicing and fully committing to music, expresses doubt about his abilities.",
    "cognitive_distortion": "Overgeneralizing, Catastrophizing, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin by explaining the cognitive distortions identified in Jay's thoughts, particularly how he's overgeneralizing his experiences in jazz and catastrophizing the implications of his perceived inadequacy. 2. Identify Specific Thoughts: Ask Jay to articulate specific thoughts that arise when he feels he doesn't belong in the jazz context. 3. Gather Evidence: Use evidence-based questioning to challenge these thoughts. Questions may include: 'What evidence do you have that supports the belief you are holding the group back?' and 'Can you recall instances where your contributions were valued in jazz or other music contexts?' 4. Explore Alternatives: Encourage Jay to consider alternative explanations for his feelings. For example, ask, 'Is it possible that others in the group also struggle at times?' 5. Reframe the Narrative: Help Jay to create a new, balanced narrative regarding his skills and contributions in jazz. This could be something like: 'I am still developing as a musician, and it's okay to not excel at all times.' 6. Practice Thought Monitoring: Assign Jay the task of monitoring his thoughts during rehearsals and writing them down, particularly when he feels inadequate. 7. Review Progress: In the next session, review the thoughts Jay noted and discuss any shifts in his perspective or feelings. This will reinforce the practice of challenging negative thoughts.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Advanced",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I'm just not good enough to be here, and it's exhausting to keep trying when I feel this way.",
    "resistance_rationale": "Jay's history of feeling disconnected and his beliefs about needing recognition reflect a strong internal struggle with feelings of inadequacy and failure. His avoidance of practicing and commitment to music indicates entrenched resistance patterns, showing that he is not just ambivalent but increasingly withdrawn from engaging in therapy, especially when confronted with challenging feelings."
  },
  {
    "name": "Linda",
    "id": "14-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded"
    ],
    "history": "The client has had significant life events that have impacted her current state, including losing her retirement funds on some poor financial decisions, which has led to financial concerns and the need to continue working potentially until an old age, find a new job that pays more, and/or find other ways to make money. Additionally, there are underlying tensions and unresolved feelings related to their family, particularly her mother and father, because now she is relying on them more for financial help.",
    "helpless_belief": [
      "I am helpless.",
      "I am incompetent.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I need to rely on family and friends to support my life. I am not able to handle anything out of my expectation by myself. My family and friends are supposed to always support me.",
    "intermediate_belief_depression": "I just cannot support myself. I am a failure and cannot even be independent. My future is hopeless. I cannot be trusted to take care of myself.",
    "coping_strategies": "Questioning the self; becoming easily defensive when feeling challenged or criticised for taking care of self; Show avoidance of making decisions or taking challenges in life, which in fact further increases anxious feelings.",
    "situation": "Reflecting on the financial loss due to poor financial decisions.",
    "auto_thought": "It's unfair that I can't retire. Why did this happened to me? I probably cannot support myself, I don't know what to do. Why won't my family help me more?",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "angry, mad, irritated, annoyed"
    ],
    "behavior": "Expressing anger toward self, ruminating and regretting past decisions. Also angry at the family for not helping her more.",
    "cognitive_distortion": "Fortune Telling, Catastrophizing, Blaming",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session: Begin by acknowledging the client's feelings regarding the financial loss and the emotions tied to it, including anger and anxiety. Frame the session around the concept of questioning negative assumptions and beliefs. 2. Identify Negative Thoughts: Ask the client to articulate specific thoughts that arise when reflecting on the financial loss, such as 'I probably cannot support myself' and 'Why won't my family help me more?' 3. Challenge the Thoughts: Introduce Evidence-Based Questioning. For each negative thought, prompt the client with questions to explore the validity of these beliefs. For example, 'What evidence do you have that you cannot support yourself?' or 'Have there been times when you've successfully managed your finances or supported yourself in the past?' 4. Gather Evidence: Help the client list examples of when they have been independent or capable. Discuss any past successes, skills, or resources they possess that contradict the negative beliefs. 5. Analyze the Evidence: Guide the client to reflect on the evidence gathered and ask them to consider what a trusted friend would say about their situation. Encourage them to think about how they might be overly harsh in their self-assessment. 6. Reframe Negative Thoughts: Work together to create balanced thoughts, such as 'I have faced challenges before and found ways to manage' or 'It's okay to ask for support from my family without feeling like a failure.' 7. Develop Action Steps: Conclude by discussing practical steps the client can take to regain a sense of control, like improving financial literacy or exploring new job opportunities. Encourage the client to practice using evidence-based questioning in their daily life to challenge any future negative thoughts.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I just don’t see how any of this therapy stuff is going to help me. I feel like I’m being asked to change everything when I can barely handle my life as it is.",
    "resistance_rationale": "The client exhibits significant frustration and anger towards her situation and the perception of needing to rely on family and friends while feeling incompetent. This aligns with a strong resistance to treatment as she struggles with feelings of hopelessness and self-doubt. Her history of poor decision-making adds to her defensiveness and reluctance to accept the therapeutic process, suggesting a deeply entrenched resistance profile."
  },
  {
    "name": "Mason",
    "id": "16-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has spent eleven months in Europe working on a project, which included creating a website and conducting interviews. This period appears important to the client and he's eager to show something for his efforts. The client has suffered from procrastination and anxiety in the past. He has managed to build structure into his life by implementing various strategies learned from a course and using reminders.",
    "helpless_belief": [
      "I am incompetent.",
      "I am out of control.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "If I'm not productive or not doing anything significant, I'm wasting my life. I must keep up with the schedule. If I stay idle, then I'm failing.",
    "intermediate_belief_depression": "I just keep procrastinating and can never catch up with schedule. Failure is imminent. My project is going to fail due to my incompetency. ",
    "coping_strategies": "The client uses structured daily routines with set times for reading, playing guitar, and going to the gym. He also sets reminders for tasks and have been trying to be present in the moment to reduce idle time, which he associates with being unproductive.",
    "situation": "Client is working on a project that is due soon. The project has had increased visibility due to a recent sociopolitical events related to the project's content.",
    "auto_thought": "I need to finish this asap. I have not finished the work that I need to put online, I'm behind schedule. I will fail on this project.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Rushes to work on the project, foregoes sleep, endures stress and extreme anxiety.",
    "cognitive_distortion": "Catastrophizing, Should Statements",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "1. Introduce the Concept of Decatastrophizing: We will start by discussing your feelings of anxiety and pressure regarding the project deadline. I will explain the concept of catastrophizing and how it may be influencing your thoughts about your work and its outcome. \n2. Identify Catastrophic Thoughts: Together, we will identify specific catastrophic thoughts you have about the project (e.g., 'I will fail on this project'). We will write these down to visualize them. \n3. Challenge Catastrophic Thoughts: I will guide you through questioning these thoughts. We will ask: - What evidence do you have that supports this thought? - What evidence contradicts this thought? - What is the worst that could happen, and how would you cope with it? \n4. Reframe Thoughts: Based on our exploration, we will work together to create more balanced and realistic thoughts. For example, instead of 'I will fail on this project,' we might reframe it to 'I have faced challenges before and have made progress, and I can manage my workload.' \n5. Develop Coping Strategies: We will brainstorm coping strategies to manage your anxiety as you work on the project. This may include setting smaller, achievable goals and incorporating breaks into your routine to reduce stress. \n6. Practice Decatastrophizing: Your task will be to practice decatastrophizing during the week. Each time you notice catastrophic thoughts, I encourage you to apply the questions we’ve discussed. \n7. Review Progress: In our next session, we will review how using these techniques has affected your anxiety and project work. We will adjust our strategies as needed to ensure continuous progress.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I know you want me to focus on my thoughts, but I just feel like all this is pointless. I need to get things done, not sit around talking about my feelings.",
    "resistance_rationale": "The client's urgent need to complete his project and his feelings of incompetency indicate strong resistance to any approach perceived as unproductive. He demonstrates a consistent pattern of frustration with therapeutic interventions that do not align with his urgent goals, reflecting a well-articulated opposition to the therapy model."
  },
  {
    "name": "Sarah",
    "id": "17-3",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "guarded",
      "ingratiating"
    ],
    "history": "Sarah is in a significant relationship with her partner, Amelia, who has a rigorous schedule due to her clinical-based program, which keeps her busy and away from home for extended hours. Sarah often feels isolated during the week. Even though Sarah is incredibly busy, she feels like she has 'housewife'  duties and takes care of all household tasks. Although she resents it, she has not brought it up to her partner. She has a history of attachment issues, starting from her childhood, where separation from her parents caused her distress. These issues have continued into adulthood, where she has struggled with separation anxiety and strong attachments to people in various contexts, such as summer camp, study abroad programs, and volunteer positions.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am needy."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I need to be constantly engaged with people, otherwise I will be abandoned. I cannot live alone.",
    "intermediate_belief_depression": "People just don't care to stay in touch with me no matter how I try. Nobody loves me. I'm just a weak and needy person that cannot be independent.",
    "coping_strategies": "The client engages in various activities to cope with her feelings of loneliness and anxiety, such as running, cleaning, cooking, and sometimes picking Amelia up to spend more time with her. She experiences temporary relief from anxiety when in contact with Amelia. She keeps trying to stay connected with friends, but if they do not respond to her actively she will be more depressed and anxious.",
    "situation": "Keep trying to chat with a friend previously known at a summer camp, but that friend seems not interested and tend to get rid of her.",
    "auto_thought": "People keep getting rid of me. Nobody cares about me. I will be eventually alone.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "disappointed",
      "hurt"
    ],
    "behavior": "Crying and seeking emotional support from Amelia.",
    "cognitive_distortion": "Fortune Telling, Mind Reading, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept: Begin by explaining the concept of fortune telling and mind reading, emphasizing how these distortions lead to unnecessary anxiety about relationships. Discuss how emotional reasoning can impact her feelings of worthiness and connection.\n2. Identify Specific Thoughts: Ask Sarah to articulate specific thoughts she has regarding her friend’s behavior (e.g., 'People keep getting rid of me').\n3. Challenge These Thoughts: Use evidence-based questioning to probe these thoughts. Ask questions like: 'What evidence do you have that people do not care about you?' and 'Can you recall times when friends have reached out or shown they care?'\n4. Gather Evidence: Help Sarah compile a list of positive experiences and interactions that contradict her current beliefs. Encourage her to reflect on moments where she felt valued or loved by others.\n5. Reframe Negative Thoughts: Assist Sarah in reframing her auto-thoughts based on the evidence gathered. For example, she might replace 'Nobody cares about me' with 'Some people may not be available right now, but that doesn’t mean I am unloved.'\n6. Create a Balanced View: Encourage her to consider a more balanced and realistic perspective about her worth and the nature of her friendships. Discuss the difference between feeling lonely and being unlovable.\n7. Homework Assignment: Suggest Sarah keep a daily journal for a week to note instances where she feels supported or loved, as well as reflections on her interactions with friends, to reinforce the positive evidence of connection in her life.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Advanced",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I really want to connect, but I feel like no one truly understands what I'm going through. Maybe it's better if I just don't say anything.",
    "resistance_rationale": "Sarah's history of attachment issues and feelings of isolation indicate a strong tendency to withdraw when faced with emotional discomfort. Her beliefs about being unlovable and her experiences of abandonment contribute to her shutting down in therapy, reflecting advanced resistance to engagement."
  },
  {
    "name": "Rachel",
    "id": "19-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient, named Rachel, has a history of relationship problems, including with her current husband, Ivan, and work-related stress. She has demonstrated a pattern of self-critical thoughts, particularly around her value in relationships and her professional achievements. She also appears to feel a significant burden of responsibility, as shown in the dynamics with her sister, Emma, who has typically assumed a caring role for Rachel. Her father's successful career and work ethic have shaped her expectations and self-view, and she often feels Ivan doesn't work hard enough. She was also recently laid off and is having a hard time finding a new job.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "Being ambitious and successful in career is a crucial component of a fulfilling life. If one is not successful in career or not ambitious enough, he's a failure.",
    "intermediate_belief_depression": "My efforts towards job seeking are futile, I cannot be successful in my career, so I'm a failure. My marriage is also a failure, because my husband is not ambitious enough to make progress in his career as expected.",
    "coping_strategies": "The coping strategies Rachel mentions include volunteering for roles related to her field of interest, applying for jobs, seeking therapy, and possibly socializing with her sister. However, she also displays unhealthy coping mechanisms such as self-criticism and emotional reasoning.",
    "situation": "Thinking about her and her husband Ivan's careers.",
    "auto_thought": "I cannot finish college due to my incompetency, and need to rely on parents for a living. I'm so pathetic and a failure. My husband is also a failure.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy",
      "angry, mad, irritated, annoyed"
    ],
    "behavior": "Struggling with conflicting feelings about husband's job, questioning her own beliefs about success and fulfillment.",
    "cognitive_distortion": "All-or-Nothing Thinking, Emotional Reasoning, Labeling",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept and Identify the Target: We will start the session by discussing your feelings surrounding your career and your husband's situation. We'll identify the All-or-Nothing nature of your thoughts, particularly focusing on the beliefs that you and your husband are failures. \n2. Identify Specific Thoughts: I will ask you to share specific thoughts that lead you to feel incompetent and pathetic. For example, what thoughts run through your mind when you consider your educational and career aspirations?\n3. Challenge the Thoughts: We will utilize evidence-based questioning to examine the validity of these thoughts. I'll guide you with questions such as:\n   - What evidence do you have that supports the idea that you are incompetent?\n   - Can you think of instances where you have succeeded or made progress, even if it feels small?\n   - How do you define success, and does your definition allow for growth and learning?\n4. Explore Alternative Explanations: After evaluating the evidence, we will explore alternative explanations for your feelings. This includes discussing your husband's ambitions and your own career path without labeling them as failures. \n5. Reframe the Thoughts: Together, we will work on reframing the negative thoughts into more balanced perspectives. For instance, instead of labeling yourself as a failure, we might reframe it to acknowledge that while you are facing challenges, that does not define your entire worth or potential.\n6. Practice Self-Compassion: I will encourage you to practice self-compassion by recognizing that everyone experiences setbacks. We will discuss ways to be kinder to yourself when you face difficulties in your career and personal life.\n7. Link to Future Actions: Finally, we will create a plan for actionable steps you can take towards your goals, focusing on small, achievable tasks to build confidence and resilience. This could include setting realistic career goals, seeking additional support, or engaging in positive self-talk.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I just don't see how these exercises will really change anything for me. I feel like I'm stuck in this cycle, and no amount of thinking differently is going to help.",
    "resistance_rationale": "Rachel's history of feeling incompetent and her strong beliefs about success contribute to her advanced level of resistance. Her feelings of frustration reflect her deep-seated doubts about the effectiveness of therapy, particularly when it challenges her entrenched views on ambition and personal value."
  },
  {
    "name": "Talia",
    "id": "21-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has a significant history of family conflict, particularly with her father who was described as cruel, dismissive, and unsupportive. The patient's relationship with her father has deteriorated to the point of estrangement, and similar themes of familial conflict are reflected in her experiences with her partner's family. The patient reports feeling unsupported and mistreated by her partner's sister-in-law, Candace, which appears to be causing a significant amount of stress and frustration. The pressure to conform to the expectations of her partner's family and to tolerate Candace's behavior without recourse is reminiscent of her history with her own family and her inability to effectively confront or manage these familial relationships.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable.",
      "I am trapped."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I must maintain peace and accept family members as they are, even if they treat me poorly. If I have conflicts with family members, I cannot win them, and it will only make everybody abandon me, or make the whole family torn apart.",
    "intermediate_belief_depression": "If I stand up for myself, it will only make situations worse and I will be the one causing drama within the family. I'm powerless in this family and they will not support me. But I'm getting more and more upset by being offended by Candace. I don't know what to do. I'm just a weak person and trapped.",
    "coping_strategies": "Avoiding confrontation with family members, withdrawing from situations that may lead to conflict, considering reducing time spent with the family or specific family members, looking for support from friends.",
    "situation": "Considering how to handle Candace's rude behavior",
    "auto_thought": "If I confront Candace, it will make things worse, but if I don't, I'll continue to be treated poorly.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "sad, down, lonely, unhappy"
    ],
    "behavior": "Ruminates on past interactions with Candace; struggles with deciding to set boundaries.",
    "cognitive_distortion": "Catastrophizing, Mind Reading, Should Statements",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "1. Introduce the Concept of Decatastrophizing: Begin the session by discussing the recent situation involving Candace's behavior. Explain the concept of catastrophizing and how it influences her thoughts and feelings about confrontation. 2. Identify Catastrophic Thoughts: Ask the client to describe the worst outcomes she fears if she confronts Candace. Write these down to visualize the catastrophic scenarios. 3. Challenge the Catastrophic Thoughts: Encourage the client to evaluate the likelihood of these outcomes actually occurring. Ask questions such as: 'What evidence do you have that this will happen?' and 'Have you confronted someone before? What happened?' 4. Generate Alternative Outcomes: Together, brainstorm alternative outcomes that are more realistic and less extreme. Discuss the possible positive outcomes of standing up for herself. 5. Reality Testing: Guide the client to consider past experiences with family conflict and how they turned out. Highlight any instances where confrontation led to resolution rather than disaster. 6. Develop a Plan: Help the client create a plan for how she might approach Candace, including potential scripts for what to say. Emphasize her right to set boundaries while maintaining respect. 7. Practice and Role-Play: Engage in role-playing scenarios to practice confronting Candace in a safe environment. This will help reduce anxiety about the actual confrontation. 8. Homework Assignment: Assign the client to write down her thoughts and feelings after each interaction with Candace over the next week, focusing on any changes in her emotional response. Discuss these in the next session to reinforce progress and continue challenging negative beliefs.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Advanced",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I feel like I can't really express how much this bothers me. It just feels easier to shut down and not engage.",
    "resistance_rationale": "The client's history of family conflict and beliefs about powerlessness contribute to a strong tendency to withdraw in therapy, particularly when facing difficult emotions or situations like confronting Candace. This withdrawal reflects entrenched patterns of avoiding confrontation, indicating a higher level of resistance."
  },
  {
    "name": "Wendy",
    "id": "22-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The patient has been dealing with complex interpersonal relations, particularly with a significant other named Ivan and his family. A series of betrayals and trust issues have recently emerged from Ivan, and his family seems to avoid taking intervention in these matters. The patient has been actively involved with the family but feels anger and betrayal due to their recent actions and avoidance.",
    "helpless_belief": [
      "I am helpless.",
      "I am a victim.",
      "I am trapped."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be abandoned."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I must keep good peace with family members and get support from them, otherwise I'm helpless and trapped. My partner should never betray or deceive me. If it happened, the harm will never be remedied.",
    "intermediate_belief_depression": "Betrayal and deceit will happen at any time, even people who say love me will lie and hurt me eventually. There's no trust left between Ivan and I. Nobody in this family is supporting me. There's no solution to everything and I'm helpless and trapped",
    "coping_strategies": "Wendy copes with by being on high alert of any suspicious behaviors or red flags from Ivan; and has resorted to checking his phone and tracking his location. Wendy also goes to therapy and seems willing to engage in change.",
    "situation": "Interacting with Ivan's family. The mother makes a comment like 'boys will be boys' and asks Wendy to 'forgive and forget'.",
    "auto_thought": "They must be blaming me for not being 'over' the past, they are taking his side unfairly. They don't support me and think I'm being dramatic.",
    "emotion": [
      "angry, mad, irritated, annoyed",
      "disappointed",
      "hurt"
    ],
    "behavior": "Keep ruminating the past betrayals and have conflicting thoughts regarding the family. Lose sleep. Fantasizes about standing up to the family and telling them off.",
    "cognitive_distortion": "Mind Reading, Personalizing, Catastrophizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept and Identify the Target: We will start by discussing your feelings of anger and betrayal regarding Ivan's family. We will identify how you might be interpreting their behaviors and comments, specifically focusing on the belief that they are blaming you for your feelings. I will introduce Evidence-Based Questioning as a technique to challenge these assumptions.\n2. Identify Specific Thoughts: Together, we will write down your auto-thought: 'They must be blaming me for not being 'over' the past.' We will break this down into smaller components to examine.\n3. Gather Evidence: I will ask you a series of questions to help you evaluate the validity of this thought, such as: \n   - 'What evidence do you have that they are blaming you?' \n   - 'Have they explicitly communicated this, or is this an assumption?' \n   - 'What alternative explanations could there be for their behavior and comments?'\n4. Challenge the Thought: We will analyze the evidence collected, weighing both supporting and contradicting evidence. I will guide you to consider the possibility that their comments may not be personal attacks but rather reflections of their own beliefs or discomfort.\n5. Reframe the Thought: Based on the evidence gathered, we will work together to reframe your initial thought. For instance, instead of thinking 'They are blaming me,' we might reframe it to 'They may not understand my feelings, and it’s okay for me to express them.'\n6. Practice and Link to Behavior: To reinforce this new perspective, I will encourage you to practice questioning assumptions when interacting with Ivan’s family. You could create a list of potential alternative explanations for their actions to refer to when you feel triggered. This will help reduce the intensity of your emotions and allow for more constructive interactions with them.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I feel like you're just trying to gloss over the real issues with your suggestions. How can you not see that I'm really struggling with this?",
    "resistance_rationale": "Wendy has expressed significant anger and disappointment towards her family, and given her history of betrayal and lack of support, it is likely she may project this frustration onto the therapist, questioning their understanding and competence. Her entrenched beliefs about being a victim and feeling trapped also point to an advanced level of resistance as she may feel that traditional therapeutic approaches are insufficient for her complex emotional landscape."
  },
  {
    "name": "Zac",
    "id": "25-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded"
    ],
    "history": "The patient works in an educational setting with children with learning disabilities. The patient has had a history of being babied by his parents, facing little punishment or consequences for his actions, leading to conflicts with authority and frustration when things don't go his way. He has been frustrated by the difference between his expectations and reality both in his job and personal life.",
    "helpless_belief": [
      "I am incompetent.",
      "I am powerless, weak, vulnerable.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "My efforts must have desired impact. I must have authority and influence, otherwise I'm a failure. The changes I make must proceed smoothly.",
    "intermediate_belief_depression": "My efforts in both work and life are unproductive and futile, I'm powerless and ineffective in everything. I'm a failure.",
    "coping_strategies": "The patient tends to become frustrated and angry, yet internally conceals these feelings. He uses verbal self-expression to relieve frustration and are aware of his tendency to erupt like a 'volcano' and talk to himself as a form of coping.",
    "situation": "Handling students with learning disabilities and trying to encourage them to socialize and perform activities on campus. However it did not work very well as expected.",
    "auto_thought": "I'm not being productive, my effort is meaningless, I feel like a failure in my role.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Ruminates on all the times he's failed in his work-related efforts. Considers quitting his job.",
    "cognitive_distortion": "All-or-Nothing Thinking",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "1. Introduce the Concept: Begin by discussing the recent situation in your role, emphasizing the emotional distress caused by feeling unproductive and ineffective. Explain the concept of all-or-nothing thinking and how it can distort perceptions of self-worth and effectiveness. 2. Identify Specific Thoughts: Ask you to articulate specific thoughts that have led to the feeling of failure, such as 'I'm not being productive' or 'My efforts are meaningless.' 3. Challenge Catastrophic Thinking: Together, we will evaluate these thoughts by asking questions such as: 'What evidence do you have that supports this belief?' and 'What evidence contradicts it?' 4. Explore Alternatives: Guide you in generating alternative, more balanced thoughts. For example, 'I may not have achieved the desired impact this time, but I have made efforts and can learn from this experience.' 5. Evaluate the Worst-Case Scenario: Discuss what the absolute worst outcome might be if you were to continue feeling ineffective, and how likely that scenario is to happen. 6. Reframe the Situation: Help you to reframe the situation by focusing on your efforts rather than the results. Encourage a mindset that acknowledges progress and learning, such as, 'I am gaining experience in handling challenging situations.' 7. Develop Coping Strategies: Discuss practical strategies to manage frustration and emotions when faced with challenges in your role. This could include mindfulness techniques or setting small, achievable goals. 8. Homework Assignment: Assign a task where you reflect on daily efforts and note any positive impacts, no matter how small, to encourage recognition of your contributions.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I don't see how this therapy is going to change anything for me. It feels pointless.",
    "resistance_rationale": "The client's belief system reflects a strong sense of helplessness and frustration about their perceived lack of effectiveness in life. This aligns with advanced resistance as they express entrenched dissatisfaction with treatment approaches, feeling that their efforts are futile, which can lead to explicit disagreements with therapy rationale."
  },
  {
    "name": "Zac",
    "id": "25-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded"
    ],
    "history": "The patient works in an educational setting with children with learning disabilities. The patient has had a history of being babied by his parents, facing little punishment or consequences for his actions, leading to conflicts with authority and frustration when things don't go his way. He has been frustrated by the difference between his expectations and reality both in his job and personal life.",
    "helpless_belief": [
      "I am incompetent.",
      "I am powerless, weak, vulnerable.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "My efforts must have desired impact. I must have authority and influence, otherwise I'm a failure. The changes I make must proceed smoothly.",
    "intermediate_belief_depression": "My efforts in both work and life are unproductive and futile, I'm powerless and ineffective in everything. I'm a failure.",
    "coping_strategies": "The patient tends to become frustrated and angry, yet internally conceals these feelings. He uses verbal self-expression to relieve frustration and are aware of his tendency to erupt like a 'volcano' and talk to himself as a form of coping.",
    "situation": "Proposed a new method for teaching students, but got rejected by the school leadership.",
    "auto_thought": "I don't have any authority and just keep failing. I hate the feeling of powerless, but I indeed am.",
    "emotion": [
      "angry, mad, irritated, annoyed",
      "ashamed, embarrassed, humiliated",
      "disappointed"
    ],
    "behavior": "Show reluctance for work and communication. Keep talking about the unreasonable decision of the school leadership. Doesn't directly confront school leadership, but acts secretly defiant and spiteful.",
    "cognitive_distortion": "Overgeneralizing, Catastrophizing, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduction: Begin the session by discussing the recent rejection of the proposed teaching method and how this has influenced your feelings of powerlessness and frustration. We'll explore the overgeneralized belief that this rejection signifies a total failure in your authority and effectiveness.\n2. Identify Automatic Thoughts: Ask you to share specific thoughts that arise when you think about the rejection. Encourage you to articulate how these thoughts contribute to feelings of anger and disappointment.\n3. Gather Evidence: Together, we will examine the validity of these thoughts by asking questions like: \"What evidence supports this thought?\" and \"What evidence contradicts it?\" This will help you to critically evaluate the situation rather than accept it at face value.\n4. Challenge Cognitive Distortions: Focus on identifying specific instances where your contributions have been successful. We will ask questions such as: \"Have there been times when your ideas were accepted?\" and \"What feedback have you received from colleagues or students in the past?\" This will help in recognizing the positive impacts you have made, countering the belief of being a complete failure.\n5. Consider Alternative Outcomes: Discuss alternative explanations for the rejection. For example, was the decision based on factors outside of your control? We will explore the possibility that rejection does not equate to personal failure.\n6. Reframe Your Thoughts: Based on the evidence gathered, we will work together to create more balanced, realistic thoughts. For instance, instead of saying, \"I am a failure,\" you might reframe it to, \"Not every idea will be accepted, but that doesn’t define my abilities or worth.\"\n7. Homework Assignment: Encourage you to keep a thought diary over the next week, where you record any negative thoughts and the evidence for and against them. This will help reinforce the practice of questioning and reframing negative beliefs, facilitating a more empowered approach to future challenges.",
    "resistance_type": "Direct",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I don't see how you can help me when you don't understand the real challenges I face every day.",
    "resistance_rationale": "The client's history of feeling powerless and ineffective, coupled with his frustration at authority figures, suggests a pattern of criticizing the therapist when feeling misunderstood. His entrenched beliefs about failure and authority may lead him to express anger towards the therapist when interventions don't resonate with his experiences."
  },
  {
    "name": "Sophia",
    "id": "28-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "Sophia has a history of being critical towards herself, a behavior that likely stems from her upbringing. She was accustomed to having control in life and achieving her goals, making the current situation with job searching, her relationship with Ivan, and family dynamics challenging for her.",
    "helpless_belief": [
      "I am incompetent.",
      "I am powerless, weak, vulnerable.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [],
    "worthless_belief": [],
    "intermediate_belief": "I must take responsibility for others' actions to make things in control. I must excel in everything, otherwise I'm a failure. My partner must be successful and in the same pace with me, otherwise it makes both of us failures. \n[during depression]\n My partner is not meeting my expectations, he's a failure and there must be something wrong with me, which makes me a failure too to stay with him.",
    "intermediate_belief_depression": "",
    "coping_strategies": "Self-criticism as a form of maintaining control, attempts at rationalizing or justifying others' behaviors to avoid feeling disappointed.",
    "situation": "Dealing with Ivan's seemingly unfocused approach to job searching and life in general.",
    "auto_thought": "Ivan is not making an effort at the same level as I am, and it reflects poorly on him and on me for being with someone like that.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "angry, mad, irritated, annoyed",
      "disappointed"
    ],
    "behavior": "Feeling a mix of resignation and frustration towards Ivan, avoiding confronting the issue but internally criticizing both herself and Ivan. Not wanting to bring Ivan to social events to avoid feeling embarrassed if asked about his situation.",
    "cognitive_distortion": "Comparing and Despairing, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept: Begin by explaining the role of cognitive distortions in shaping perceptions about Ivan's job search and the associated feelings of frustration and embarrassment. Emphasize how comparing oneself to others can lead to negative self-assessments and beliefs.\n2. Identify Automatic Thoughts: Ask Sophia to articulate her automatic thoughts regarding Ivan's job search and her feelings about it. Focus on phrases like 'Ivan is not making an effort at the same level as I am.'\n3. Explore Evidence: Prompt Sophia to consider evidence that supports or contradicts her automatic thoughts. Questions might include: 'What specific actions has Ivan taken in his job search?' 'Is it fair to compare your efforts to Ivan's given your different circumstances?' 'Have there been times when Ivan has shown commitment or effort that you might be overlooking?'\n4. Challenge Comparisons: Discuss the validity of her comparisons. Ask, 'What does it mean to be successful in a job search? Is it possible for two people to take different paths and still be successful in their own ways?'\n5. Reevaluate Self-Perception: Encourage Sophia to reflect on her worth outside of her partner's actions. Questions could include: 'How do you define your own success?' 'What strengths and qualities do you bring to your relationship with Ivan that are independent of his job search?'\n6. Reframe the Thought: Work together to create a balanced thought that reduces the pressure of comparison and 'should' statements. For instance, 'Ivan's journey is different from mine, and it doesn’t reflect my worth or success.'\n7. Develop an Action Plan: Conclude with a discussion on how to support Ivan without compromising her self-worth. Explore ways to positively encourage him while practicing self-compassion. Suggest setting small, achievable goals for both her and Ivan that acknowledge their individual paths.",
    "resistance_type": "Direct",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I just feel like you don't understand how hard this is for me. How can you suggest I change when you don't know what I'm going through?",
    "resistance_rationale": "Sophia's critical self-perception and feelings of inadequacy lead her to project those feelings onto the therapist, resulting in a defensive stance that involves criticizing the therapist's understanding and competence. Her history of control and frustration with her partner's perceived failure amplifies this resistance, making her more confrontational in therapy."
  },
  {
    "name": "Matthew",
    "id": "30-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has just completed their undegraduate degree and is transitioning into the workforce. Coming out to their parents only two and a half years ago, their sexuality was a significant surprise to the parents, and was met with negative reactions. They felt like they had to protect themself during the process and has since been more distant with their parents. The client had moved to New York for school, which was also an excuse to discover their identity away from the influence of their family. Their relationship has always been more strained with their mother, who seems to focus on the practical repercussions of life events rather than emotional support, and with their sister, who remains unfocused, living at home and seemingly jealous of their independence and achievements.",
    "helpless_belief": [
      "I am helpless.",
      "I am powerless, weak, vulnerable."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I need to get support and validation from my family. Achieving independence is necessary for self-discovery, but it leads to estrangement from family. \n[during depression]\n My family will never support me. Instead of empathy, they will focus on the practical outcomes or how events affect them personally.",
    "intermediate_belief_depression": "",
    "coping_strategies": "The client seeks approval and acceptance from their family but often has to emotionally distance themselves to maintain their well-being. The client moves physically away from the family to reduce the direct influence and attempts to find substitute familial support in others, like their partner's family or a supportive cousin. Humor and minimizing the emotional impact of situations are used as defense mechanisms.",
    "situation": "Remembering coming out to their parents and the negative aftermath.",
    "auto_thought": "No matter what I do, I won't receive the emotional support or validation I need from my parents.",
    "emotion": [
      "sad, down, lonely, unhappy"
    ],
    "behavior": "The client moves away from home, seeks independence, and prepares self-protecting strategies when dealing with family.",
    "cognitive_distortion": "Mind Reading, Fortune Telling, Emotional Reasoning",
    "cbt_technique": "Decatastropizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept and Identify the Negative Thoughts: We will start the session by discussing the recent memory of coming out to your parents and the negative aftermath. I'll help you identify the specific thoughts you have about their potential reactions and the emotional impact this has on you.\n2. Explore the Catastrophic Thought: I will ask you to articulate your worst fears regarding your family's reaction and your belief that you won't receive emotional support or validation.\n3. Challenge the Catastrophic Thought: Together, we will examine the evidence for and against these thoughts. I will prompt you to reflect on past experiences where your fears did not materialize or were less severe than anticipated. Questions may include: \"What evidence do you have that your parents will not support you?\" or \"Have they ever shown support in some way, even if it was not as you expected?\"\n4. Assess the Likelihood: We will work on estimating the likelihood of your worst fears coming true. I will encourage you to rate the probability of these fears occurring on a scale from 0-100% and to consider how realistic these fears are.\n5. Develop Alternative Outcomes: Next, we will brainstorm alternative, more balanced outcomes that could happen. I will help you envision scenarios where your parents may respond differently than you expect. This may include considering their potential growth and understanding over time.\n6. Create a Balanced Thought: After exploring the evidence and alternative outcomes, we will work together to generate a more balanced thought that reflects a realistic perspective. For example, instead of thinking \"I will never receive support from my parents,\" we may reframe it to \"My parents might surprise me with their reaction, and while their initial response may not be supportive, they might come to understand my perspective as time goes on.\"\n7. Plan for Action: Finally, we will create an action plan for how you can approach future interactions with your family. This may include setting small goals for communication or preparing for different potential responses, allowing you to feel more empowered and less anxious about the outcomes.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Advanced",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I just don't feel like I can really open up about my family or how I feel anymore. What's the point? It never helps.",
    "resistance_rationale": "The client has a history of emotional withdrawal, especially when discussing their family dynamics. Their beliefs about being unlovable and feeling powerless contribute to a pattern of disengagement when faced with uncomfortable emotions or discussions. This resistance is strong, as the client has entrenched feelings of helplessness and distance from their family, which could lead to significant withdrawal in therapy."
  },
  {
    "name": "Leo",
    "id": "32-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history of complicated family dynamics and struggles with relationships within his family. He expresses feelings of disconnection and discomfort around his parents and feels slighted or judged by them, leading to detachment. Past issues related to his mother's illness and his parents' support of his education have generated feelings of guilt and frustration. The client also hints at possible issues with his mother's behavior towards him and possibly others (mentions of her being 'broken' and a past affair).",
    "helpless_belief": [
      "I am a failure, loser."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [
      "I am worthless, waste."
    ],
    "intermediate_belief": "I must be acknowledged and recognized by my parents to demonstrate my worth. \n[during depression]\n My parents see me as incompetent and a failure. My accomplishments can never get acknowledged by them, therefore I'm worthless and failing.",
    "intermediate_belief_depression": "",
    "coping_strategies": "The client copes by detaching from his family, cutting off relationships when feeling slighted, and trying to maintain control over his life and interactions. He also has a tendency to 'test' relationships through causing hurt, to validate his personal significance and the authenticity of the connection.",
    "situation": "Client got a bonus at work for good performance, but on his call with his parents to share his news, they asked him if he was on the lookout for a new job with better prospects.",
    "auto_thought": "They will judge me negatively or not understand; sharing will lead to feelings of vulnerability or potential rejection.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "ashamed, embarrassed, humiliated",
      "disappointed"
    ],
    "behavior": "Decided to withhold his work achievement with his parents; cut short the conversation; did not call them for the next two weeks.",
    "cognitive_distortion": "Mind Reading, Emotional Reasoning, Catastrophizing",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Session: Begin by discussing the recent call with his parents and the feelings that arose from it. Acknowledge the client's emotions of anxiety and disappointment, and introduce the Evidence-Based Questioning technique as a means to challenge his automatic thoughts. 2. Identify Automatic Thoughts: Ask the client to articulate his automatic thoughts about sharing his achievement with his parents, particularly focusing on his belief that they will judge him negatively. 3. Gather Evidence: Encourage the client to reflect on past interactions with his parents. Questions will include: 'What evidence do you have that your parents would judge you negatively if you shared your success?' and 'Have there been times when they were supportive or proud of your achievements?' 4. Analyze the Evidence: Discuss the responses and identify any patterns or inconsistencies in his thinking. Highlight any positive feedback he has received from his parents in the past. 5. Reframe the Automatic Thought: Guide the client to create a more balanced thought based on the evidence gathered. Example: 'While I worry they may not understand, they have supported me before, and sharing my success could lead to a constructive conversation.' 6. Develop a Plan for Future Interactions: Together, create a strategy for how the client can approach sharing his achievements with his parents in the future. Encourage him to express his feelings of vulnerability and the desire for connection. 7. Practice: Assign the client the task of reflecting on his thoughts and emotions in a journal after future interactions with his parents, focusing on evidence that supports or contradicts his fears. This will help solidify the reframing process and build confidence in his ability to share openly.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I just don't see how this therapy can help me when my parents still think I'm a failure.",
    "resistance_rationale": "The client demonstrates strong resistance through a belief that their worth is tied to parental recognition, leading to feelings of anger and frustration towards therapy that does not address these deep-seated issues. Additionally, the client's tendency to detach and cut off communications with family suggests a confrontational stance when feeling judged, indicating advanced resistance to the therapeutic process."
  },
  {
    "name": "Naomi",
    "id": "38-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client expressed concerns about returning to work after a period of physical therapy for a painful condition. They have a history of feeling judged by personnel at work, experience dread and nervousness about interacting with HR and their manager regarding their return to work and their short-term disability status, and feel guilty for being away from work despite medical reasons.",
    "helpless_belief": [
      "I am helpless.",
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I need to control my situation but can't, If I don't go back to work soon, others will view me negatively, Taking care of my health might make others judge me.",
    "intermediate_belief_depression": "I'm failing at knowing what to do to continue being out of work, I should be more proactive, If I enjoy time away from work, it means I'm lazy and taking advantage of the system.",
    "coping_strategies": "Seeking confirmation from others about taking more time off from work, attempting to find clear instructions from HR policies online, wanting to argue against supportive comments as a means of judging self-necessity.",
    "situation": "Recounting a past experience of judged by HR for taking disability leave.",
    "auto_thought": "I will always be judged negatively for tending to my health needs.",
    "emotion": [
      "angry, mad, irritated, annoyed",
      "hurt"
    ],
    "behavior": "Generalizing past judgement to current situation, fearing repeat scenarios, feeling mistrust towards HR.",
    "cognitive_distortion": "Overgeneralizing, Mind Reading, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept and Identify the Target: Begin by discussing the client's feelings of dread and judgment related to returning to work after disability leave. Emphasize the overgeneralization that they will always be judged negatively for their health needs. 2. Explore the Auto Thought: Ask the client to elaborate on their automatic thought, 'I will always be judged negatively for tending to my health needs.' 3. Challenge the Thought: Use evidence-based questioning to help the client explore the validity of this thought. Prompt them with questions like, 'What specific evidence do you have that supports this belief?', 'Have there been times when you felt supported by others regarding your health needs?' 4. Identify Counter-Evidence: Assist the client in identifying instances where they received positive feedback or support from colleagues or HR. Encourage them to recall any supportive comments made during their leave. 5. Reframe the Thought: Guide the client to reformulate their thought based on the evidence gathered. They might reframe it to something like, 'While I fear judgment, I have also received support from my colleagues and HR in the past.' 6. Practice and Link to Behavior: Encourage the client to monitor their thoughts and feelings about returning to work. They can practice using evidence-based questioning whenever they feel judged or anxious about their health needs. This will help them build resilience and challenge negative beliefs in the future.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I feel like you're not really understanding the pressure I'm under to go back to work, and it seems like you're just focused on following the treatment plan.",
    "resistance_rationale": "The client has expressed feelings of being judged and trapped, leading to anger towards their situation and possibly towards the therapist's approach. Their coping strategies involve arguing against supportive comments, indicating a tendency to criticize perceived misunderstandings from others, including the therapist. This aligns with an advanced level of resistance due to the entrenched patterns of mistrust and frustration regarding their circumstances."
  },
  {
    "name": "Sydney",
    "id": "39-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client indicates a history of suffering from anxiety-related stomachaches and experiencing stress-induced physical symptoms. The client also has a past of struggling with their weight, sexuality, and academic performance until a positive transformation occurred in college. Additionally, the client has experienced feelings of not being in control and engaging in patterns of behavior where they seek control in relationships.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If I am not in control, something bad will happen. I need to know the reasons for my symptoms to feel calm. My happiness is directly tied to my physical health and being in a desirable state.",
    "intermediate_belief_depression": "When feeling unwell or scared about health, the client obsesses over the causes of their symptoms and fears the worst outcomes, signaling a heightened state of worry and preoccupation with health issues.",
    "coping_strategies": "Attempting to maintain a sense of control over situations, environments, and relationships; seeking reassurance through understanding causes of physical symptoms; exercising for stress release; using social interactions to distract from anxiety.",
    "situation": "Fearing loss of positive aspects of life or return to former unhappy state.",
    "auto_thought": "Things are going too well, and I don't deserve this happiness; something bad will happen because it always does; I'm going to lose what I have.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Over-analyzing situations, avoiding fully enjoying current well-being, preparing mentally for the worst.",
    "cognitive_distortion": "Fortune Telling, Catastrophizing, Emotional Reasoning",
    "cbt_technique": "Decatastrophizing",
    "counseling_plan": "Decatastrophizing Technique\n1. Introduce the Concept and Identify the Target: We will start by discussing your concerns about fearing the loss of positive aspects of life and the belief that something bad will happen. We'll identify how this thinking leads to anxiety and prevents you from enjoying your current well-being. I will introduce the Decatastrophizing technique to challenge these catastrophic thoughts.\n2. Identify Specific Fears: I will ask you to articulate the specific worst-case scenarios that you are imagining. What exactly do you think will happen if you lose what you have?\n3. Reality Check: Together, we will evaluate the likelihood of these worst-case scenarios happening. I will prompt you with questions such as: 'How often have your worst fears come true in the past?' and 'What evidence do you have that this will happen again?'\n4. Assess the Impact: We will discuss the actual impact of these feared outcomes. If the worst were to happen, how would you cope? What resources or strengths do you have that would help you manage the situation?\n5. Develop a Balanced Perspective: After assessing the evidence, we will work together to create a more balanced thought. For example, instead of thinking 'I'm going to lose what I have,' we might reframe it to 'I can enjoy my current happiness and deal with challenges as they arise.'\n6. Practice Using the Technique: I will encourage you to practice this technique outside of our session. Whenever you find yourself imagining catastrophic outcomes, use the questions we discussed to challenge those thoughts and develop a more realistic perspective.\n7. Link to Behavioral Changes: Finally, we will connect this reframing to your behaviors. How can you allow yourself to enjoy the positive aspects of your life more fully, knowing you have coping strategies in place if challenges arise?",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I just don't see how understanding my symptoms is going to help me feel better. It feels pointless to keep going in circles about it.",
    "resistance_rationale": "The client exhibits strong beliefs around needing control over their health and a tendency to obsessively analyze symptoms, leading to a confrontational stance toward treatment methods that challenge this perspective. Their frustration indicates a clear opposition to therapeutic processes that don't align with their deeply ingrained beliefs, marking a more entrenched level of resistance."
  },
  {
    "name": "Ryan",
    "id": "40-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has recently moved and has been dealing with the stress of unpacking and organizing their new living space. They have a complicated relationship with their parents, particularly their mother, where they feel judged and unsupported in their emotional needs. The client's friends were unable to support them during a time of need, leading to increased feelings of isolation.",
    "helpless_belief": [
      "I am incompetent.",
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [],
    "intermediate_belief": "If I get really upset, then obviously the next step would be something destructive, like punching in a wall or a window.",
    "intermediate_belief_depression": "Feeling upset is inappropriate and if I express my upset, it means I've made a communicative mistake or I am being unreasonable. Negative feelings are dangerous and must be avoided.",
    "coping_strategies": "The client tends to avoid contact with their mother when feeling emotionally unwell to prevent a conversation that they anticipate will be frustrating and inauthentic. This indicates a pattern of avoidance in stressful situations. The client also seems to engage in social withdrawal when feeling mentally or physically unwell, as they avoided attending a friend's birthday party and communicating with their mother.",
    "situation": "Anticipation of a conversation with their mother, which the client predicts to be frustrating and inauthentic.",
    "auto_thought": "Talking to my mother about how I feel will only make things worse and confirm that I am unable to handle my emotions properly.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "guilty",
      "hurt"
    ],
    "behavior": "Choosing not to answer the mother's call, delaying communication.",
    "cognitive_distortion": "Mind Reading, Fortune Telling, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin by discussing the client's anticipation of the conversation with their mother and their feelings of frustration and inauthenticity. Introduce the concept of Mind Reading and Emotional Reasoning as cognitive distortions that may be influencing their thoughts about the interaction. 2. Identify Automatic Thoughts: Ask the client to articulate their automatic thoughts, specifically focusing on the belief that talking to their mother will confirm their inability to handle emotions. 3. Gather Evidence: Use Evidence-Based Questioning to challenge these thoughts. Ask the client questions such as: - 'What specific evidence do you have that your mother will react negatively?' - 'Have there been times when your mother has been supportive?' - 'What would happen if you expressed your feelings to her?' 4. Explore Alternative Outcomes: Discuss alternative outcomes and how the client might feel if the conversation goes better than expected. Encourage them to consider instances where communication led to understanding. 5. Assess Emotional Reactions: Explore how the client feels about their emotions being 'dangerous' and discuss the validity of these feelings. Ask questions like: - 'Is it always true that expressing emotions leads to destructive actions?' - 'What coping strategies can you use if you feel overwhelmed during the conversation?' 6. Reframe Thoughts: Help the client reframe their initial thought. For example, instead of 'Talking to my mother will make things worse', they might consider 'Talking to my mother could lead to a better understanding of each other.' 7. Role-Play: As practice, conduct a role-play of the conversation with their mother, allowing the client to express their feelings in a controlled setting. This will help them prepare for the real interaction. 8. Set Goals: Conclude by setting a goal for the client to initiate the conversation with their mother, encouraging them to document their feelings before and after the interaction to reflect on the outcomes.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I feel like you're not really getting what I'm trying to say about my relationship with my mother. It’s like you just want me to follow a script that doesn't fit my reality.",
    "resistance_rationale": "The client has a complicated relationship with their mother and feels judged, leading to frustration when discussing emotions. Their belief that expressing upset is inappropriate may cause them to criticize the therapist's approach when it doesn't align with their needs or experiences, indicating a strong resistance to the therapeutic process."
  },
  {
    "name": "Quinn",
    "id": "41-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history involving a complicated relationship with an individual named Cricket, who has exhibited questionable behavior and influenced the client's social circle. Their friends seem to have mental health challenges, and they often take on a caretaking or protective role, particularly regarding a friend named Lucy with medical issues.",
    "helpless_belief": [
      "I am incompetent.",
      "I am helpless.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [],
    "intermediate_belief": "It's important for me to be on time and productive, but I can't seem to control my procrastination or punctuality. I must not get involved in my friends' dramatic situations, but I can't help feeling protective.",
    "intermediate_belief_depression": "My environment is consistently negative, possibly affecting my mood. If I expose myself or engage with Cricket, it will have negative outcomes, and it's better to avoid confrontation.",
    "coping_strategies": "The client uses avoidance in confronting their grief and engages in overcommitment to helping others to compliment their inner grief and distress.",
    "situation": "Being late to appointments and gatherings, such as therapy sessions and lunches with friends.",
    "auto_thought": "I'm not in control of my time, and I always mess things up by being late.",
    "emotion": [
      "anxious, worried, fearful, scared, tense",
      "guilty"
    ],
    "behavior": "Continues to procrastinate and is unable to leave on time.",
    "cognitive_distortion": "Overgeneralizing, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduction to the Session: Start by welcoming the client and discussing the specific situation of being late to appointments. Acknowledge their feelings of anxiety and guilt associated with this behavior.\n2. Identify Automatic Thoughts: Ask the client to share their automatic thought: 'I'm not in control of my time, and I always mess things up by being late.' Write it down together for clarity.\n3. Challenge the Thought: Introduce the Evidence-Based Questioning technique. Encourage the client to examine the validity of their thought by asking questions such as: \n   - 'Is it true that you always mess things up by being late?' \n   - 'Can you think of times when you were on time or things went well?' \n   - 'What evidence do you have that supports or contradicts this belief?' \n4. Explore Patterns: Discuss with the client what patterns have contributed to their lateness and procrastination. Ask them to reflect on any external factors or internal beliefs (like feeling overwhelmed or unlovable) that may play a role.\n5. Generate Alternative Thoughts: Based on the evidence gathered, help them formulate a more balanced thought. For example, 'I sometimes struggle with time management, but I can learn strategies to improve it.' \n6. Create an Action Plan: Collaboratively develop a plan to address their lateness. This may include setting earlier departure times, using reminders, or breaking tasks into smaller, manageable steps to prevent overwhelm.\n7. Conclusion and Homework: Summarize the session's insights and strategies. Assign a homework task where the client will track their punctuality over the week and identify thoughts that arise when they are late. Encourage them to practice reframing those thoughts using the Evidence-Based Questioning approach.",
    "resistance_type": "Indirect",
    "resistance_subtype": "In-session withdrawal",
    "resistance_level": "Advanced",
    "resistance_emotion": "Withdrawn",
    "resistance_internal_monologue": "I just feel like I can't handle talking about my issues right now; it's too much.",
    "resistance_rationale": "The client's coping strategies involve avoidance and emotional withdrawal, especially in situations that evoke anxiety or fear of negative outcomes. Their history of caretaking and feeling overwhelmed suggests entrenched patterns of withdrawal when confronted with personal issues, marking their resistance as advanced."
  },
  {
    "name": "Morgan",
    "id": "42-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client's life history includes significant pressure during grad school, as reflected in recurring nightmares about being unprepared for a thesis defense. Furthermore, the client's experience with their father's expectations and failure to instill his religion and negative experiences as a child may have shaped some deeply held beliefs.",
    "helpless_belief": [
      "I am incompetent.",
      "I am out of control.",
      "I am a failure, loser."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [],
    "intermediate_belief": "The client displays beliefs that they need to maintain control and keep up with others' expectations to avoid frustration or disappointment. They seem to believe that they must handle everything alone and cannot rely on others.",
    "intermediate_belief_depression": "During depressive episodes, the client believes that their work isn't making an impact, feeling ineffective and as if they are not meeting expectations, which exacerbates their sense of incompetence and failure.",
    "coping_strategies": "The client exhibits coping strategies such as emotionally reassuring others at work, trying to meet perceived expectations, and probably avoiding discussing their feelings directly with colleagues.",
    "situation": "Receiving specific criticisms in a performance review.",
    "auto_thought": "I focus too much on irrelevant details and have trouble distinguishing the relevant from the irrelevant.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "ashamed, embarrassed, humiliated"
    ],
    "behavior": "Self-doubt in professional capacity, reflection on interactions with senior colleague.",
    "cognitive_distortion": "Overgeneralizing, Catastrophizing, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: We will start the session by discussing the recent performance review and the specific criticisms you received. I will explain how overgeneralizing and catastrophizing can lead to distorted thinking. 2. Identify Negative Thoughts: Together, we will identify the negative thoughts you have about your performance and abilities, particularly focusing on the thought 'I focus too much on irrelevant details.' 3. Gather Evidence: I will guide you to examine the evidence that supports and contradicts this thought. We will ask questions such as: 'What feedback have you received that suggests you are effective in your role?' and 'Can you recall instances where your attention to detail was beneficial?' 4. Evaluate the Evidence: We will analyze the evidence collected, discussing how it challenges the negative thought. We'll explore the impact of these thoughts on your emotions and behaviors. 5. Reframe the Thought: Based on the evidence, we'll work together to create a balanced thought that replaces the negative belief. For example, 'I may struggle with details sometimes, but I also have strengths that contribute positively to my work.' 6. Practice: As a home assignment, I will encourage you to apply evidence-based questioning to any negative thoughts that arise in your daily life, helping to reinforce this skill. 7. Link to Behavior: We will discuss how changing these thoughts can lead to a more constructive approach to your work and interactions, aiming to reduce feelings of shame and inadequacy.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I just don’t see how this CBT stuff is supposed to help me when I feel like I’m constantly failing at everything.",
    "resistance_rationale": "The client's deeply held beliefs of incompetence and failure, combined with their experiences of significant pressure and criticism, suggest a strong resistance to the treatment rationale. They may feel that CBT is inadequate for addressing their profound feelings of inadequacy and unlovability, leading to a confrontational stance towards the therapy methods."
  },
  {
    "name": "Jordan",
    "id": "45-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has a history of developing friendships that potentially evolve into romantic relationships. They have gone through experiences where expressing their opinions, especially when angry, has led to social discord and the potential loss of friendships, which they find deeply unsettling. Additionally, the client has a complex relationship with their parents, marked by negative feelings, love, and obligation.",
    "helpless_belief": [
      "I am powerless, weak, vulnerable.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected.",
      "I am bound to be abandoned.",
      "I am bound to be alone."
    ],
    "worthless_belief": [],
    "intermediate_belief": "The client holds beliefs that they must restrain their own opinions and expressions of anger to preserve relationships, fearing that if they express discontent or negative emotions, it may lead to social isolation or being disliked by others.",
    "intermediate_belief_depression": "During periods of distress, the client believes that expressing their opinions will alienate them, and they also worry that by not expressing themselves, they will become uninteresting to others, which could lead to the deterioration of their social relationships.",
    "coping_strategies": "The client utilizes avoidance and suppression of their thoughts and feelings as a coping mechanism to prevent conflict or rejection. They have also demonstrated a pattern of seeking comfort and reassurance from their partner after experiencing distress.",
    "situation": "Incident involving friends at a social event that led to a public emotional breakdown.",
    "auto_thought": "My friends judge me, and I am always misunderstood when expressing my opinions.",
    "emotion": [
      "angry, mad, irritated, annoyed",
      "hurt"
    ],
    "behavior": "Confrontational responses followed by social withdrawal and regrets about behavior.",
    "cognitive_distortion": "Mind Reading, Emotional Reasoning, Should Statements",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin the session by discussing the recent incident involving friends and the emotional breakdown. Highlight the patterns of mind reading and emotional reasoning in the client's auto-thoughts, particularly the belief that friends judge them. 2. Identify Specific Thoughts: Help the client articulate specific thoughts they experienced during the incident and the aftermath. 3. Challenge Assumptions: Use evidence-based questioning to encourage the client to examine the validity of their thoughts. Ask questions like: - 'What evidence do you have that your friends are judging you?' - 'Have they ever expressed any negative opinions directly?' 4. Explore Alternative Explanations: Guide the client to consider other possible interpretations of their friends' reactions. What might they have been thinking or feeling? 5. Evaluate Emotional Responses: Discuss how the client’s emotional responses (anger, hurt) may be influenced by their beliefs about mind reading. 6. Generate New Thoughts: Collaboratively create alternative, more balanced thoughts. For example, 'It's possible my friends care about me and may not have judged me as harshly as I think.' 7. Practice and Reflect: Encourage the client to apply this technique in real-life situations, reflecting on their thoughts and feelings before jumping to conclusions about others' perceptions. 8. Homework: Assign the client to keep a thought diary, noting situations where they experience mind reading or emotional reasoning, and to use evidence-based questioning to challenge these thoughts.",
    "resistance_type": "Direct",
    "resistance_subtype": "Explicitly disagreeing with the treatment rationale",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "I just don’t see how talking about my feelings is supposed to help. It feels like it’s all on me to fix things, and that’s not fair.",
    "resistance_rationale": "The client's history of feeling misunderstood and their belief that expressing emotions leads to social discord indicate a strong resistance to engaging fully in therapy. Their advanced level of resistance is reflected in their confrontational responses and the anger they feel towards the perceived ineffectiveness of traditional therapeutic approaches, suggesting a deep-seated skepticism about the treatment rationale."
  },
  {
    "name": "Charlie",
    "id": "47-1",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client is educated with a master's degree in engineering and is considering a career change. They have experience in robotics from their junior year of college. They also mentioned being in a situation where they felt ashamed and embarrassed about not dedicating enough time to a project, which impacted the project's success.",
    "helpless_belief": [
      "I am incompetent.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am bound to be rejected."
    ],
    "worthless_belief": [],
    "intermediate_belief": "Success is defined by professional achievements and the approval of others. Self-worth is tied to productivity and creative output.",
    "intermediate_belief_depression": "When depressed, the client seems to believe that making mistakes or not accomplishing tasks indicates a lack of competence and control.",
    "coping_strategies": "The client deals with stress by withdrawing and going to bed, engaging in creative projects like printing and bookbinding, and planning future activities like workshops. They also engage in social activities, such as supporting friends and participating in online discussions.",
    "situation": "Considering starting own micro press and changing careers.",
    "auto_thought": "I'm possibly hypomanic and not thinking straight; I might not succeed, and others doubt me.",
    "emotion": [
      "anxious, worried, fearful, scared, tense"
    ],
    "behavior": "Expresses doubt and concern about future financial stability and fulfillment; compares self to successful peers.",
    "cognitive_distortion": "Comparing and Despairing, Fortune Telling, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "Evidence-Based Questioning\n1. Introduce the Concept: We will start the session by discussing your feelings of doubt and concern about starting a micro press. I will explain the concept of Evidence-Based Questioning and how it can help challenge negative thoughts.\n2. Identify Negative Thoughts: Together, we will identify the specific negative thoughts you have, such as 'I'm possibly hypomanic and not thinking straight,' and 'I might not succeed, and others doubt me.'\n3. Gather Evidence: I will guide you to critically evaluate these thoughts by asking questions like: 'What evidence do you have that supports this thought?' and 'What evidence contradicts this thought?' This will involve looking at past successes, skills, and positive feedback from others.\n4. Challenge the Assumptions: We will explore the assumptions behind your thoughts. I will ask, 'What would you say to a friend who had similar thoughts?' This will help you to view your situation from a different perspective and counteract the emotional reasoning.\n5. Generate Alternative Thoughts: Based on the evidence gathered, we will work together to create more balanced and realistic thoughts. For example, instead of thinking, 'I might not succeed,' we might frame it as, 'I have skills and experience that can help me succeed, and challenges are part of the journey.'\n6. Reinforce Self-Compassion: We'll discuss the importance of self-compassion and how to treat yourself kindly during this transition. I will encourage you to recognize that it's normal to have doubts during a career change.\n7. Create an Action Plan: Finally, we will outline actionable steps you can take towards starting your micro press. This will involve setting small, achievable goals to help build your confidence and reduce feelings of overwhelm. We will also discuss how to monitor and challenge negative thoughts as they arise moving forward.",
    "resistance_type": "Indirect",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Advanced",
    "resistance_emotion": "Frustrated",
    "resistance_internal_monologue": "I appreciate your suggestions, but I just feel like you don’t understand the pressure I’m under to succeed.",
    "resistance_rationale": "The client has expressed clear doubts about their competence and control, which translates into frustration with the therapist when discussing treatment methods. Their tendency to withdraw and compare themselves unfavorably to peers suggests a strong resistance to perceived judgment or misunderstanding, indicating an Advanced level of resistance."
  },
  {
    "name": "Hannah",
    "id": "48-2",
    "type": [
      "plain",
      "verbose",
      "go off on tangents",
      "hostile",
      "guarded",
      "ingratiating"
    ],
    "history": "The client has been married to Ivan for three years and they have been together for about seven years. Past events of extreme stress have occurred during finals week in her academic life, and she has experienced difficulties with Ivan around their wedding preparations due to his lack of participation and support. She has recently been dealing with intense financial pressures, which are exacerbated by Ivan's part-time work status and the added costs of their individual and couples therapy sessions, as well as her dental treatments.",
    "helpless_belief": [
      "I am trapped.",
      "I am out of control."
    ],
    "unlovable_belief": [
      "I am unlovable.",
      "I am undesirable, unwanted."
    ],
    "worthless_belief": [],
    "intermediate_belief": "I am responsible for solving others' problems, I must be in control to ensure stability, My needs should come second to others' needs.",
    "intermediate_belief_depression": "If I criticize Ivan, I'm attacking him and shutting him down, If I don't confront issues, Ivan will continue avoiding responsibility, If I turn my negativity inwards, I maintain control and responsibility.",
    "coping_strategies": "Journaling to process feelings and document patterns, Attempting to manage the household and Ivan's issues independently, Seeking therapy to understand and manage her own thoughts and feelings.",
    "situation": "When Ivan's mother communicates harshly and critically to the client.",
    "auto_thought": "I am not being supported or valued by Ivan's family; they don't see or appreciate my contribution.",
    "emotion": [
      "sad, down, lonely, unhappy",
      "angry, mad, irritated, annoyed",
      "hurt"
    ],
    "behavior": "Attempts to communicate her stresses to Ivan, becomes deeply upset and has to seek support from her own family to vent.",
    "cognitive_distortion": "Personalizing, Mind Reading, Emotional Reasoning",
    "cbt_technique": "Evidence-Based Questioning",
    "counseling_plan": "1. Introduce the Concept: Begin by discussing the recent interaction with Ivan's mother and the feelings of being unsupported and unvalued. Explain how these thoughts may be influenced by cognitive distortions like personalizing and mind reading. 2. Identify Automatic Thoughts: Ask the client to articulate her automatic thoughts, particularly the belief that Ivan's family does not see or appreciate her contribution. 3. Gather Evidence: Facilitate a conversation where the client examines the evidence for and against this thought. Prompt her with questions such as: 'What specific actions from Ivan's family indicate they don't appreciate you?' and 'Have there been times when they have shown support?' 4. Challenge the Thoughts: Encourage the client to critique her interpretations. Discuss alternative explanations for Ivan’s family's behavior, such as their own stress or lack of awareness. 5. Reframe the Thought: Help the client create a balanced statement that acknowledges her feelings while also recognizing the complexity of relationships, such as: 'While I feel unsupported, there are times when Ivan's family has appreciated my contributions.' 6. Develop a Plan for Future Interactions: Discuss strategies for communicating her needs to Ivan and his family, framing her requests in a way that opens dialogue rather than shutting it down. 7. Reinforce Coping Strategies: Encourage her to continue journaling and seeking therapy as a means of processing emotions and gaining clarity on her feelings. Conclude by setting goals for the next session, focusing on how she can express her feelings to Ivan more openly.",
    "resistance_type": "Direct",
    "resistance_subtype": "Criticizing the therapist",
    "resistance_level": "Advanced",
    "resistance_emotion": "Angry",
    "resistance_internal_monologue": "It feels like you just don't understand what I'm going through. How can you help me when you don't even see my struggles?",
    "resistance_rationale": "The client exhibits strong feelings of anger and frustration directed towards Ivan's family and their lack of support, which extends to her feelings about therapy. Her beliefs about being responsible for solving others' problems suggest a tendency to criticize perceived shortcomings in others, including the therapist. This indicates a high level of resistance that is confrontational and entrenched, aligning with an Advanced level of resistance."
  }
]